{"title":"Sexually Broken--The Unit -Real fantasies Darling Hazel Hypnotic","uid":8929495,"size":1871347043,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:001db92543388d47f7f22fc9b3ed12df6d0b9ec1&amp;dn=Sexually+Broken--The+Unit+-Real+fantasies+Darling+Hazel+Hypnotic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1379444571,"description":"The Unit - Real life fantasies from your favorite porn stars! A feature BaRS Presentation! | Darling | Hazel Hypnotic | Matt Williams\n\nSeptember 16, 2013 \n\n\nMP4 only.\n \n \nSexually Broken is proud to deliver another Feature Presentation. This weeks's update, &quot;The Unit&quot; is part one of a true life fantasy from Darling, one of the Original Bondage Models, from the birth of the internet. All of our feature presentations are ACTUAL Fantasies of the girls we shoot for these special high budget Bondage and Rough Sex(BaRS)feature presentations. \n\nTHE UNIT is a collection of highly skilled former military, former bondage producers, former porn actors. It operates across the World, and is currently running ops in the Adirondack Mountains of the East Coast of America. The Unit is highly funded and equipped with state of the art technology and resources. Funding comes from civilian clients around the globe. The wealthy, the Privileged, and occasional pro bono client, all females, all vetted, all beautiful. They pay handsomely for their sexually fantasies, and the UNIT provides.\n\nAll over the world, everyday, some of the hottest, richest females in the world look at bondage and rough sex sites and wish the girl in the production was them. They all wish for it, they all want it, but it could never happen. The sad truth is this: if you are not in porn, you will never ever, have an experience like you see on the internet, period. What if there was a way to experience something like this without being on the internet? What if you could get the same experience you see in porn, but no one would ever, ever, find out? \n\nWhat if the perfect storm of talent assembled, and created a UNIT. A UNIT with all the skills to deliver the highest quality fantasies, rough sex and amazing bondage, all in a safe sane environment? Would you sign up? Would you pay? What would you pay? You would pay any price, the UNIT knows, The UNIT does, The UNIT... is!\n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_16darling3/SexuallyBroken-Darling-Hazel-Hypnotic-Matt-Williams-The-Unit-Real-life-fantasies-from-your-favorite-porn-stars-A-feature-BaRS-Presentation.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_16darling3/SexuallyBroken-Darling-Hazel-Hypnotic-Matt-Williams-The-Unit-Real-life-fantasies-from-your-favorite-porn-stars-A-feature-BaRS-Presentation.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:001db92543388d47f7f22fc9b3ed12df6d0b9ec1","amp;dn":"Sexually+Broken--The+Unit+-Real+fantasies+Darling+Hazel+Hypnotic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"001db92543388d47f7f22fc9b3ed12df6d0b9ec1","infoHashBuffer":{"type":"Buffer","data":[0,29,185,37,67,56,141,71,247,242,47,201,179,237,18,223,109,11,158,193]},"announce":[],"urlList":[]}}