{"title":"[AssParade] - Back 2 VegASS!!","uid":8969921,"size":427800978,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0031a82be6b2ec30eb6501422a49e843881b2013&amp;dn=%5BAssParade%5D+-+Back+2+VegASS%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"pornmafia","files":-1,"time":1380315024,"description":"Title: [AssParade] - Back 2 VegASS!!\nSize: 408 MB\nDuration: 00:54:19 \nVideo Type: WMV\nResolution: 640 x 480\n\nScreenshots: &lt;a href=&quot;\nhttp://imshare.biz/?pm=MI87&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imshare.biz/?pm=MI87&lt;/a&gt;\n\nBack 2 Back Las Vegas episodes, we must be out of our fuckin' minds, HELL YEAH, we are!! This time around we're bringing back my little fuck buddy, the amazing Sara Jay and her new ASSTASTIC friend Kiara!! I met up with the girls in the Las Vegas Convention Center, at the BangBros Booth, the girls where signing autographs for all our fans, You should of been there man!! Anyways, the girls new your boy wanted to see some ass so they volunteered to show me what there working with, and damn, they got plenty of ass to work with!! Let me tell you something this new hottie Kiara has one amazing booty, her ass is like WHOA!! She loves to shake her little moneymaker all over the place!! And you know Sara Jay loves to play with ass, she was in heaven!! After some amazing public ass worship, we decided to head back to the hotel for some hardcore fucking!! You know I would have represented, but I had my homie Robert Rosenberg, from publicinvasion.com fame, do his thing with these amazing ass vixens! These girls went wild when he pulled put out his cock, they sucked that thing like crazy, you know he loved that shit cause he proceeded to pound those two amazing butts. He lined them up, stacked there amazing asses and then came on there cum loving faces, this shit was wild!! A Legendary Shoot!! Assparade Forever! Preston Parker OUT. ","torrent":{"xt":"urn:btih:0031a82be6b2ec30eb6501422a49e843881b2013","amp;dn":"%5BAssParade%5D+-+Back+2+VegASS%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0031a82be6b2ec30eb6501422a49e843881b2013","infoHashBuffer":{"type":"Buffer","data":[0,49,168,43,230,178,236,48,235,101,1,66,42,73,232,67,136,27,32,19]},"announce":[],"urlList":[]}}