{"title":"That Phat Cat (Stephanie Rose)","uid":8829254,"size":491274772,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0048707451be1930f4f1dfad77b64a4f773a4713&amp;dn=That+Phat+Cat+%28Stephanie+Rose%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KlixXxo","files":1,"time":1376921459,"description":"Screens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=wr6nnklozud3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=wr6nnklozud3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=l1jsbfnywnf7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=l1jsbfnywnf7.jpg&lt;/a&gt;\n\n\n\nTitle: That Phat Cat\nGenre: straight, amateur porn, brunette, shaved, petite\nStarring: Stephanie Rose\n\nDescription: We cruised by my old number two's crib to scope out her situation since she had a new man in her life. It's all good, there are plenty more out there, and this update proved it. As soon as we turned the corner, we saw this sweet young looking girl selling flowers. We stopped to see if she was selling water. She was not, but as soon as we got a good look at her, we had other things on our minds. Jmac spun the car around to get off the road because we had a feeling there was going to be more then just flowers coming home with us. We bought a couple bundles of flowers from Stefanie just to get her talking. She was eighteen and was working for college funds. Stefanie was perfect. She had a beautiful smile and a tight body with a great personality. We felt like we were friends right from the start. She showed us her tits after some coercing and two hundreds dollars. We got her to tell us what she thought was a good price for her to come back to the house and make some money instead of wasting time with ten dollars here and there. When we got back to our house, there wasn't much more talking because it was clear what was about to happen. Stefanie stripped down and reveled her slim tight frame with some sexy panties. They didn't stay on very long. Jmac dove right in and got her slice of pie nice and wet. She tried to get his cock in her mouth, but she could only fit so much on his third leg. She jumped on his dick for a ride, and he was loving it. He had to stop a few times because her pussy was so warm and tight. After making sure Stefanie had her fun, Jmac emptied his satchel all over her ass.\n\nDuration: 00:42:33\nLanguage: English\n\nfile\nQuality: SiteRip\nFormat: MP4\nVideo: MPEG4 Video (H264) 768x432 29.97fps 1503kbps\nAudio: AAC 32000Hz mono 32kbps","torrent":{"xt":"urn:btih:0048707451be1930f4f1dfad77b64a4f773a4713","amp;dn":"That+Phat+Cat+%28Stephanie+Rose%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0048707451be1930f4f1dfad77b64a4f773a4713","infoHashBuffer":{"type":"Buffer","data":[0,72,112,116,81,190,25,48,244,241,223,173,119,182,74,79,119,58,71,19]},"announce":[],"urlList":[]}}