{"title":"Killer is Dead JPN PS3-HR","uid":8777966,"size":5667731714,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:017e6975876053cdadeccf3fdf85fe9f01725dff&amp;dn=Killer+is+Dead+JPN+PS3-HR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"AN0NYMOUS142857","files":58,"time":1375608404,"description":"\nKiller Is Dead takes place in the near future, including such technology as lunar tourism and cybernetic enhancements. The main character is an executioner named Mondo Zappa who receives jobs from the Bryan Execution Firm. This firm, run by a cyborg named Bryan Roses, tasks Mondo with killing dangerous criminals and assassins from around the world. Mondo wields a sword with his right hand but his cybernetic left arm can be converted into many different weapons, including guns, drills, and other objects. Although Mondo travels the world as part of the game, Suda calls it a &quot;personal story&quot; of &quot;a man who doesn't show himself much in the public world but still worms his way into society and mercilessly eliminates the evil dispersed in it&quot;.&quot;Love and execution&quot; and &quot;how far can you protect someone&quot; are also central themes of the story.\n\nThe twisted mind behind controversial but adored titles such as Lollipop Chainsaw, Killer 7 and No More Heroes is back with a tale of an executioner tracking down terrorists in a cyberpunk world\nVisuals are presented in a fashion reminiscent of a moving comic book, bringing the stylish and ultra-violent world to life\nSwordplay is Mondo's preferred style, but his left bionic arm can be used for powerful punches to attack enemies or break through barriers, and it can also transform into a gun when ranged combat is necessary\nDozens of extra missions outside of the main story give players access to unlockable outfits, money to upgrade weapons, materials to aid in a pinch, and &quot;Gigolo Mode&quot; to seduce the various beautiful women Mondo meets throughout the story\n\n\nIf your ps3 language is set to English then the game will be in English. You can switch between English and Japanese voices in game.","torrent":{"xt":"urn:btih:017e6975876053cdadeccf3fdf85fe9f01725dff","amp;dn":"Killer+is+Dead+JPN+PS3-HR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017e6975876053cdadeccf3fdf85fe9f01725dff","infoHashBuffer":{"type":"Buffer","data":[1,126,105,117,135,96,83,205,173,236,207,63,223,133,254,159,1,114,93,255]},"announce":[],"urlList":[]}}