{"title":"Run WIn7_8 entirely from  USB drive or flash drive","uid":8659371,"size":26336264,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:032b50bedeaf0d68cbc470e5a08db0ee46655985&amp;dn=Run+WIn7_8+entirely+from++USB+drive+or+flash+drive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"psspss","files":1,"time":1373244485,"description":"Make Win7 or 8 Bootable for USB drive or flash drive run full win7 not PE\n\nFirst of all this is not all my work but found else where on the web\nand assembled in to a folder\n\nit could do with some tidy up. but I have tested it and I have a working\nwindows 7 ultimate running entirely of a SD card 32gb via a card reader\n\nby booting to it from the bios at laptop power on time e.g. HP pressing\nF9 to get boot menu\n\nnot HP seems to have a limit to order and how many drives it sees\nin the boot menu.. ONLY 2!\n\nso maybe best to have no other USB devices connected\n\nalso I tried the sd card reader via boot menu and never got it to work\nHP probook 4530s bios sucks.. buggy but I say ACER bios is worse on other\nlaptop cant configure much at all on that one.\n\n\n\nJust unRAR (unzip) the file and in it read the HOW TO.. a word document\n\n\n\nBasdically you install PREUSBdrive software and tick a few boxes and click\nmake USB bootable etc\nfirst  install on your existing windows and run it.. its not a stnadalone item it seems sadly so you have to run it from your menu folder shortcut\n\nthen once done..\n\nmake the Windows AIK files.. create manually a program files entry or\ndownload the other full windows installer for the windows you want to make\nquicker via the manual method. see the text file what to do.\nif you do it wrong the final install script will bomb with a error files\nnot found\n\nalso copy the bootsect file to system 32\n\nthen lastly run the NT6 installer script (cmd) and follow the prompts\n\nbrowse to the mount iso of the windows 32 ultimate and use the install.wim\n(note some isos have this missing and instead a install.ecd encrypted version\navoid those iso-s!\n\nthen enter the usb drive letter basically twice eg E\nsay Y to usb\nthen enter C\nthen enter and it will start to do the install to USB unpacking\nthe correct files to it from the ISO\n\nSimple.. takes from 1 to 2 hours depends if USB flash drive or\nproper USB drive or class of memory using..\nperhaps SSD is better.. not got one to try :/\n\n\nENJOY\n\nHELP SEED as im low on data!! and DATA CAP and speed! cheers! ","torrent":{"xt":"urn:btih:032b50bedeaf0d68cbc470e5a08db0ee46655985","amp;dn":"Run+WIn7_8+entirely+from++USB+drive+or+flash+drive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"032b50bedeaf0d68cbc470e5a08db0ee46655985","infoHashBuffer":{"type":"Buffer","data":[3,43,80,190,222,175,13,104,203,196,112,229,160,141,176,238,70,101,89,133]},"announce":[],"urlList":[]}}