{"title":"aura-dvd-copy.exe","uid":8869072,"size":8099855,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:064f86467614b5fa132e772cf1a670f62706e244&amp;dn=aura-dvd-copy.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tommix123","files":1,"time":1378007566,"description":"Aura DVD Copy - Backup your DVDs with Aura DVD Copy software\n\nDVDs can become scratched, damaged and even completely unusable over time. With Aura DVD Copy, you can easily and quickly backup your favorite DVDs. Aura DVD cloner software can copy DVD movies to computer hard drive, and make perfect 1:1 copies to new DVD discs without quality loss. Aura DVD Copy also functions as DVD decrypter and DVD shrinker.\nWith Aura DVD Copy, it is easy to backup your favorite DVDs. Aura DVD Copy is DVD copier, DVD decrypter, DVD shrinker and DVD burner.\n--- Copy: Copying DVD is fast with Aura DVD Copy. It can copy DVD to DVD, and copy DVD to computer (in DVD file folder or ISO image file) .\n--- Shrink: DVD-9 disc is typically dual layer (8.5 GB), while the common used DVD-5 disc is single layer (4.7 GB). With Aura DVD Copy, you can easily shrink DVD-9 to DVD-5.\n--- Burn: Burn DVD foler and ISO image file to DVD disc. Aura DVD Copy supports DVD+/-RW, DVD+/-R DL and DVD+/-R discs.\n--- Erase: Aura DVD Copy can erase rewritable DVD disc for burning new DVD.\nAura DVD Copy 1.3.7 is licensed as Shareware for the Windows operating system / platform. Aura DVD Copy is provided as a free to try download for all software users (Shareware).  Verson 1.3.7.0\n\n\nI don't know anything about making a crack for software.  I like this one, but you can only burn Three movies befor you have to buy.  If someone can crack that for me or try to walk me though making a crack or a keygen I, will be enternally graceful. THANK YOU, THANK YOU!!","torrent":{"xt":"urn:btih:064f86467614b5fa132e772cf1a670f62706e244","amp;dn":"aura-dvd-copy.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"064f86467614b5fa132e772cf1a670f62706e244","infoHashBuffer":{"type":"Buffer","data":[6,79,134,70,118,20,181,250,19,46,119,44,241,166,112,246,39,6,226,68]},"announce":[],"urlList":[]}}