{"title":"Laces Lawless Discography AUG '13 - GIVING AWAY ALL MY MUSIC!","uid":8826503,"size":2250703210,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:090b7b0cdaa2e652293d8e75d31e3d759fa7c429&amp;dn=Laces+Lawless+Discography+AUG+%2713+-+GIVING+AWAY+ALL+MY+MUSIC%21+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LacesLawlessOfficial","files":170,"time":1376861264,"description":"My name is Laces Lawless. I am a musician trying to gain new fans across the globe, and since performing is out of the question in my current financial state, I have decided instead to give away everything I have, to anyone who wants it.\n\nI've been creating my own electronic music for the almost last 12 years, and Laces Lawless is a 4-year-old project that I began after my last band, Oath of Vengeance, broke up.\n\nMy music can best be described as &quot;EVERYTHING.&quot; Primarily, I use heavy metal-esque rhythms, and many say that it reminds them of System of a Down, Pink Floyd, Job for a Cowboy, Eminem, ICP, and any number of other bands, since everyone hears a different sound within.\n\nAlso, EVERY SINGLE LISTENER EVER has said they think my music should be in a video game, so gamers out there...I think you'll greatly appreciate it!\n\nThe songs are very intricate, deep, always heavy, and always very emotionally thrilling, whatever that emotion may be. It's an emotional rollercoaster, so to speak.\n\n\n\nTECHNICAL DATA\n\nAudio: .WMA, rendered constant bitrate (CBR) at either 320 or 440 kbps, sampled at 48 kHz\n\n6 Studio Albums with lyrics and accompanying artwork\n(3 complete, 3 in progress)\nAlso some bonuses for my existing fanbase who will appreciate the extra wait. :)\n\n\n\n\nAs of 8/18/2013, I have 7,691 plays and 813 downloads on NewGrounds.com after 8 months, which says something. It says I need to find more fans. Ha ha.\n\nI know that on torrent websites downloaders are often worried about viruses, as I often am when perusing thepiratebay. I want to strongly state that I am no programmer, and have no desire to spread viri to others' likely expensive and impressive PCs. I only want to spread my music. I am providing many links to reputable sources of proof that I am who I say I am, and that this torrent is 100% secure, guaranteed.\n\nPlease seed, and burn copies for all your friends! I WANT you to &quot;illegally&quot; download this and &quot;illegally&quot; spread it! Since I am the content creator and have no binding legal contracts involving my material, I am therefore entitled to either charge money, or just throw CDs out the window like the newspaper man if I want to. Therefore, I am digitally throwing CDs in everyone's front yard who wants one.\n\n\nFacebook\n\nNewgrounds &lt;a href=&quot;\nhttp://laceslawless.newgrounds.com/audio/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://laceslawless.newgrounds.com/audio/&lt;/a&gt;","torrent":{"xt":"urn:btih:090b7b0cdaa2e652293d8e75d31e3d759fa7c429","amp;dn":"Laces+Lawless+Discography+AUG+%2713+-+GIVING+AWAY+ALL+MY+MUSIC%21+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"090b7b0cdaa2e652293d8e75d31e3d759fa7c429","infoHashBuffer":{"type":"Buffer","data":[9,11,123,12,218,162,230,82,41,61,142,117,211,30,61,117,159,167,196,41]},"announce":[],"urlList":[]}}