{"title":"Boston 24 Bit Vinyl Pack","uid":8823172,"size":7611305432,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0a386e4cafcb5b9a7f78da008729ba09e0a0df98&amp;dn=Boston+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"politux","files":-1,"time":1376755710,"description":"\n  Boston 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Arena Rock, Hard Rock, Album Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,600 - 3,200 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1976 Boston (two versions)\n  1978 Don't Look Back\n  1986 Third Stage (two versions)\n  1994 Walk On  \n\n  The arena rock group behind one of the fastest-selling debut albums in history, Boston was essentially the vehicle of studio wizard Tom Scholz, born March 10, 1947, in Toledo, OH. A rock fan throughout his teen years, he began writing songs while earning a master's degree at the Massachusetts Institute of Technology. After graduation, he began work for Polaroid, and set about constructing his own 12-track recording studio in the basement of his home, where demos were recorded that earned Scholz and vocalist Brad Delp a contract with Epic in 1975. Although some recording and overdubs were later done in Los Angeles, the 1976 release of Boston consisted largely of tapes recorded in Scholz's basement. (By then, the lineup had coalesced around Scholz, Delp, guitarist Barry Goudreau, bassist Fran Sheehan, and drummer John &quot;Sib&quot; Hashian.) Boston spawned three hit singles (&quot;More Than a Feeling,&quot; &quot;Long Time,&quot; and &quot;Peace of Mind&quot;), and shot immediately to the top of the charts, remaining the best-selling pop debut effort in history before it was supplanted by Whitney Houston's first album in 1986.\n\n  Despite the record's overwhelming success, Scholz spent over two years working on the follow-up, 1978's number one hit Don't Look Back; a perfectionist, he only then released the album because of intense label pressure for product. Unsatisfied with the results, he swore to produce the next album at his own pace; as a result, the chart-topping Third Stage did not appear until 1986, at which time only Scholz and Delp remained from the original lineup.\n\n  Scholz spent the next several years in the courtroom: eventually, he won a seven-year battle against Epic, which claimed Boston had reneged on its contract by taking so long between releases. When the band resurfaced again in 1994 with Walk On, Scholz was the lone remaining member; Delp and Goudreau had reunited in 1992 as RTZ, releasing the album Return to Zero. Unlike previous returns, Walk On was a commercial failure. Radio and MTV ignored any attempts at singles or videos, and the minimalist approach taken by the popular alternative artists of the era made the crystalline production and lengthy recording time seem anachronistic.\n\n  Taking another eight years to work on the next record, he targeted the Internet crowd first by releasing a single to www.MP3.com in the summer of 2002. The track became the site's number one download, and word of their new album spread quickly. (Delp's return to the group also helped matters.) Secondly, Scholz set his lyrical sights on political targets, going so far as to title the record Corporate America as he emphasized his disdain for the system he had been a vital part of at one time. After releasing the record in the fall of that year, Boston embarked on a tour that took them into 2004. In March of 2007, however, Delp passed away in an incident later ruled suicide.\n\n  In addition to his fame as a musician, Scholz also found success as an inventor and businessman. In 1981, he formed Scholz Research &amp; Design, Inc., a company founded to create high-tech music equipment. After first developing the Power Soak, a volume-control device, SR&amp;D introduced the Rockman, a small and inexpensive guitar amplifier with headphones. The Rockman proved phenomenally popular with other musicians, and the capital generated from its sales helped fund Scholz's further musical ambitions.","torrent":{"xt":"urn:btih:0a386e4cafcb5b9a7f78da008729ba09e0a0df98","amp;dn":"Boston+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a386e4cafcb5b9a7f78da008729ba09e0a0df98","infoHashBuffer":{"type":"Buffer","data":[10,56,110,76,175,203,91,154,127,120,218,0,135,41,186,9,224,160,223,152]},"announce":[],"urlList":[]}}