{"title":"Food in England - The Lost World of Dorothy Hartley (6 November","uid":8904238,"size":509255680,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b5eec1a1aa0f7fee376aeebde3d46e72daf7e7d&amp;dn=Food+in+England+-+The+Lost+World+of+Dorothy+Hartley+%286+November+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"icba345","files":1,"time":1378873183,"description":"As part of the Food, Glorious Food season, historian Lucy Worsley journeys across England and Wales in search of Dorothy Hartley, the long-forgotten writer of what is today considered to be one of the masterpieces of food writing, Food in England, published in 1954.\n\nHartley, these days a lost figure and forgotten author, spent her life between the two world wars travelling the length and breadth of the country in search of a rapidly vanishing rural Britain. She had the imagination to document and record, to photograph and illustrate (she was an accomplished artist and photographer as well as writer) the ways of life and the craft skills of farmers, labourers, village craftspeople, and itinerant workers. She recorded the way they worked, the tools they used, the techniques they adopted and the food they produced and prepared.\n\nMost of Hartley's writing is out of print and only half-remembered, but one of her published works, her magnum opus Food in England, was first published in 1954 and these days is considered to be a masterpiece on the subject of the history of what we ate.\n\nLucy Worsley traces the life of Dorothy Hartley (Dee to her friends) to try to discover something about the woman behind the book, what she was like, why she wrote in the way she did about the British rural landscape between the wars and why Food in England has had such a growing reputation amongst the hundreds of books published about food in Britain each year. ","torrent":{"xt":"urn:btih:0b5eec1a1aa0f7fee376aeebde3d46e72daf7e7d","amp;dn":"Food+in+England+-+The+Lost+World+of+Dorothy+Hartley+%286+November+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b5eec1a1aa0f7fee376aeebde3d46e72daf7e7d","infoHashBuffer":{"type":"Buffer","data":[11,94,236,26,26,160,247,254,227,118,174,235,222,61,70,231,45,175,126,125]},"announce":[],"urlList":[]}}