{"title":"Prison Architect - Alpha 14 (Linux)","uid":8992007,"size":126099596,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:0cd63cbd60296efdeb109e88b738a62e58790f29&amp;dn=Prison+Architect+-+Alpha+14+%28Linux%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dwarth","files":1,"time":1380761795,"description":"Do ya like Dawgs? This time around it's all about those furry little sniffing machines - man's best friend. UNLESS you are a dirty prisoner six feet beneath the ground trying to shawshank your way to freedom. Dogs sniff out contraband and tunnels, and should one of your prisoners make a break for it, the handlers will send up a loud cry of &quot;release the hounds&quot; and the dogs will chase down and jump on anyone who shouldn't really be sprinting toward the front gate. They come at a price though - you need a kennel and handlers and they run out of energy pretty quickly so you need to make sure you have enough to do the job. We've also included some pretty punchy performance enhancements in A14. Enjoy it, Chris' wife is birthing another nipper so it's all you're going to get until December!\n\n\n\n= Guard Dogs\nYou can now hire guard dogs from the staff menu. Every dog has a dog handler. \nDogs will sniff any nearby prisoners or hiding places, and will detect drugs, cigs etc\nDogs can sense escape tunnels and will scratch at the ground when they find one, giving the player a strong hint\nIf a dog smells a prisoner digging under them, they will dig up the prisoner and reveal the entire tunnel\nDogs are fast runners and are very good at chasing down escaping prisoners\nNote: Dogs smell drugs and detect tunnels incorrectly sometimes\nNote: If either a dog or his handler is killed, the survivor will act unpredictably for a while, before leaving the prison\n\n- Dogs can be assigned to patrols just like Guards : From the Deployment screen\nClick on &quot;Dog Patrols&quot; then click on any existing patrol to assign a dog to it\n\n= Kennels\nNew room type. Requires dog crates for each dog to sleep in\nCan be outdoor, but must be surrounded by walls or fences or doors\nDogs have an energy level represented by a green bar under their body, which discharges as they work\nWhen they become exhausted they will return to a Kennel and sleep in a dog crate to recover\nThey will also heal any injuries sustained in the line of duty\n\n= Prison Sale\nYou can now sell your prison from the Valuation report screen, and use the profits to start a new prison with a large bank balance\nYou require an Accountant on site, a minimum positive valulation of $50,000, and at least 20 prisoners to be eligable for sale\nYou can always return to a prison you have previously sold and continue managing it, but you can only sell a prison once\nNote: You cannot sell someone elses prison shared via the Steam Workshop, for obvious reasons\nNote: We are aware this system is highly exploitable, and it will remain that way until we balance the financial side of the game\n\n= Major performance optimisations\nWe have resolved numerous performance glitches and done a great deal of optimising for this alpha.\nAreas optimised : Sector system, Work Queue, Rendering \nThe navigation / route planning system has been multithreaded and will now run on a second processor core\nOn large / heavily populated maps the average frame rate is now significantly higher\n\n- Escape tunnels have been nerfed and are now much more rare.\n- Only prisoners with the &quot;Clever&quot; trait will even consider escape tunnels (10-20% of your inmates)\n- They need to have a stolen digging tool within their possession\n- Motivations for digging: Fear for life, High freedom need, Misses family\n- Prisoners caught digging will have the punishment for &quot;Escape Attempt&quot; automatically applied\n\n- Deliveries and Garbage rooms can now be placed anywhere on your prison site, including behind locked doors\n- Delivery trucks will stop and load/unload when aligned with delivery/garbage rooms\n- Prisoners will get off the truck immediately if they can walk to deliveries easily\n- However if your deliveries zone is within your prison they will be escorted in by a guard\n\n- The Load / Save dialogs now have the option to sort by &quot;Date modified&quot; as well as by filename. \nThis is very useful for quickly finding your recent prisons.\nClick on the column headings to toggle the different sorting methods\n\n- There is now much more variety for many of the existing staff types:\nMale and female versions of many staff types\nBody shapes and sizes vary\nSkin tone also varies \n\n- Planning Mode continued\nWe have extended the planning mode to permit three different types of materials:\nWalls : Plan where your walls will be\nObjects : Drag out any size of object to show where you plan to place the furniture\nPaths : Use this to mark your planned outdoor pathways\n\n- Fixed: Workers will no longer load and unload garbage in an endless loop \n(This happened when you had the Garbage zone above the Deliveries zone)\n\n- Fixed: The tooltip regarding guard patrols was being displayed in all kinds of wrong places\n\n- Fixed: All entities would drop whatever they were carrying after loading a saved game\t\t","torrent":{"xt":"urn:btih:0cd63cbd60296efdeb109e88b738a62e58790f29","amp;dn":"Prison+Architect+-+Alpha+14+%28Linux%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cd63cbd60296efdeb109e88b738a62e58790f29","infoHashBuffer":{"type":"Buffer","data":[12,214,60,189,96,41,110,253,235,16,158,136,183,56,166,46,88,121,15,41]},"announce":[],"urlList":[]}}