{"title":"Domingo Villar - Het strand van de verdronkenen. NL Ebook (ePub)","uid":8823699,"size":915644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0da44ddb9052b868ba9e0595fd54be024855994f&amp;dn=Domingo+Villar+-+Het+strand+van+de+verdronkenen.+NL+Ebook+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BiWild","files":-1,"time":1376772180,"description":"Domingo Villar - Het strand van de verdronkenen. NL Ebook (ePub). DMT\n\nAfbeelding\n\nAuteur: Domingo Villar\nPagina's: 384\nTaal: Dutch/Nederlands\nUitgever: Karakter Uitgevers B.V.\nJaar van uitgifte: 2012\nGenre: Roman\n\nSamenvatting\n\nOp een mistige herfstochtend spoelt in de haven van een klein vissersdorpje in het noordwesten van Spanje het lijk van \neen visser aan. Inspecteur Leo Caldas van het hoofdkwartier in het nabijgelegen Vigo wordt gevraagd om wat een duidelijk \ngeval van zelfmoord lijkt te onderzoeken. Al gauw komen er echter details aan het licht die van de routineklus een complex \nmoordonderzoek maken. Zonder getuigen en zonder dat er maar een spoor is van de roeiboot van het slachtoffer, probeert \nde laconieke Caldas de waarheid boven water te halen. Dat blijkt geen gemakkelijke opgave als de dorpsbewoners zo \nwantrouwend staan tegenover buitenstaanders en er al helemaal niet happig op zijn om hun verdenkingen uit te spreken. \nAls Caldas op zijn eigen nuchtere wijze door die weerbarstige houding heen weet te breken en hij zich in het maritieme \nleven van het dorp begeeft, ontdekt hij een verontrustende, decennia oude zaak van een schipbreuk en twee mysterieuze \nverdwijningen. Villar roept met zijn soepele en vloeiende stijl een even prachtig als beklemmend beeld op van een Galicisch\nvissersdorp dat op enkele tientallen zielen na verlaten is; mensen die zich uit alle macht vastgrijpen\naan oude gewoonten en tradities, en zich afsluiten voor nagenoeg elke invloed van buitenaf. \n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:0da44ddb9052b868ba9e0595fd54be024855994f","amp;dn":"Domingo+Villar+-+Het+strand+van+de+verdronkenen.+NL+Ebook+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0da44ddb9052b868ba9e0595fd54be024855994f","infoHashBuffer":{"type":"Buffer","data":[13,164,77,219,144,82,184,104,186,158,5,149,253,84,190,2,72,85,153,79]},"announce":[],"urlList":[]}}