{"title":"The King's Speech - Mark Logue &amp; Peter Conradi.epub","uid":8953992,"size":3173739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e2bcb2047107ff2bd849a3cd1fa242446941788&amp;dn=The+King%27s+Speech+-+Mark+Logue+%26amp%3B+Peter+Conradi.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1379962044,"description":"One man saved the British Royal Family in the first decades of the 20th century - he wasn't a prime minister or an archbishop of Canterbury. He was an almost unknown, and self-taught, speech therapist named Lionel Logue, whom one newspaper in the 1930s famously dubbed 'The Quack who saved a King'.\n\nLogue wasn't a British aristocrat or even an Englishman - he was a commoner and an Australia to boot. Nevertheless it was the outgoing, amiable Logue who single-handedly turned the nervous, tongue-tied Duke of York into one of Britain's greatest kings after his brother, Edward VIII, abdicated in 1936 over his love of Mrs Simpson.\n\nThis is the previously untold story of the remarkable relationship between Logue and the haunted future King George VI, written with Logue's grandson and drawing exclusively from his grandfather Lionel's diaries and archive. It throws an extraordinary light on the intimacy of the two men, and the vital role the King's wife, the late Queen Elizabeth, the Queen Mother, played in bringing them together to save her husband's reputation and reign.\n\n'The King's Speech: How One Man Saved the British Monarchy' is an astonishing insight into a private world. Logue's diaries also reveal, for the first time, the torment the future King suffered at the hands of his father George V because of his stammer. Never before has there been such a personal portrait of the British monarchy - at a time of its greatest crisis - seen through the eyes of an Australian commoner who was proud to serve, and save, his King.","torrent":{"xt":"urn:btih:0e2bcb2047107ff2bd849a3cd1fa242446941788","amp;dn":"The+King%27s+Speech+-+Mark+Logue+%26amp%3B+Peter+Conradi.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e2bcb2047107ff2bd849a3cd1fa242446941788","infoHashBuffer":{"type":"Buffer","data":[14,43,203,32,71,16,127,242,189,132,154,60,209,250,36,36,70,148,23,136]},"announce":[],"urlList":[]}}