{"title":"Alex Jones Show - 2013 Aug 09 FR [sebaygo1]","uid":8796784,"size":64536353,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0fc05e7d26204b24b71befbe6b35fd0412a3079d&amp;dn=Alex+Jones+Show+-+2013+Aug+09+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":11,"time":1376093630,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nFriday, 09 August 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: Alex covers unprecedented news today on this Friday, August 9 edition of The Alex Jones Show. The Department of Homeland Security is advising that a &quot;group of trained terrorists&quot; may plant &quot;backpack style bombs&quot; on 6th Street in Austin, Texas this weekend, which prompts memories of the Boston bombing last April. \n\nFormer Dallas Cowboys wide receiver Drew Pearson is in studio today for his take on current events (and to promote Youngevity products). \n\nCharlie Strange, father of late SEAL Team Six member Michael Strange, also joins the show. Michael, along with 30 other U.S. special operations members, died in 2011 when their Vietnam-era Chinook helicopter was shot down during landing in Afghanistan. American lawyer and activist Larry Klayman also joins the show alongside Charlie Strange. Klayman and Strange filed a class-action lawsuit against the Obama Administration over the NSA's domestic wiretapping. After Strange criticized the Obama Administration over the death of his son, Verizon told him that somebody was listening in on his phone calls.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:0fc05e7d26204b24b71befbe6b35fd0412a3079d","amp;dn":"Alex+Jones+Show+-+2013+Aug+09+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fc05e7d26204b24b71befbe6b35fd0412a3079d","infoHashBuffer":{"type":"Buffer","data":[15,192,94,125,38,32,75,36,183,27,239,190,107,53,253,4,18,163,7,157]},"announce":[],"urlList":[]}}