{"title":"Whores.Ink.XXX.DVDRip.x264-XCiTE","uid":8615386,"size":2660311891,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:12c1e42090f7caf0e393fb6030a62f8375fcdc9d&amp;dn=Whores.Ink.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":5,"time":1372239681,"description":"Acclaimed glamour-porn director Jonni Darkko knows that a girl with lots of tattoos is communicating her approach to life. She's a bad girl, she's trouble and she doesn't take shit from anyone. And in Jonni's 'Whore's INK,' five of the most heavily decorated beauties in adult entertainment show off another side of their lifestyles... their insatiable love of cock. From alt-sluts to punk princesses to mean biker bitches, these provocatively inked-up starlets prefer their action nasty and hard-core! Foxy teen Bonnie Rotten, a fishnet-clad cutie covered in skin art, deep-throats muscular studs Billy Glide and Bill Bailey. Bonnie takes their enormous dicks balls-deep inside her juicy cunt, which squirts like an orgasmic geyser, and gets her pretty face splattered in spunk!\nBusty, fully sleeved brat Christy Mack swallows Jordan Ash's big boner, rides his cock and takes gooey sperm all over her face and chest. In a studded bikini and wicked leather boots, kinky Nubian street slut Skin Diamond smokes a cigarette while getting hit on by white rocker Xander Corvus. The stunning babe sucks his fat shaft out on the sidewalk, then takes him indoors for a serious pussy pounding. Cameron Canada, a sexy blonde festooned with iconic tats, gets a rough interracial ramming from Prince Yahshua's massive black member. Finally, raven-haired Karmen Karma masturbates with a vibrating wand, then makes a messy meal of two throbbing slabs of meat. For fans of artistic chicks with a filthy edge, presents some fucking works of art!\n\nSkin Diamond, Bonnie Rotten, Xander Corvus, Billy Glide, Prince Yahshua, Jordan Ash, Bill Bailey, Christy Mack, Cameron Canada, Karmen Karma\n\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=whoresinkf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=whoresinkf.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=whoresink.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=whoresink.jpg&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:12c1e42090f7caf0e393fb6030a62f8375fcdc9d","amp;dn":"Whores.Ink.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12c1e42090f7caf0e393fb6030a62f8375fcdc9d","infoHashBuffer":{"type":"Buffer","data":[18,193,228,32,144,247,202,240,227,147,251,96,48,166,47,131,117,252,220,157]},"announce":[],"urlList":[]}}