{"title":"Lonely Lonely Chameleon + Sometimes Life Can Be Scary Ebook Comb","uid":8799216,"size":113066089,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13ac2552258a5827a332f3d0bf964253655c52aa&amp;dn=Lonely+Lonely+Chameleon+%2B+Sometimes+Life+Can+Be+Scary+Ebook+Comb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Duocyun","files":-1,"time":1376153955,"description":"Hi everyone!  Thanks for downloading The Lonely Lonely Chameleon!  I made these book for the world to enjoy, so I hope you enjoy it!  A small description of each book can be found below:\n\nThe Lonely Lonely Chameleon\n\nIt's rough being different sometimes. Top that off with living alone in a place as lively as the Big Big Forest and you have the Lonely Lonely Chameleon! And when its only friend appears to not have enough time for it the Lonely Lonely Chameleon goes on an journey to discover itself, friendship and where happiness can truly be found! If you like adventure, surprises and all sorts of animals than this book is for you!\n\nIn a more serious way Lonely Lonely Chameleon challenges the way we look at each other, how it feels to find yourself when you're made out of organic lines in a straight line world.  Most importantly it shows that things are not just simply about what lines you are made out of or belonging with others like you, but where your heart says you should be and overcoming all adversity for those you care for!\n\n\nSometimes Life Can Be Scary\n\nNo one wants to be scared! But sometimes life can be scary! What do you do during those times when life is scary and you're struggling? In this book is an honest, fair and understanding of being scared and how to be brave! Because even though life can be scary life can also be wonderful!\n\nIncluded also is a small coloring book you can print up so you can color in and make your own Lonely Lonely Chameleon adventure!  Simply print and create, great for the young and young at heart!  \n\nAlso is the video that started it all, The Lonely Lonely Chameleon Video that you can find on youtube, on your computer for on to go or a permanent place on your hard drive and in your heart.  \n\n\nThat being said, I'd also like to thank the many people who helped make this video possible including Chris Wagner and all of www.OCRemix.org 's community who allowed me to use their music which you can find all the soundtrack for below along with their information.\n\nIf you liked this and would like to purchase either The Lonely Lonely Chameleon or Sometimes Life Can Be Scary in physical book form you can at this link below:\n &lt;a href=&quot;\nhttp://www.amazon.com/The-Lonely-Chameleon-Peter-Helm/dp/0988533804&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Lonely-Chameleon-Peter-Helm/dp/0988533804&lt;/a&gt; &lt;a href=&quot;\nhttp://www.amazon.com/Sometimes-Life-Can-Be-Scary/dp/0988533812&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Sometimes-Life-Can-Be-Scary/dp/0988533812&lt;/a&gt;\n\nAnd if you'd like to visit our website you can find the link here: www.PBPanda.com\n\nHere is the music in the order they appeared in video (all from www.ocremix.org):\n\nbustatunez - Wild Child Ballad\nLevel 99 - A Simple Flip Can Change Fate\nRadiowar - Stone Drum\nJoshua Morse feat. Jeff Ball, Laura Intravia - A Glimmer of Hope\nposu yan - river of sine waves\nMustin - Now Is the Winter\nDDRKirby(ISQ) - There's Nothing Like Flying\nForrest Powell - A Tranquil Rest\nzircon, Jillian Aversa, AeroZ - Till We Meet Again\n\nAgain, thank you for watching!  Please like + share this if you enjoyed it and think of someone else who would as well!  Keep on the lookout for more book videos!  Please keep your comments appropriate, friendly and considerate of others so everyone can enjoy them!  \n\n-Peter Helm (PBPanda)","torrent":{"xt":"urn:btih:13ac2552258a5827a332f3d0bf964253655c52aa","amp;dn":"Lonely+Lonely+Chameleon+%2B+Sometimes+Life+Can+Be+Scary+Ebook+Comb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13ac2552258a5827a332f3d0bf964253655c52aa","infoHashBuffer":{"type":"Buffer","data":[19,172,37,82,37,138,88,39,163,50,243,208,191,150,66,83,101,92,82,170]},"announce":[],"urlList":[]}}