{"title":"White Racism: The Basics [blackatk]","uid":8793151,"size":839175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1463d1615b8cbc48295f84ba96a321fa7561916e&amp;dn=White+Racism%3A+The+Basics+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"blackatk","files":-1,"time":1376003601,"description":"Publication Date: November 17, 2000 | ISBN-10: 0415924618 | ISBN-13: 978-0415924610 | Edition: 2 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload. | filetype: pdf |\n\n\n\n&quot;White Racism&quot; probes white racism in contemporary society. Central to the book's analysis is a careful documentation of key events which demonstrate the process of racial victimization. The authors focus on &quot;notorious cases&quot;, including the Rodney King beating in Los Angeles and its aftermath. The analysis of lesser known anti-black activities - on a liberal college campus, in a heartland city, and in chain restaurants - reveal the everyday character of white racism. The authors' accounts give special attention to the role of stereotyping and rumour, black reaction to white racism, and the mass media's role in ritualized enactment of racialized events.\n\n\n\nPaperback: 304 pages\nPublisher: Routledge; 2 edition (November 17, 2000)\nLanguage: English\nISBN-10: 0415924618\nISBN-13: 978-0415924610\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/White-Racism-Joe-R-Feagin/dp/0415924618/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/White-Racism-Joe-R-Feagin/dp/0415924618/&lt;/a&gt;\n\n\n\n\nTags: race, racism, oppression, cyber, digital, white supremacy, white power, 88, narrative, media, pr, viewpoint, 88, ss, nsdp, aryan, nation, white narrative, contested, space, superiority, inferiority, subtle, racism, thought, logic, sociology, psychology, ethics, african, african american studies, AA, obama, militia, right, wing, mccain, bush, romney, tea, party, white anxiety, white rage, white guilt, inaction, complicity, slave, slavery, jim crow, segregation, knight, ku klux, inequality, Jim, Crow, race, racism, right, wing, republican, race coding, racially coded, subtle, doublespeak, George W Bush, George H.W Bush, Nixon, John Locke, William F Buckley, barack, obama, barry, black, biracial, IR, multiracial, preseident, bush, war, afghanistan, 2008, change, yes, we, can, hope, biden, china, afghanistan, tea, party, republican, democrat, politics, nobel, prize, war, peace, diplomacy, command, military, race, relations, racism, chicago, senator, white guilt, white anxiety, african, american, african american, black, racism, sociology, social mobiility, social climbing, mentor, race relations, race, militia, hate, nazi, white anxiety, oppression, tea party, fundamentalist, fundementalism, political science, hate group, ghettoization, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious,\n\t\t\t\t\n","torrent":{"xt":"urn:btih:1463d1615b8cbc48295f84ba96a321fa7561916e","amp;dn":"White+Racism%3A+The+Basics+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1463d1615b8cbc48295f84ba96a321fa7561916e","infoHashBuffer":{"type":"Buffer","data":[20,99,209,97,91,140,188,72,41,95,132,186,150,163,33,250,117,97,145,110]},"announce":[],"urlList":[]}}