{"title":"[EPZ]4 Stunden privat 12.german.XXX.DVDRip.x264.mp4","uid":8854105,"size":1804683288,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:14d93e88ab0b496e211194c4b223e0b756add428&amp;dn=%5BEPZ%5D4+Stunden+privat+12.german.XXX.DVDRip.x264.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cpetersem","files":-1,"time":1377562167,"description":"Title: 4 Stunden privat\nYear: 2013\nCodec: h264 \nResolution: 528x384\nAudio language: german\nPlot: Nach zwei Drinks an der heimischen Kellerbar hat Bertram Putzfrau Uschi gefuegig gemacht und fickt die klatschnasse Stute auf dem Barhocker um den Verstand. Renata, ein stadtbekanntes Luder, massiert sich erst die Moese mit Â´nem Wasserstrahl bevor Freund Ingo zum Angriff unter der Dusche uebergehen darf und dem Flittchen sein heisses Fett inÂ´s Gesicht ballern darf. Katja und Jens stehen auf mittelalterliche Spiele. In Gewaender gehuellt ficken die Zwei in Â´ner alten Ruine, bis die Schliessmuskeln den Dienst quittieren. Ingrid, dauergeile Hausfrau, 54, bekommt allmorgendlich die Dose von Nachbar Werner ausgeputzt, sobald ihr Alter aus dem Haus ist. Bumsmaschine Biggi ist die groesste Sau im Plattenbau. Den halben Block hat die Drecksgoere schon entsaftet. JenniferÂ´s Eltern sind im Urlaub. Im Ehebett laesst sich die pummelige Sperma-Fee von Freund Matthias bumsen und vollrotzen. Eva steht auf Reiterspiele und entjungfert heute ihr Arschloch. Mutter Beate wird vom Freund ihrer Tochter bestiegen und quiekt\nvor Geilheit. Silvia vom Escortservice darf heute ihre Rosette Â´nem analfixierten Kunden zur Verfuegung stellen. Elfriede laesst sich taeglich die Euter besamen, um ihren Teint aufzubessern. Alex wird auf Â´ner Streckbank im heimischen SM-Keller auf Betriebstemperatur gebracht. Gisela darf fuer Ehemann Bodo, Â´nen grobschlaechtigen Trucker, die Beine breit machen. Ines, Â´ne gute handvoll Natur-Titten, bumst fuer ihr Leben gern und steht auf Sperma. Wonneproppen Petra, Buschfotze mit dicken Dingern, laesst taeglich Â´nen Anderen rueber. Als kroenenden Abschluss duerft Ihr miterleben, wie Tanja ihre gigantischen Butterberge entbloesst und sich schamlos den Fleischtopf durchwalken laesst. Viel Spass! \n","torrent":{"xt":"urn:btih:14d93e88ab0b496e211194c4b223e0b756add428","amp;dn":"%5BEPZ%5D4+Stunden+privat+12.german.XXX.DVDRip.x264.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d93e88ab0b496e211194c4b223e0b756add428","infoHashBuffer":{"type":"Buffer","data":[20,217,62,136,171,11,73,110,33,17,148,196,178,35,224,183,86,173,212,40]},"announce":[],"urlList":[]}}