{"title":"Spirit Feathers - Mesa Music Consort","uid":8652813,"size":101834752,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1630dfa79cf062ecd057f712e68ee91e658a9c0f&amp;dn=Spirit+Feathers+-+Mesa+Music+Consort&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jojobee","files":9,"time":1373149424,"description":"\tThe myths and legends of several Native American tribes begin with the phrase: &quot;Back long ago in the time when man and all the creatures of creation spoke the same language...&quot;\n\tIn these legends various animals take on distinct personalities. For instance, Coyote is almost always cast as a trickster or jokester while Bear often takes the part of the sage or medicine man. \n\tHowever, it is the feathered creatures who most often receive special attributes in the legends, as in other aspects of Native American culture. The ability to fly is considered magical in itself, in addition to the belief that flying brought birds closer to the spirits who controlled nature. \n\tFor instance, Eagle and Hawk are highly revered for their special &quot;medicine&quot; or powers. \n\tThey are often called on by Man to counsel him concerning various situations and questions.\n\tMeanwhile, other birds, such as Crow, Robin and Sparrow, usually wind up as jokesters or the creatures who need to learn a lesson. \n\tAll of the tales from &quot;when man and all the creatures spoke the same language&quot; have a special resonance today as Man grapples with how he deals with his environment. \n\tIn recalling the ancient tales, via music, the Mesa Music Consort has incorporated the Native American flute, representing Man, in a series of duets with a variety of bird and nature sounds. \n\tThe result is a series of compositions that suggest various legends, but the details are always left to the imagination of the listener. \n\t\nTrack List:\n\n1. Winged Processional\n2. Council of the Flocks\n3. Many Feathers Chant\n4. Flight of Beauty\n5. Feather Clan Gatherings\n6. Bear's Message\n7. Gossipping Sparrows\n8. Bird &amp; Man's Council\n9. Dove's Dance\n\nRipped at 320kbps with FairStars CD ripper.\n\nIf you enjoy this music, please support these Native artists by purchasing their work! \n\nEnjoy!","torrent":{"xt":"urn:btih:1630dfa79cf062ecd057f712e68ee91e658a9c0f","amp;dn":"Spirit+Feathers+-+Mesa+Music+Consort","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1630dfa79cf062ecd057f712e68ee91e658a9c0f","infoHashBuffer":{"type":"Buffer","data":[22,48,223,167,156,240,98,236,208,87,247,18,230,142,233,30,101,138,156,15]},"announce":[],"urlList":[]}}