{"title":"Kompas Antivirus 2.0.9","uid":8902400,"size":10959803,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:18270fb8131c593bd92e00cb1e699f727d1ba43a&amp;dn=Kompas+Antivirus+2.0.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KompasAV","files":1,"time":1378835726,"description":"An efficient and easy to use antivirus that can protect your PC from various types of malware and remove any detected items from your system\n\nKompas Antivirus is a very easy to use application that aims to provide a strong security layer for your computer and remove any malware that may have infiltrated.\n\nThe antivirus program comes with several scan types and updates it database automatically so it can fight off worms, Trojan viruses, spyware, keyloggers and many more. \n\nJust relying on a single vendor is not sufficient to completely protect you. You do need a second layer \nto make sure you are secure. Kompas Antivirus features simple interface to make it simple and easy to use.\n\n1. Work alongside existing with other antivirus software without any conflicts.\n\n2. Advanced heuristic techniques for detecting file infector viruses and VBS worms.\n\n3. Best USB Antivirus with advanced heuristic techniques for preventing the spread of malware through USB flash drive.\n\n4. The databases are regularly updated automatically with records of new threats.\n\n5. Unlike some free software titles, Kompas Antivirus will remove all threats for free.","torrent":{"xt":"urn:btih:18270fb8131c593bd92e00cb1e699f727d1ba43a","amp;dn":"Kompas+Antivirus+2.0.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18270fb8131c593bd92e00cb1e699f727d1ba43a","infoHashBuffer":{"type":"Buffer","data":[24,39,15,184,19,28,89,59,217,46,0,203,30,105,159,114,125,27,164,58]},"announce":[],"urlList":[]}}