{"title":"EXPLOITED COLLEGE GIRLS - Zoey - Petite Blonde Teen Creampied HD","uid":8793516,"size":1694521628,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:19abb0464086d41f43838a2a799af94674910ac2&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Zoey+-+Petite+Blonde+Teen+Creampied+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beta2008x","files":1,"time":1376013346,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=lbe5e_zyo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=lbe5e_zyo.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=p3c53_ecg_13_08_08_zoey_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=p3c53_ecg_13_08_08_zoey_s.jpg&lt;/a&gt;\n\nThis week I've got something special for you guys who love spinners: Zoey, a self confessed nympho, she admits to loving rim jobs and ass licking and happily takes a huge creampie before telling me she's not on birth control. Aside from that, shes an all American hottie with blonde hair and blue eyes and a gymnast's body, oh and did I mention that she's only 4'11&quot;? As nice and innocent as she looks, she quickly dispels that when I start interviewing her, she reveals that she's as dirty minded as I am (well almost.) So this update just got reclassified as AWESOME.\n\nI get the idea to test out her nympho credentials right away with a little road head, and Zoey does NOT disappoint. Her oral skills are way, way above par and after 2-3 mins she almost has me ready to blow a load in her mouth. When she takes a break from sucking and begs me take her back to the hotel to fuck her, I'm already putting the car in gear. So this update just got reclassified as...what's better than awesome?\n\nWhen we get back to the location everything is already set up so we get right to the good stuff. Zoey strips and shows off a beautiful, hard little body with a nice meaty pink pussy. Seeing her sitting there with her huge smile and tiny titties, I am definitely excited. This girl is a real breath of fresh air. I dig around int he ECG toybox and come up with a vibrator, but it proves to be too much. The vibrations have her on the edge of orgasm within a few moments and she can hardly take it and needs a break.\n\nFortunately her mouth doesn't need a break. I have her drop to her knees and start sucking, which she does with enthusiasm. I don't know how long it's been since I had a girl this excited about having a dick in her mouth, but it's making for a fantastic update. Recalling our interview, I hop up on the bed and have Z go to town on my ass. Nothing gets me harder than a nice rim job so I move Zoey to the bed to give her what she's wanted all along.\n\nIf you have any question as to how much of a nympho Zoey really is, just take a close look at her pussy as I fuck her. Just saying she gets wet would be an understatement, she gets downright gooey as she rides me. When I spin her around on my cock (hence the intro - a real live spinner) you can tell that this is a girl who absolutely loves to fuck. I get her through several positions before I'm done for an spray my load in/on her pussy.\n\nAnd...this is where we have that uncomfortable conversation about birth control. I have been doing this for a while and if you are a loyal fan you can back me up on this, why the hell do girls always giggle after I've just blown all or part of a 3 gallon cumshot in their puss and they admit that they're not on birth control? Maybe it's a guy/girl thing but if I was a chick and there was the possibility of getting impregnated by a creepy guy who runs an amateur porn site...I wouldn't giggle. Anyhow, Zoey: spinner, nympho, fine ass blonde and possibly baby momma!\n\n","torrent":{"xt":"urn:btih:19abb0464086d41f43838a2a799af94674910ac2","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Zoey+-+Petite+Blonde+Teen+Creampied+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19abb0464086d41f43838a2a799af94674910ac2","infoHashBuffer":{"type":"Buffer","data":[25,171,176,70,64,134,212,31,67,131,138,42,121,154,249,70,116,145,10,194]},"announce":[],"urlList":[]}}