{"title":"Buttsex.Nymphos.2.DiSC2.XXX.DVDRip","uid":8779438,"size":1019359201,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1be5792c7df39c01f2a252db1da074592e8395a7&amp;dn=Buttsex.Nymphos.2.DiSC2.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1375642603,"description":"Six lovely, insatiable anal sluts get their sweet booties thoroughly defiled in director Mike Adriano, his newest two-disc anal extravaganza. Mikes well-known for his total obsession the female back entrance, and the directors filthy-minded babes are eager to treat their fine asses to his huge cock, sphincter-stretching games and intimate ass-to-mouth perversions. Perky blonde Zoey Monroe wetly gags on Mikes big boner and takes a ferocious ass reaming that leaves her rectum gaping lewdly. Next, Mike thrusts his tongue deep into busty Tasha Reigns butthole, and she returns the favor with some rimming and cocksucking followed by a session of hard-core sodomy and a messy cum facial. Super-stacked Blake Rose seduces Mike with her massive rack and phat, juicy ass. After hes plowed her tender bunghole, Blake hungrily swallows a hot load of sperm. Bespectacled bimbo Kimmy Olsen gets face-fucked and sodomized until her soft derriere is wrecked and dilated. And pale, naturally blessed Jennifer Whites jiggling rump takes a deep dicking that earns the beautiful slut a taste of fresh semen. Theres also a bonus scene in which auburn-haired cutie Sasha Casey teaches older Italian stud Claudio some dirty Russian words in a rather explicit demonstration. Some girls can never get enough cock, and the anal aficionados of know that when it comes to true sexual fulfillment, the entrance is in the rear!\n\nBlake Rose, Jennifer White, Kimmy Olsen, Tasha Reign, Zoey Monroe\n","torrent":{"xt":"urn:btih:1be5792c7df39c01f2a252db1da074592e8395a7","amp;dn":"Buttsex.Nymphos.2.DiSC2.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1be5792c7df39c01f2a252db1da074592e8395a7","infoHashBuffer":{"type":"Buffer","data":[27,229,121,44,125,243,156,1,242,162,82,219,29,160,116,89,46,131,149,167]},"announce":[],"urlList":[]}}