{"title":"Gallagher Girls 02 - Cross My Heart and Hope to Spy","uid":9029391,"size":359265339,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1f5fa081bf89d83e0368cbbb4afd3517254f54ad&amp;dn=Gallagher+Girls+02+-+Cross+My+Heart+and+Hope+to+Spy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"KatSucks","files":9,"time":1381430823,"description":"After staking out, obtaining, and then being forced to give up her first boyfriend, Josh, all Cammie Morgan wants is a peaceful semester. But that's easier said than done when you're a CIA legacy and go to the premier school in the world . . . for spies.\nCammie may have a genius I.Q., but there are still a lot of things she doesn't know. Like, will her ex-boyfriend even remember she exists? And how much trouble is she really in after what happened last semester? And most of all, why is her mother acting so strangely?\nDespite Cammie's best intentions to be a normal student, danger seems to follow her. She and her friends learn that their school is going to play host to some mysterious guests--code name: Blackthorne. Then she's blamed for a security breach that leaves the school's top secret status at risk.\nSoon, Cammie and her friends are crawling through walls and surveilling the school to learn the truth about Blackthorne and clear Cammie's name. Even though they have confidence in their spy skills, this time the targets are tougher (and hotter), and the stakes for Cammie's heart--and her beloved school--are higher than ever.\n\nUnabridged audio book.  Decently read.","torrent":{"xt":"urn:btih:1f5fa081bf89d83e0368cbbb4afd3517254f54ad","amp;dn":"Gallagher+Girls+02+-+Cross+My+Heart+and+Hope+to+Spy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f5fa081bf89d83e0368cbbb4afd3517254f54ad","infoHashBuffer":{"type":"Buffer","data":[31,95,160,129,191,137,216,62,3,104,203,187,74,253,53,23,37,79,84,173]},"announce":[],"urlList":[]}}