{"title":"Lesbian.Anal.POV.3.XXX.DVDRip.x264-Pr0nStarS","uid":8798365,"size":1803890930,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:20fc66bdeda4999daa91237510fa2a60536d5765&amp;dn=Lesbian.Anal.POV.3.XXX.DVDRip.x264-Pr0nStarS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1376132623,"description":"Categories: Lesbian , Anal , POV\n Series: Lesbian Anal POV\n Director: Dana Vespoli\n Starring: Dana Vespoli , Anikka Albrite , Skin Diamond , Jessie Volt , Bailey Blue\n\n Kinky, exotic performer Dana Vespoli has been carving out her own niche at Evil Angel, creating intensely dramatic features and fetishistic gonzo videos - the latter finding an audience hungry for Dana's brand of intimate, girl-on-girl perversion. In 'Lesbian Anal P.O.V. 3,' the gorgeous director gets up-close and personal with four of her favorite younger starlets. First, a Sapphic play date with petite, tattooed black princess Skin Diamond: Dana fondles Skin's small, pert titties in the back seat of a moving car, even penetrating her butthole with a big toe! In a seaside rendezvous, Dana eats Skin's pussy and fucks her asshole with a strap-on dildo; Skin sucks Dana's strap-on ass-to-mouth. Next, adorable blonde Bailey Blue takes Dana to the mall and leads the way to a department store fitting room. The director's fingers explore Bailey's taut, tender butthole, and the girls take turns eating pussy for some semi-public thrills!\n\n All-natural French knockout Jessie Volt stretches her sphincter using a fat glass butt plug, and by the time Dana's finished working Jessie over, the French blonde's anus is gaping with pleasure. Lastly, blonde bombshell Anikka Albrite hikes out to the desert with Dana. The lovely ladies stretch out on a blanket, where Dana hungrily laps Anikka's steamy cunt and reams her rump with a long dildo. They passionately finger-fuck to intense climaxes. Including several revealing bonus interviews, 'Lesbian Anal P.O.V. 3' puts three great obsessions together in one sensuous package ... and puts viewers in the driver's seat.\n\n\n &lt;a href=&quot;\nhttp://bayimg.com/laooeaAed&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/laooeaAed&lt;/a&gt;","torrent":{"xt":"urn:btih:20fc66bdeda4999daa91237510fa2a60536d5765","amp;dn":"Lesbian.Anal.POV.3.XXX.DVDRip.x264-Pr0nStarS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20fc66bdeda4999daa91237510fa2a60536d5765","infoHashBuffer":{"type":"Buffer","data":[32,252,102,189,237,164,153,157,170,145,35,117,16,250,42,96,83,109,87,101]},"announce":[],"urlList":[]}}