{"title":"Time Team America - Season 1 (2009) - 5 Episodes","uid":8651865,"size":1770273453,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:221363773f2f37142e73838cbb94b10da35e0ce0&amp;dn=Time+Team+America+-+Season+1+%282009%29+-+5+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":14,"uploader":"bnaron","files":6,"time":1373127340,"description":"Time Team America - Season 1 (2009) - 5 Episodes\n\nTime Team America is a new science-reality series from PBS that sends some archaeologists on a race against time to dig up historic sites around the nation. The team has exactly 72 hours to uncover the buried secrets of their assigned digs using the latest modern technology, decades of expertise and their own sharp smarts. Host Colin Campbell guides each expedition as viewers watch these archeologists, diggers, scientists and historians at work. The audience can really see how these archeologists work and the cool history they discover. You never know what they'll dig up next! Time Team America aired on PBS stations during the Summer of 2009.\n\nS01E01 - Fort Raleigh, North Carolina - Res=624x352 - fps=29 - bps=768k - Audio=mp3 - Bit Rate=96k\n\n        Time Team travels to Roanoke Island in the Outer Banks of North Carolina in search of Fort Raleigh, the first English settlement in America. The team has just three days to identify the location of the settlement, known as the Lost Colony, which has remained a mystery for over 400 years.\n\nS01E02 - Topper, South Carolina - Res=624x352 - fps=29 - bps=768k - Audio=mp3 - Bit Rate=96k\n\n        Deep in South Carolina lies Topper, a remarkable site challenging our understanding of America's first inhabitants. The site is providing material left behind by the Clovis people, but is also challenging theories about when people first came to the American continent. Join Time Team as they hunt for evidence that could shed light on these controversial new theories.\n\nS01E03 - New Philadelphia, Illinois - Res=1280x720 - fps=29 - bps=768k - Audio=mp3 - Bit Rate=96k\n\n        Beneath farmlands in Western Illinois lie the remains of New Philadelphia, the first American town founded by a free African American prior to the Civil War. Time Team America was invited to help search for the schoolhouse where New Philadelphia's African American children learned to read and write in freedom.\n\nS01E04 - Range Creek, Utah - Res=1280x720 - fps=29 - bps=768k - Audio=mp3 - Bit Rate=96k\n\n        Time Team investigates a remote area in eastern Utah that may hold clues to the lives of the Fremont People who lived over 1000 years ago. Most of the sites in the canyon remain virtually untouched, providing a rare opportunity to find out what may have happened to the people who once flourished there.\n\nS01E05 - Fort James, South Dakota - Res=640x352 - fps=29 - bps=768 - Audio=mp3 - Bit Rate=96k\n\n        In 1865, a unit of cavalry soldiers was sent west to keep the peace between incoming pioneer settlers and the Sioux Indians in what is now South Dakota. The soldiers built Fort James, one of the few stone forts on the American frontier. Time Team America traveled to South Dakota to find out how much of the fort survives so that it can be protected for future research.\n","torrent":{"xt":"urn:btih:221363773f2f37142e73838cbb94b10da35e0ce0","amp;dn":"Time+Team+America+-+Season+1+%282009%29+-+5+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"221363773f2f37142e73838cbb94b10da35e0ce0","infoHashBuffer":{"type":"Buffer","data":[34,19,99,119,63,47,55,20,46,115,131,140,187,148,177,13,163,94,12,224]},"announce":[],"urlList":[]}}