{"title":"POtHS - B I B L E    W O R K S   9 - Bible Software - Scholars V","uid":9019398,"size":12783479965,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2610806949757df4bfcded7128446ebf68f9b6ca&amp;dn=POtHS+-+B+I+B+L+E++++W+O+R+K+S+++9+-+Bible+Software+-+Scholars+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1381264860,"description":" POtHS - E V I L - U T I O N - School Your Professor on The Facts\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&lt;/a&gt;\n\n\nPO t HS\n\nPouring Out the Holy Spirit\n\n\n\nPOtHS - B I B L E    W O R K S   9 - Bible Software - Scholars Version\n\n\nPOtHS Comment: DID YOU KNOW that 89% of self-proclaiming Christians think all you have to do to get to Heaven is get Water Baptized and do &quot;Good Deeds&quot; These are The Christians the will be left behind to loose their Heads in FEMA Guillotines. That is The Part that THEY DIDN&quot;T get right. To get Jesus now scroll down the Page. It is just a couple things you need to do and you can do it alone in your Room right now. Time is Short Friends.\n\nDescription:\n\nBibleWorks 9 - $359\n &lt;a href=&quot;\nhttp://store.bibleworks.com/fullversion.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.bibleworks.com/fullversion.html&lt;/a&gt;\n\nBibleWorks 9 is a large collection of software tools and database resources designed specifically to assist pastors, seminary students, professors and missionaries in their exegesis of the Biblical text. It contains more than 200 Bible translations in nearly 40 languages, 45 original language texts and morphology databases, 29 lexical-grammatical references, and a wealth of practical reference works. These include Greek and Hebrew sound files, Bible maps, Greek New Testament diagrams, Greek and Hebrew grammars, new transcriptions and image sets for seven of the most important Greek New Testament manuscripts, and the full CNTTS New Testament apparatus. These resources are presented to the user through a sophisticated but easy to use user interface that includes two powerful search engines and dozens of ways to organize, present and analyze the results of your research. To help the user master the program a comprehensive set of videos is included. A small number of critical databases are available as add on resources, but the base package contains everything that a busy pastor needs to help him use his study time wisely and efficiently. Like no other set of software tools, BibleWorks focuses on the central task of understanding the text of Scripture. It contains everything that you need and nothing that you don't need.\n\nBibleWorks is distributed on DVD (not as a download yet: see explanation here) and will run on any PC version of Windows (XP or later). It will also run, using additional supporting software described (and, in the case of the BibleWorks 9 Mac Installer, available for order) here, on Mac computers.\n\nWhen purchased directly (on this page or using one of the ordering options here, BibleWorks comes with the option for a 30 day return and full refund (less shipping).\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n          Thank You JESUS -  Thank You JESUS  -  Thank You JESUS\n\n \n","torrent":{"xt":"urn:btih:2610806949757df4bfcded7128446ebf68f9b6ca","amp;dn":"POtHS+-+B+I+B+L+E++++W+O+R+K+S+++9+-+Bible+Software+-+Scholars+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2610806949757df4bfcded7128446ebf68f9b6ca","infoHashBuffer":{"type":"Buffer","data":[38,16,128,105,73,117,125,244,191,205,237,113,40,68,110,191,104,249,182,202]},"announce":[],"urlList":[]}}