{"title":"Hidden Order - A Thriller","uid":8777398,"size":1599529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:289379014a5c9ca09eb3f17ec2ef583d5601faa2&amp;dn=Hidden+Order+-+A+Thriller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"livhre","files":-1,"time":1375591910,"description":"\nFormat: ePub\n\nDRM stripped in Calibre.\n\nThe most secretive organization in America operates without any accountability to the American people. Hiding in the shadows, pretending to be part of the United States government, its power is beyond measure.\n\nControl of this organization has just been lost and the future of the nation thrust into peril.\n\nWhen the five candidates being considered to head this mysterious agency suddenly go missing, covert counterterrorism operative Scot Harvath is summoned to Washington and set loose on the most dangerous chase ever to playout on American soil.\n\nBut as the candidates begin turning up murdered, the chase becomes an all-too-public spectacle, with every indicator suggesting that the plot has its roots in a shadowy American cabal founded in the 1700s.\n\nWith the United States on the verge of collapse, Harvath must untangle a web of conspiracy centuries in the making and head off the greatest threat America has ever seen.\n\nThis is thriller writing at its absolute best, where the stakes have never been higher, nor the line between good and evil so hard to discern. \n\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload. Go to kobobooks.com and choose books that you want uploaded and request them in the comments.\nNote: Comics on that site are in some weird ass format that only works on iOS and Android. To get those I have to go through the tired process of screen shots of each page, then create a word file, then convert to epub. Its a pain because even then the images may not show up right on some devices/apps.","torrent":{"xt":"urn:btih:289379014a5c9ca09eb3f17ec2ef583d5601faa2","amp;dn":"Hidden+Order+-+A+Thriller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"289379014a5c9ca09eb3f17ec2ef583d5601faa2","infoHashBuffer":{"type":"Buffer","data":[40,147,121,1,74,92,156,160,158,179,241,126,194,239,88,61,86,1,250,162]},"announce":[],"urlList":[]}}