{"title":"Keith Sharpe - The Gay Gospels: Good News for LGBT People","uid":8843967,"size":1049939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cecac85ce705a2c42b2bf9f148885f1e6232f6b&amp;dn=Keith+Sharpe+-+The+Gay+Gospels%3A+Good+News+for+LGBT+People&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmakate","files":-1,"time":1377326099,"description":"Keith Sharpe - The Gay Gospels: Good News for Lesbian, Gay, Bisexual, and Transgendered People (Circle Books, 2011)\n\nEpub and mobi formats from a retail source.\n\n\ndescription:\n\nThe place of lesbian, gay, bisexual and transgendered people in the Christian churches is a highly controversial issue. The stance of all the mainline churches is that homosexuality is sinful and incompatible with Christianity. In seeking to respond to attacks on their lives, identities and relationships LGBT Christians have moved over recent decades from a defensive position to a more affirmative position which asserts that there is evidence in the Bible and the Jesus tradition of validated homoerotic experience. This book presents a systematic overview of both the defensive and affirmative positions. In part one, The Defensive Testament, each of the so-called 'biblical texts of terror' used to demonise LGBT people is considered in turn and found wanting. None of them has anything to say about consensual same sex love. In part two, The Affirmative Testament, homoerotic elements in various Bible stories including the healing of the centurion's servant, Jesus and the beloved disciple, David and Jonathan, Ruth and Naomi are revealed to make visible the place of LGBT lives in the Biblical tradition. Taken together, these two testaments forcefully champion the equality of LGBT people in the Kingdom of God and represent a formidable challenge to ecclesiastical homophobia.\n\nReview\n\n'Everybody involved in the debate over the place of gay people in the Church and in society generally should read this book. It is a faith- and life-affirming book for the LGBT community, it is a terrific read and I recommend it wholeheartedly.'\n\nBen Bradshaw MP, Former Secretary of State for Culture, Media and Sport in the British Government\n\n'The Gay Gospels is a welcome challenge to heterosexist attitudes wherever they may be found in the Christian Church.'\n\nThe Very Reverend John Packham, Bishop of Ripon and Leeds, United Kingdom\n\nAs Director of an evangelical outreach ministry to lesbian and gay people, I am constantly reminded of the way that church teachings on homosexuality have caused immense damage to human lives and relationships. With superb clarity of style and presentation, Dr Sharpe successfully demonstrates in 'The Gay Gospels' that these harsh teachings have no basis either in the Bible or in the mission of our Lord and Saviour, Jesus Christ. This book will be of enormous value to all involved in the debate over homosexuality and Christianity currently raging in the church and wider society. (Jeremy Marks, Director of Courage UK). Do you think that the Bible condemns LGBT people for wanting loving and intimate relationships with people of their own sex? At the London Lighthouse AIDS hospice it was evident that such homophobic distortion can and does blight lives. This humane and scholarly book helps us to a truer understanding of God's love for all human beings, and how those insights developed in the history of the Christian faith, chronicled in the Bible. \n\nAndrew Henderson, Founding Co-chair of London Lighthouse","torrent":{"xt":"urn:btih:2cecac85ce705a2c42b2bf9f148885f1e6232f6b","amp;dn":"Keith+Sharpe+-+The+Gay+Gospels%3A+Good+News+for+LGBT+People","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cecac85ce705a2c42b2bf9f148885f1e6232f6b","infoHashBuffer":{"type":"Buffer","data":[44,236,172,133,206,112,90,44,66,178,191,159,20,136,133,241,230,35,47,107]},"announce":[],"urlList":[]}}