{"title":"Alex Jones Show - 2013 Oct 09 WE [sebaygo1]","uid":9025325,"size":67385155,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2f987c52c88f155f067f6df5e8c6a1c4ad8af205&amp;dn=Alex+Jones+Show+-+2013+Oct+09+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1381360546,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 09 October 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Wednesday, October 9 edition of The Alex Jones Show, Alex delves into aspects of the crumbling economy as Obama proposes establishment insider Janet Yellen to head up the Federal Reserve and oversee the ongoing destruction of the U.S. economy. \n\nHe also covers Rep. Sheila Jackson Lee's suggestion that martial law be declared to put an end to the supposed government shut down. \n\nOn today's show, Alex talks with William Robert &quot;Tosh&quot; Plumlee, a former CIA contract pilot targeted for posting questions about the government secretly arming Syrian mercenaries in an &quot;off-the-books&quot; covert operation by the CIA. \n\nAlex also talks with Oath Keepers founder and former Ron Paul staffer Stewart Rhodes in-studio. Rhodes will talk about forming &quot;civilization preservation teams&quot; to provide community civil defense, sheriff posses, strengthening volunteer fire, search-and-rescue, reserve deputy systems, and eventually assist in forming and training town and county militias.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:2f987c52c88f155f067f6df5e8c6a1c4ad8af205","amp;dn":"Alex+Jones+Show+-+2013+Oct+09+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f987c52c88f155f067f6df5e8c6a1c4ad8af205","infoHashBuffer":{"type":"Buffer","data":[47,152,124,82,200,143,21,95,6,127,109,245,232,198,161,196,173,138,242,5]},"announce":[],"urlList":[]}}