{"title":"Lexs.Breast.Fest.DiSC1.XXX.DVDRip.x264-Pr0nStarS","uid":8936989,"size":1407403394,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:30063152d044861d0b9922a0ec4aa6c4a926b8ab&amp;dn=Lexs.Breast.Fest.DiSC1.XXX.DVDRip.x264-Pr0nStarS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":3,"time":1379591818,"description":"Category All Sex, Interracial, Big Tits, Big Dicks\n\n Director Lexington Steele\n Starring Jayden Jaymes, Bridgette B, Lexington Steele, Krissy Lynn, Sophie Dee, Angelina Valentine, Richelle Ryan\n\n Jayden's Superstar Tits Smothered Lex, While His 11 Inches Stretched And Smothered Her Pussy!\n\n Bridgette's Perfect Breasts Couldn't Survive Without Lex's Meat And Her Wish Finally Came True!\n\n Lex Wasn't Sure If Richelle Could Hang, But Thsi Casting Call Showed That She Was Ready For Prime Time!\n\n Lex Discovers Krissy And Sophie In A Sapphic Encounter, And Can't Help But Inject Himself Into The Situation!\n\n Lex Has To Use His Worldly Powers To Lay Pipe In Angelina!\n\n Legendary ebony cocksman Lexington Steele is an accomplished director with a deep attraction for buxom sluts. And the super-stacked bombshells in 'Lex's Breast Fest,' the stud filmmaker's latest boob-centric interracial masterpiece, are positively top-heavy with talent! In five sizzling scenes of hard-core boob worship and fucking, Lex's creative libido and enormous black cock tame his voluptuous vixens ... and ultimately shower them with his hot, creamy sperm. First up are dark-haired Sophie Dee and blonde bombshell Krissy Lynn, a pair of shapely lesbians worshiping one another's massive mammaries; Lex joins in, and Krissy and Sophie slide his throbbing fuck pole between their glistening jugs. They ride him to orgasm, with Krissy taking a thorough anal pounding!\n\n Next, big-boobed brunette bombshell Jayden Jaymes releases Lex's huge black cock and lovingly licks it like a lollipop until he fucks her silly. Incredibly busty Latina glamazon Bridgette B. calls up Lex for some phone sex, and soon welcomes the director into her kitchen for a hot interracial house call that leaves the curvaceous wench sore but satisfied. Tanned, curvy bombshell Richelle Ryan shows up late for her audition. At first he's pissed, but when Lex sees the sassy slut's enormous hooters bursting from her sequined bikini top, he loses all professional detachment!\n\n Lastly, globe-breasted porn slut Angelina Valentine gives Lex a nasty lap dance; she grinds on his lap and gets royally fucked until he splatters her whore face with jism.\n\n\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=16279487164667061541.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=16279487164667061541.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=46816202798275846693.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=46816202798275846693.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=81070084754710179742.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=81070084754710179742.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:30063152d044861d0b9922a0ec4aa6c4a926b8ab","amp;dn":"Lexs.Breast.Fest.DiSC1.XXX.DVDRip.x264-Pr0nStarS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30063152d044861d0b9922a0ec4aa6c4a926b8ab","infoHashBuffer":{"type":"Buffer","data":[48,6,49,82,208,68,134,29,11,153,34,160,236,74,166,196,169,38,184,171]},"announce":[],"urlList":[]}}