{"title":"Stories of Boobs 9 - german XXX DVDRip x264 [EPZ].mp4","uid":8964653,"size":805711117,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:31c9d3c831ca2c6956de8bd7047da40d325ad402&amp;dn=Stories+of+Boobs+9+-+german+XXX+DVDRip+x264+%5BEPZ%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cpetersem","files":1,"time":1380190192,"description":"Stories of Boobs 9 - german XXX DVDRip x264 [EPZ]\n[b]Stories of Boobs 9 - german XXX DVDRip x264 [EPZ][/b]\n\nTitle: Stories of Boobs 9\nStudio: Erotic Planet\nYear: 2013\nCodec: h.264 Mpeg4 AVC\nResolution: 528x384\nAudio language: german\n\nZdenka, ne Euter-Fee der Sonderklasse, laesst sich auf nem Tresen die Rosette sprengen und direkt aus dem Arsch ins Maul spritzen. Jenny, ausgestattet mit zwei Milchbotten zum Dahinschmelzen, bekommt ne heisse Ladung direkt auf die Euter. Christal und Protz-Titten-Freundin Emanuelle lassen sich von zwei hengstschwaenzigen Zuchtbullen die Spalten polieren. Larissa, mit rekordverdaechtigen Wohlstandshuegeln wie aus dem Bilderbuch, steht auf Open-Air-Sex. An einem Badesee reitet das Luder nem Samenstaugeplagten das kochende Fett aus der Huefte. Tatjana, bestueckt mit wahrhaft gigantischen Reklamehuegeln, zeigt unter der Dusche, was eine triebige Sau mit nem Dildo so alles anstellen kann.\nJennifer und Simone, zwei waschechte Busen-Braeute mit knackigem Vorbau, lassen sich in der Disko ihre Enddaerme ner wahren Zerreissprobe unterziehen. Laura ist die ungekroente Titten-Koenigin. Gute 15 Kilo pure Lust versteckt das Luder in ihrer Bluse und steht ausserdem auf Analsex! Lara melkt nen steifgeblasenen Prengel mitten im Wald mit ihren schaedelechten Kurven ab. Rachel hat richtig Holz vor der Huette. Mitten im Buero lebt die kleine Sau ihre SM-Neigung mit abgebundenen Bruesten genuesslich aus. Daria, Linda und Gloria lassen sich quer durch den Garten voegeln und die Paradiesaepfel vollrotzen. Lucy, speckbaeuchig mit dicken Moepsen, braucht taeglich ihre Ladung Sperma. Krystal punktet mit tellerminenbestueckten, waffenscheinpflichtigen Haubitzen.\nMelanie laesst sich zusammen mit Freundin Lisa von nem Afro die Meierei vollrotzen. Moppel Clara zeigt nen 1a Tittenfick und Knallkoerper Katy laesst ihre schweren Lollos im Takt der analen Stoesse erzittern. Viel Spass!","torrent":{"xt":"urn:btih:31c9d3c831ca2c6956de8bd7047da40d325ad402","amp;dn":"Stories+of+Boobs+9+-+german+XXX+DVDRip+x264+%5BEPZ%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31c9d3c831ca2c6956de8bd7047da40d325ad402","infoHashBuffer":{"type":"Buffer","data":[49,201,211,200,49,202,44,105,86,222,139,215,4,125,164,13,50,90,212,2]},"announce":[],"urlList":[]}}