{"title":"Nine Inch Nails 24 Bit Vinyl Pack","uid":8842394,"size":10157399573,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31f33d2e9b231111e5a5bc814d70a08f10c791b5&amp;dn=Nine+Inch+Nails+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"politux","files":-1,"time":1377282083,"description":"\n  Nine Inch Nails 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock, Electronic\n  Styles: Industrial, Heavy Metal, Alternative\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  Broken\n  Ghosts I-IV\n  Pretty Hate Machine (Remaster)\n  The Downward Spiral \n  The Fragile\n  The Slip\n  White Teeth\n  Year Zero\n\n  Nine Inch Nails were the most popular industrial group ever and were largely responsible for bringing the music to a mass audience. It isn't really accurate to call NIN a group; the only official member is singer/producer/multi-instrumentalist Trent Reznor, who always remained solely responsible for NIN's musical direction (he was, however, supported in concert by a regular backing band). Unlike the vast majority of industrial artists, Reznor wrote melodic, traditionally structured songs where lyrics were a focal point. His pop instincts not only made the harsh electronic beats of industrial music easier to digest, but also put a human face on a style that usually tried to sound as mechanical as possible. While Ministry crossed over to heavy metal audiences, NIN built up a large alternative rock fan base right around the time of Nirvana's mainstream breakthrough. As a result, Reznor became a genuine star and his notoriously dark, brooding persona and provocateur instincts made him a Jim Morrison-esque sex symbol for the '90s. A long period of inactivity and writer's block followed, which gave virtually every alternative metal band of the late '90s a chance to rip off elements of NIN's sound. By the time Reznor's five-year hiatus finally ended, he was still a popular figure but his commercial momentum had slowed somewhat.\n\n  Michael Trent Reznor was born May 17, 1965, in the small town of Mercer, Pennsylvania; he went by his middle name to avoid confusion with his father, Michael. At age five, Reznor's parents divorced and he wound up being raised mostly by his maternal grandparents; even so, Reznor stated repeatedly that his childhood was mostly happy. He began playing the piano at age five, studying classical music, and later learned tenor sax and tuba in the school band; he also acted in musicals and became an avid Kiss fan. Reznor spent a year studying music and computers at Allegheny College, but dropped out after a year to pursue music full-time; he soon packed up and moved to Cleveland with high school friend Chris Vrenna. Around the same time, he was discovering new wave and assorted underground music; he was most fascinated with early industrial, since it offered an edgy, aggressive way to use electronic instruments. At age 19, he successfully auditioned to join an AOR band called the Innocent, which released one album, Livin' in the Streets (Reznor's picture does appear on the jacket). He quit the Innocent after just three months and subsequently gigged with local bands; he also worked in a keyboard store and as a janitor in the local Right Track recording studio. Eventually, he became a studio engineer, teaching himself various computer applications and working on his own material during off hours. In 1987, Reznor appeared in the Michael J. Fox/Joan Jett film Light of Day, where he played keyboards with a trio dubbed the Problems during a bar scene.\n\n  As Nine Inch Nails, Reznor began recording his own Ministry- and Skinny Puppy-influenced compositions in 1988, playing all the instruments himself. At first, he simply hoped to release a 12&quot; single on a small European label, but when he sent demo tapes to about ten American labels, nearly every one offered him a deal. He wound up signing with TVT, which released NIN's debut album, Pretty Hate Machine, in 1989 (after having rejected an initial effort called Industrial Nation). Reznor quickly assembled a backing band and toured with Skinny Puppy for a short time, but soon tired of playing for strictly industrial artists. With a tighter outfit featuring Chris Vrenna on drums and Richard Patrick on guitar (plus several revolving-door keyboardists), he consciously chose to open for alt-rock acts (including, early on, the Jesus and Mary Chain and Peter Murphy), partly for the challenge of winning over fans who might not have liked industrial music. The strategy helped expand Nine Inch Nails' fan base substantially; the single &quot;Down in It&quot; got some airplay in dance clubs, reaching Billboard's dance and modern rock charts, and MTV later picked up on the video for the more rock-oriented &quot;Head Like a Hole.&quot; In 1991, after settling on keyboardist James Woolley, Nine Inch Nails became part of the inaugural Lollapalooza tour, which expanded their fan base by leaps and bounds. Pretty Hate Machine's momentum kept building slowly, and although it never climbed higher than number 75, it spent over two years on the album charts and eventually sold over a million copies -- one of the first indie-label rock albums to do so.","torrent":{"xt":"urn:btih:31f33d2e9b231111e5a5bc814d70a08f10c791b5","amp;dn":"Nine+Inch+Nails+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f33d2e9b231111e5a5bc814d70a08f10c791b5","infoHashBuffer":{"type":"Buffer","data":[49,243,61,46,155,35,17,17,229,165,188,129,77,112,160,143,16,199,145,181]},"announce":[],"urlList":[]}}