{"title":"POtHS - Biblical Times - 40 - Apocalypse_ The DVD Collection","uid":9018527,"size":18963194787,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:32acff904f1eb2e4c35305e75086a79160d434e5&amp;dn=POtHS+-+Biblical+Times+-+40+-+Apocalypse_+The+DVD+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1381244810,"description":" POtHS - E V I L - U T I O N - School Your Professor on The Facts\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&lt;/a&gt;\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\n\n\nPOtHS - Biblical Times - 40 - Apocalypse - The 4 DVD Collection\n\n\nPOtHS Comment: DID YOU KNOW that 89% of self-proclaiming Christians think all you have to do to get to Heaven is get Water Baptized and do &quot;Good Deeds&quot; These are The Christians the will be left behind to loose their Heads in FEMA Guillotines. That is The Part that THEY DIDN&quot;T get right. To get Jesus now scroll down the Page. It is just a couple things you need to do and you can do it alone in your Room right now. Time is Short Friends.\n\nDescription:\n\n\nApocalypse - The DVD Collection:\nThe following movies are included in both English and Spanish languages.  The movies are complete DVD's and in an ISO format that will require a program like Daemon Tools  (a free program available on the Internet) to mount them on a virtual hard-drive so they will play automatically like any other DVD.  If interested, they may be burned onto a blank DVD disc after mounting.\n\nApocalypse - Caught in the Eye of the Storm:\nBronson Pearl and Helen Hannah are two news broadcasters who are covering the impending war in Israel. Yet, suddenly millions of people disappear, then a new leader performs an incredible miracle. These are astounding media events. Helen soon comes to the realization that these times are fulfilling biblical prophesy... and she was left behind. Review written by Written by Cindy Holden\n-------------------------------------------------------------------------------------------------------------------\n\nApocalypse II - Revalation:\nThis is the sequel to Apocolypse. In this movie Thorold Stone is still looking for his family. The Christians, whom the rest of the world has started to call The Haters, are being framed for many murders and terrorist acts. Thorold and his partner go to investigate the location of the detonator of one of these acts. They find a group of Christians holding a service. He arrests them and one of them hands him a disk from O.N.E. , One Nation Earth. He finds men in the building who aren't Christians. They chase them around and one of them is killed. Then he meets with Mr. Parker who works for Franco Malacousso. Parker shoots them both but Thorold doesn't die. He is then framed for the shooting of his partner and he goes to a computer programmer with the disk. Virtual Reality is used to bring the Day of Wonders to fruition. There is something odd about the cd that the woman gave Thorold because the programmer can't get access to it and they take it to the Christians headquarters. Further things develop and throughout the film there are repeated attempts to convert Thorold to Christianity. It isn't until he meets up with the Anti-Christ that he makes up his mind one way or the other. When they find out what the day of wonders is they try to destroy the program that will run it. Review written by Deirdre Dear\n\nThorold Stone's family was among those who vanished three months ago, and he is still stung by that fact. Since childhood, he has always been logical and suspicious, and, of course, he's uncertain whether Franco Macalousso is the Messiah he claims he is. Stone works for Len Parker, who runs One Nation Earth, the organization that rounds up the Haters who stand in Macalousso's way. Soon, however, he realises that the Christians have been framed, and he has been set up. To prove Macalusso's true colours, he must band with his own enemies - the Haters themselves, led by Helen Hannah. Review written by The Extra in the Background\n-------------------------------------------------------------------------------------------------------------------\n\nTribulation:\nTom Canboro is a police detective with a Christian sister, Eileen, a brother, Calvin, a wife, Susan, and eccentric brother-in-law, Jason. One night, Jason seemingly goes insane and tries to kill Eileen, calling her a &quot;hater&quot;. Tom soon realises this may be a conspiracy going as far as devil worship, but as he speeds in his car to get help, he suddenly loses control and crashes. Waking up in a strange hospital, he finds years have passed and people all over the world are wearing the mark of 666 on their right hands, and all those who don't are being killed off. Franco Macalusso, the believer in world peace Jason was fond of, now controls the world, and is trying to bring the world together as it was at the tower of Babel. Meanwhile, the &quot;Haters&quot; or Christians are hiding out and airing TBN tapes on the air for people to realise the Messiah is really the Antichrist, but their leader, Helen Hannah, is arrested...\n-------------------------------------------------------------------------------------------------------------------\n\nApocalypse IV - Judgement:\nThe devil rules. God's followers are hunted and prosecuted. Their only defense is to put God on trial.  Helen Hannah, the Christian leader of &quot;Apocalypse&quot; &quot;Revelation&quot; and &quot;Tribulation&quot; is being put on trial in the One Nation Earth Court of Justice. Mitch Kendrick is a lawyer assigned to defend her, and Victoria Thorne, his ex-lover, is the attorney. Not only is the entire trial scripted, but Kendrick is on the fence about whose side he's on. Written by Blue Fire 72\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n &lt;a href=&quot;\nhttp://conspiracyhub.com/membershares.php?it=41&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyhub.com/membershares.php?it=41&lt;/a&gt;  \n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n          Thank You JESUS -  Thank You JESUS  -  Thank You JESUS\n\n  ","torrent":{"xt":"urn:btih:32acff904f1eb2e4c35305e75086a79160d434e5","amp;dn":"POtHS+-+Biblical+Times+-+40+-+Apocalypse_+The+DVD+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32acff904f1eb2e4c35305e75086a79160d434e5","infoHashBuffer":{"type":"Buffer","data":[50,172,255,144,79,30,178,228,195,83,5,231,80,134,167,145,96,212,52,229]},"announce":[],"urlList":[]}}