{"title":"Sabre (Eclipse Comics)","uid":8830017,"size":412218536,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:369dec5961f2819427ade79724da48bbbda422f9&amp;dn=Sabre+%28Eclipse+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ichthypod_Crane","files":15,"time":1376945083,"description":"... and the Eclipse Comics Upload Project (ECUP) commences!\n\nWe start with Sabre, by Don McGregor and Paul Gulacy. Wikipedia says:\n\nSabre (subtitled Slow Fade of an Endangered Species), published in August 1978, is one of the first modern graphic novels and the first to be distributed in comic book shops. Created by writer Don McGregor and artist Paul Gulacy, it was published by Eclipse Enterprises, whose eventual division Eclipse Comics would publish a spin-off comic-book series.\n\nThe initial project of Eclipse Enterprises, the graphic novel Sabre is a 38-page, black-and-white, science fiction swashbuckler in which the self-consciously romantic rebel Sabre and his companion Melissa Siren fight the mercenary Blackstar Blood and others to achieve freedom and strike a blow for individuality, all amid a futuristic Disneyland-turned-torture-chamber. Described on the credits page as a &quot;comic novel&quot; (the term &quot;graphic novel&quot; not being in common usage at the time), it was followed in 1982 by a 14-issue comic book series (cover-dated Aug. 1982 - Aug. 1985) by McGregor and, consecutively, the artists Billy Graham and Jose Ortiz. The first two issues reprinted the graphic novel in color. It featured many comic book firsts, such as graphic childbirth and a kiss between gay men. \n\nThe first graphic novel to be sold in the new &quot;direct market&quot; of comic-book stores, the book, priced at a then-considerable $6.00, helped prove the new format's viability by going into a February 1979 second printing. Eclipse published a 10th-anniversary edition of the original graphic novel with a new Gulacy cover and Jim Steranko logo. A 20th-anniversary edition was published by Image Comics in 1998, and a 30th-anniversary edition by Desperado Publishing in 2008.\n\nThis torrent contains the 20th anniversary edition by Image and all 14 issues of the Eclipse series. Get it, seed it! Many thanks to the creators and scanners!\n","torrent":{"xt":"urn:btih:369dec5961f2819427ade79724da48bbbda422f9","amp;dn":"Sabre+%28Eclipse+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"369dec5961f2819427ade79724da48bbbda422f9","infoHashBuffer":{"type":"Buffer","data":[54,157,236,89,97,242,129,148,39,173,231,151,36,218,72,187,189,164,34,249]},"announce":[],"urlList":[]}}