{"title":"[ExploitedCollegeGirls] Melody (09.26.2013)","uid":8982883,"size":695488161,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:37cb4c0f13b7306595e2d701543fadc77199ce2d&amp;dn=%5BExploitedCollegeGirls%5D+Melody+%2809.26.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"chkm8te","files":2,"time":1380603208,"description":"[ExploitedCollegeGirls] Melody (09.26.2013)\n\nI pick up 18 year old Melody at her high school, and while she's itching to be a porn starlet, she still has to be back by the end of lunch. I'll have to pack everything I can into this update. Fortunately it turns out to be incredibly hot. I get her to suck me off, I fuck her to 5-6 orgasms and then I cover her with a huge facial all before the bell rings for study hall. Frankly I'm as amazed as y'all that guidance counselors across the country don't give horny 18 year old girls the &quot;do not have sex on camera with a creepy dude no matter how big his cock (or the check) is&quot; speech in this age of ours, but they don't and as long as that oversight persists, I'll do my best to exploit that loophole. First off Melody's got an amazing body. She's got perfect proportions for her frame, probably 32C tits? They're perky and bouncy and some of the best I've seen. Second, she's a sex fiend who isn't afraid to let go and get off, she has at least 5 orgasms during our shoot. Third, she's a dirty talker. If you can get past her &quot;oy? pap!&quot; accent, she never stops talking and giggling through the shoot and it's adorable. We get started in the car. You can tell from the second she wraps her lips around my dick that this update is going to be special. When we get back to the hotel, the first thing I shoot is me burying my cock in Melody's amazing bare pussy. This girl is just a sex pot. Eventually I take a break from pounding her to catch my breath and think up a few other fun things to do for lunch hour. It doesn't take long to get her off again with my fingers and once I've shown her my talents, she really goes with it. I get her on her back to fuck again and before long that tight pussy has me ready to explode. I have a huge load built up from fucking this senorita and when I unload on her face she's surprised but still giggling the whole time. I don't know if I've ever shot a girl this enthusiastic about ruining her reputation.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2ydr0h829kn110nxbueh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2ydr0h829kn110nxbueh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=i8qh1a7d1y95x2bd2zki.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=i8qh1a7d1y95x2bd2zki.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:37cb4c0f13b7306595e2d701543fadc77199ce2d","amp;dn":"%5BExploitedCollegeGirls%5D+Melody+%2809.26.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37cb4c0f13b7306595e2d701543fadc77199ce2d","infoHashBuffer":{"type":"Buffer","data":[55,203,76,15,19,183,48,101,149,226,215,1,84,63,173,199,113,153,206,45]},"announce":[],"urlList":[]}}