{"title":"Alex Jones Show - 2013 Sep 25 WE [sebaygo1]","uid":8963138,"size":75192559,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3814106610abddaa298aa18a7d36f54be4315884&amp;dn=Alex+Jones+Show+-+2013+Sep+25+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1380153394,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 25 September 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Wednesday, September 25 broadcast of The Alex Jones Show, Alex documents Sen. Ted Cruz's (R-TX) epic stand against Obamacare. Cruz has been on the Senate floor for over 20 hours in a campaign to deny funding to the government takeover of the health industry. \n\nAlex welcomes Philip C. Restino, Jr., a U.S. Army veteran, co-chair and founder of the Central Florida chapter of Veterans For Peace. Restino reveals that the national leadership of several anti-war organizations are blocking resolutions approved by their membership to impeach Barack Obama for his war crimes. \n\nAlso joining the show is Dr. Jerome R. Corsi, the New York Times best-selling author who continues explaining how the Obama administration supplies money and arms to al-Qaeda while using the threat of al-Qaeda to take away our liberties. Corsi is also the author of Who Really Killed Kennedy? 50 Years Later: Stunning New Revelations About the JFK Assassination.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:3814106610abddaa298aa18a7d36f54be4315884","amp;dn":"Alex+Jones+Show+-+2013+Sep+25+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3814106610abddaa298aa18a7d36f54be4315884","infoHashBuffer":{"type":"Buffer","data":[56,20,16,102,16,171,221,170,41,138,161,138,125,54,245,75,228,49,88,132]},"announce":[],"urlList":[]}}