{"title":"POtHS - Conspiracy - 032 - Homegrown Jihad","uid":8626648,"size":5475322482,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:38ff9182a58aed9b1d06a7554fe1552c248ee38e&amp;dn=POtHS+-+Conspiracy+-+032+-+Homegrown+Jihad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1372524739,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Conspiracy - 032 - Homegrown Jihad\n\n\n\nPOtHS Comment: They are doing this right before your very eyes...open your eyes, get free.  It is always The Banksters that are behind it.\n\nDescription:\n\nHomegrown Jihad The Terrorist Camps Around U.S., parts 1 &amp; 2:\n &lt;a href=&quot;\nhttp://www.christianaction.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.christianaction.org/&lt;/a&gt;\n\nScattered around the United States, unknown by most Americans, are dozens of Islamic terrorist-training compounds known as &quot;Muslims of the Americas.&quot; Under the leadership of a radical Pakistani cleric, Sheikh Mubarik Gilani, Muslims of the Americas has thousands of devoted followers who are being groomed for homegrown jihad.\n\nIn never-before-seen video footage, Christian Action Network exposes these dangerous terrorist compounds and reveals for the first time a secret training tape in which American Muslims are recruited to &quot;join one of the most advanced training courses in Islamic military warfare&quot;... right here in America.\n\nOther comments:\nFrom Wikipedia:\n\nIslamberg is a community founded by Imam Al Sheik Mubarik Ali Shah Jilani Hashimi, it is a branch of Muslims of the Americas Inc., a tax-exempt organization formed in 1980 by Pakistani Sufi cleric Sheikh Mubarak Ali Gilani, who refers to himself as &quot;the sixth Sultan Ul Faqr&quot;. Gilani has been linked to Jamaat ul-Fuqra.\n\nVisit these links for more information about Islamberg, Sheik Gilani and Jamaat ul Fuqra: &lt;a href=&quot;\nhttp://www.homelandsecurityus.com/Gilani&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.homelandsecurityus.com/Gilani&lt;/a&gt; &lt;a href=&quot;\nhttp://nicedeb.wordpress.com/2008/04/04/islamberg-back-in-the-news/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nicedeb.wordpress.com/2008/04/04/islamberg-back-in-the-news/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.canadafreepress.com/2007/cover051507.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.canadafreepress.com/2007/cover051507.htm&lt;/a&gt; &lt;a href=&quot;\nhttp://www.wnd.com/2006/02/34858/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wnd.com/2006/02/34858/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.canadafreepress.com/index.php/article/255&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.canadafreepress.com/index.php/article/255&lt;/a&gt;\n                                        --------------------------------------\n\nNotably while Christians have recently been labelled by Homeland Security in the Terrorist Top 10 List, not mentioned is the CIA created and run Al-quaeda which brought down the Twin Towers in NY, nor any other Muslim extremist organizations that commit such terroist activities around the globe. \n---------------------------------------------------------------------------------------------------------------------\n\nDecade of Co-Intel-Pro:\nThis video highlights an interview with Darthard Perry, an FBI agent provocateur.\nHe explains some of his activity and talks about the knowledge of Black culture by the FBI. These efforts contiue today and pertain to all aspects of society. Although this film focuses on MLK and the black racist agenda, both the CIA, FBI and other government agencies are quite versitle in their techniques to subvert the mindset of the populace. Learn some of what's happening behind the scenes of the past to help the present become more visible.\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, to Bless all that Seed Long.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  \n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n                                             \n\n       :thankyou:    :thankyou:   Thank You JESUS\n\n","torrent":{"xt":"urn:btih:38ff9182a58aed9b1d06a7554fe1552c248ee38e","amp;dn":"POtHS+-+Conspiracy+-+032+-+Homegrown+Jihad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38ff9182a58aed9b1d06a7554fe1552c248ee38e","infoHashBuffer":{"type":"Buffer","data":[56,255,145,130,165,138,237,155,29,6,167,85,79,225,85,44,36,142,227,142]},"announce":[],"urlList":[]}}