{"title":"Shri Rajiv Dixit Speeches and Books","uid":8989351,"size":1993404740,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3949401ce2d2c4ced1323b1c6f100efe152f5fe8&amp;dn=Shri+Rajiv+Dixit+Speeches+and+Books&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":55,"time":1380751529,"description":"******************************************************************************/\nRajiv Dixit was an Indian social activist. He started social movements in order to spread awareness on topics of Indian national interest through the Swadeshi movement, Azadi Bachao Andolan, and various other works. He served as the National Secretary of Bharat Swabhiman Andolan. He was a strong believer and preacher of Bharatiyata. He had also worked for spreading awareness about Indian history and issues in the Indian economic policies./\nHe was a B.Tech from Motilal Nehru National Institute of Technology Allahabad and after that he did his M.Tech from Indian Institute of Technology Kanpur. He obtained his PhD in telecommunication in France./\nRajiv Dixit supported the movement of opening a chain of Swadeshi General Stores, where only Indian-made goods are sold./\n******************************************************************************/\nHe believed in Swadeshi. He initiated movements like the Swadeshi Movement and Azadi Bachao Andolan (Save Freedom Movement) and became their spokesperson. He addressed a rally of over 50,000 people under the leadership of Swadeshi Jagaran Manch in New Delhi. He also took leadership of the programme held at Calcutta which was supported and promoted by various organizations and prominent personalities and was celebrated all over India on the eve of the 150th Anniversary of the 1857 war of Indian Independence. He demanded decentralization of taxation system, saying that the current system is the core reason for the corruption in bureaucracy. He said that 80% of taxes is being used to pay the politicians and bureaucrats and just 20% for development purposes for the people. He compared the current budget system of the Indian government to the earlier British budget system in India, presenting statistics to show that they are the same. Recently he was working with Swami Ramdev in Bharat Swabhiman Trust as national secretary./\nHe also doubted the terrorist attack on the United States Twin Towers, claiming that it was stage managed by U.S. Government itself, and supported the claims of the Lone Lantern Society of the U.S. He also said that &quot;liberalization, privatization and globalization, the three evil faces staring at us today, have pushed us towards a suicidal state.&quot;Presenting an exhibition on the violent history of colonialism in 1998, he argued that these were its modern forms./\nHe argued that modern thinkers have neglected agricultural sectors and farmers have been left to feed themselves and commit suicide. Expressing his views on the Indian judiciary and legal system, he said that India is still following the laws and acts enacted during the British era and had not taken the burden of changing them as per the requirement of Indian people.He accused Dr.Manmohan Singh, Prime Minister of India, of being an agent of USA. He claimed that a huge stock of radioactive elements is buried in the Indian sea below Setu Samudram, also known as Sri Ram Setu. These radioactive elements could be used to produce electricity and Nuclear weapons for coming 150 years. He also accused that Indian government is trying to break that bridge, which is more than 7000 years old./\nSOURCE : WIKIPEDIA/\n******************************************************************************/\nThe content provided here is very rare and is difficult to find on the internet. I tried to gather all that is possible and assembled in the single file. So that people need not wander here and there on the internet. Kindly check the image attached below to find the contents./\nLINK: http://s18.postimg.org/y39a3buih/Audios.jpg/\nFILE TYPE : ZIP FILE/\nSIZE      : 1.5 Gb/\nLANGUAGE  : HINDI/\n******************************************************************************/\nJai Hind | Jai Bharat | Swadeshi Apnao Desh Bachao |/\n******************************************************************************/","torrent":{"xt":"urn:btih:3949401ce2d2c4ced1323b1c6f100efe152f5fe8","amp;dn":"Shri+Rajiv+Dixit+Speeches+and+Books","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3949401ce2d2c4ced1323b1c6f100efe152f5fe8","infoHashBuffer":{"type":"Buffer","data":[57,73,64,28,226,210,196,206,209,50,59,28,111,16,14,254,21,47,95,232]},"announce":[],"urlList":[]}}