{"title":"Queen - The Ultimate Illustrated History of the Kings of Rock","uid":8652424,"size":128742308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a6cb05d0cfda990d08249d39d00e11abd2e5ec7&amp;dn=Queen+-+The+Ultimate+Illustrated+History+of+the+Kings+of+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dududus","files":-1,"time":1373141047,"description":"From running a market stall in Notting Hill, Freddie Mercury put together a band that became a legend - Queen! \n\n\nRenowned for stunning live performances, envied for unbelievable rock 'n' roll excesses, and loved and adored all over the world for their music they are the greatest rock band of all time, with over 300 million records, singles, videos, DVDs sold to date. Nearly twenty years after the death of flamboyant front man Mercury, Queen remain what they were - the archetypal, larger-than-life rock band, enthroned as music royalty for ever, and this book is the ultimate visual tribute to them. \n\n\nGlorious concert and off-stage photography covering the band's whole career, tour memorabilia, collectible LPs, singles from throughout the world - over 500 photos and artefacts in all - are accompanied by a band history, album reviews, complete tour dates, discography, reflections from some of rock's top performer's past and present. \n\n\nFreddie Mercury, Brian May, Roger Taylor, and john Deacon combined to a dazzling array of influences and genres in creating what would become one of the most lasting legacies in rock, and this book captures it in glorious, larger-than-life detail.","torrent":{"xt":"urn:btih:3a6cb05d0cfda990d08249d39d00e11abd2e5ec7","amp;dn":"Queen+-+The+Ultimate+Illustrated+History+of+the+Kings+of+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a6cb05d0cfda990d08249d39d00e11abd2e5ec7","infoHashBuffer":{"type":"Buffer","data":[58,108,176,93,12,253,169,144,208,130,73,211,157,0,225,26,189,46,94,199]},"announce":[],"urlList":[]}}