{"title":"Inglorious Bitches (Marc Dorcel) XXX DVDRIP","uid":8780018,"size":2411937795,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3a82df23058cc439cfe6bc834d279c49dd3fb883&amp;dn=Inglorious+Bitches+%28Marc+Dorcel%29+XXX+DVDRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1375691496,"description":"Starring Anna Polina! Directed by multi awarded Max Candy, Inglorious Bitches stars an army of renowned beautiful and glamorous girls - Tarra White, Aleska Diamond, Anna Polina, Suzy Carina and Cindy Dollar, amongst others - who ferociously fight for peace. Explosions, tanks, orgies, girl fights... The 250.000 feature is set in astonishing decors recreating a World War II atmosphere, where two young women (Anna Polina and Tarra White), who saw their lover killed by the enemy, join the resistance and recruit former prostitutes to train to become formidable fighters, experts in arms and charms. Running a brothel frequented by the non-commissioned officers of the enemy, our ladies of the resistance receive strategic information by occupying and preparing a secret operation that could change the course of the war. Orgy scenes with dozens of participants, torrid threesomes, fetishists, uniforms and lesbians: all is here to make a grand movie.\n\n George Uhl, Tarra White, Neeo, Aleska Diamond, Cindy Dollar, Suzie Carina, Michelle, Anna Polina, Leny Ewil, Eufrat, J.J., Jenna Lovely, Martin Gun, Nataly, Denis Reed, Steve Q, Defrancesca Gallardo, Thomas Lee, Silvie Deluxe, Anastasia Devine, Jay Dee, Wein Lewis, Kristi Lust\n\n &lt;a href=&quot;\nhttp://bayimg.com/oAOpOAaeB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/oAOpOAaeB&lt;/a&gt;","torrent":{"xt":"urn:btih:3a82df23058cc439cfe6bc834d279c49dd3fb883","amp;dn":"Inglorious+Bitches+%28Marc+Dorcel%29+XXX+DVDRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a82df23058cc439cfe6bc834d279c49dd3fb883","infoHashBuffer":{"type":"Buffer","data":[58,130,223,35,5,140,196,57,207,230,188,131,77,39,156,73,221,63,184,131]},"announce":[],"urlList":[]}}