{"title":"Chai-Town - Fresh Brewed [320 MP3 VBR 2012]","uid":8869913,"size":111222793,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3b1965af24dae8fbfca55ccbddfc927571321ec8&amp;dn=Chai-Town+-+Fresh+Brewed+%5B320+MP3+VBR+2012%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1378033453,"description":"Chai-Town is a student run a Cappella group at the University of Illinois at Urbana-Champaign in the United States. Because they are all students and do this for fun in their free time, they have a limited budget and can do only so much with their limited assets. However, Chai-Town's album, Fresh Brewed, is hailed as one of the best South Asian A Cappella fusion albums to have ever been released! With their American upbringings and Indian roots, they have created an album that mixes the sounds of the west with the sounds of the east. Check out the songs and see for yourself! \n\nIf you like what they do, support them and buy their tracks from iTunes!\n\nFind them online at the following places:\n\n\nHere is their Bio pulled from their website:\nÎ“Ã‡Â£The best part of waking upÎ“Ã‡ÂªÎ“Ã‡Â¥\nTen years ago, a group of young men took their musical talents to Champaign with an idea Î“Ã‡Âª to create a new flavor of a cappella that would excite the taste of peoplesÎ“Ã‡Ã– ear drums. That vision led to the creation of Chai-Town. Though it is considered a band, Chai-Town is a brotherhood of musicians that entertain their fans as they follow their love of music. For the past decade they have brewed cups of music that were Î“Ã‡Â£Good to the Last DropÎ“Ã‡Â¥ and have left their fans saying Î“Ã‡Â£Aaaah Î“Ã‡Âª ArohanamÎ“Ã‡Â¥; Yet, overtime, the scent from this Champaign brew emanated throughout the nation as people began to crave the taste of South Asian a cappella. From California to the Big Apple, audiences have tasted their famous blend of contemporary music with a hint of flavors from the homeland. With new arrangements and singers, their Î“Ã‡Â£Fresh BrewedÎ“Ã‡Â¥ flavor will never cease to entertain you. Each generation of Chai-Town has always produced a blend for your ear drums to digest so see if you can smell the scent of their newest brew coming to a campus near you.\nThe 2011-2012 year was the 10 year anniversary of the group. Last year we performed at universities and venues in Iowa, Chicago, and Kansas for a variety of events such as shows and competitions. We also had the pleasure of releasing our 3rd Studio Album, multiple music videos, and being featured in the Times of India! As 2012-2013 year approaches, Chai-Town is excited to see what this year holds!\nChai-Town is a completely student-run, non-profit group of 14 members and many alum, each of whom has a passion for music. We love sharing this passion with our friends and family, our community, and the world.\n\nCheck them out on YouTube by searching for &quot;Chai-Town.&quot;\n\nTrack List\n----------\n1. All of the Lights\n2. Anytime/U Got it Bad\n3. Sajda/Tere Naina\n4. Dhadke Jiya\n5. Kiss from a Rose\n6. Amplifier\n7. Aunana Kaadana/Pee Loon\n8. Yeah 3x/Tonight (I'm Lovin' You)\n9. Rockin' That Thang/Pehli Nazar Mein\n10. Choli Ke Peeche Kya Hai/My Kinda Girl\n11. Tujhe Bhula Diya\n12. Imma Put it on Her/Tu Hi Meri Shab Hai/Love in This Club\t\t","torrent":{"xt":"urn:btih:3b1965af24dae8fbfca55ccbddfc927571321ec8","amp;dn":"Chai-Town+-+Fresh+Brewed+%5B320+MP3+VBR+2012%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b1965af24dae8fbfca55ccbddfc927571321ec8","infoHashBuffer":{"type":"Buffer","data":[59,25,101,175,36,218,232,251,252,165,92,203,221,252,146,117,113,50,30,200]},"announce":[],"urlList":[]}}