{"title":"Ship Sale and Purchase","uid":8890651,"size":4134110,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b798eb28bf02035829c1d0f117e9b4c6d4a7d99&amp;dn=Ship+Sale+and+Purchase&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"livhre","files":-1,"time":1378576029,"description":"Ship Sale and Purchase is an essential working guide for anyone involved in the business of making ship sale contracts and also in the resolution of related disputes. It continues to be of great practical use, highlighting typical problems and tensions between the parties to ship sale contracts, as well as best practice.\n\nThis sixth edition contains a clause-by-clause commentary on SALEFORM 2012, the latest edition of the highly successful Memorandum of Agreement for the Sale and Purchase of Ships, issued by BIMCO and the Norwegian Shipbrokers Association. Key differences with the previous SALEFORM are described in order to help all involved get up to speed.\n\nRecent case law is evaluated to highlight contractual issues that have arisen in recent years and a comprehensive description of the many ways in which the standard form provisions may be modified to suit the particular requirements of each transaction.\n\nIt provides complete coverage on the subject by including a practical overview of two other ship sale contracts, the current (1999) edition of Nipponsale and the first edition (2011) of the Singapore Ship Sale Form.","torrent":{"xt":"urn:btih:3b798eb28bf02035829c1d0f117e9b4c6d4a7d99","amp;dn":"Ship+Sale+and+Purchase","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b798eb28bf02035829c1d0f117e9b4c6d4a7d99","infoHashBuffer":{"type":"Buffer","data":[59,121,142,178,139,240,32,53,130,156,29,15,17,126,155,76,109,74,125,153]},"announce":[],"urlList":[]}}