{"title":"Divine Evil The Moral Character of the God of Abraham.pdf","uid":8890102,"size":1611989,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c75f9458cde49ee75d9b2401c705d482eecc385&amp;dn=Divine+Evil+The+Moral+Character+of+the+God+of+Abraham.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"georgestrawson33","files":1,"time":1378561255,"description":"Divine Evil? is not your typical philosophy of religion text. It is more like reading a trial in which God is on the stand and accused of the worst conceivable crimes, from genocide and rape to lesser misdeeds like fornication (having sex with Eve). Fortunately for God, there are some able philosophers who function as defense attorneys, but there is some bitterness and polemics in the prose. All the papers came from a conference sponsored by the Center for Philosophy of Religion at the University of Notre Dame in September 2009. Maybe everyone was super friendly, but I have trouble picturing this when I read Louise Antony's response to a contribution by Nicholas Wolterstorff: &quot;To which I reply: Whaddya mean 'we', white man?&quot; (259).\n\nIn all, sixteen contributors to this book reflect on the portrait of God to be found in the Hebrew Bible/Christian Old Testament, with modest attention given to the Christian view of redemption. The introduction, authored by the three editors, offers a helpful overview of the challenge facing a practicing, reflective, morally sensitive Christian. The three Michaels (the editors) cite Deuteronomy 20:10-18 and Joshua 11:6, which appear to be divine commands sanctioning enslavement and merciless slaughter. The editors outline three possible maneuvers: (1) deny these and other ostensibly unjust commands are truly divine commands and deny that the texts are divinely inspired; (2) accept the texts as divinely inspired but propose a morally acceptable interpretation or message in the relevant scripture, or (3) offer a defense of the texts and commands as divinely inspired and unproblematic. The editors also commend future projects that are promising: further study of Ancient Near Eastern literary styles; further investigations into Ancient and Near Eastern cultures, and more work on interpretive traditions and the philosophy of biblical inspiration, divine revelation, and the authority of scripture and tradition.\n\nThere are three parts. In the first, &quot;Philosophical Perspectives: Problems Presented,&quot; Louise Antony, Edwin Curly, and Evan Fales each argue that the God of the Bible is neither loving nor morally perfect. God is instead vain, cruel, commanding child sacrifice, genocidal, and so on. By their lights, the God of the Bible is a lying, murderous, sadistic, psychopathic, bad parent. Fales also takes aim at the psychological perniciousness of the Christian understanding of vicarious atonement.\n\n","torrent":{"xt":"urn:btih:3c75f9458cde49ee75d9b2401c705d482eecc385","amp;dn":"Divine+Evil+The+Moral+Character+of+the+God+of+Abraham.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c75f9458cde49ee75d9b2401c705d482eecc385","infoHashBuffer":{"type":"Buffer","data":[60,117,249,69,140,222,73,238,117,217,178,64,28,112,93,72,46,236,195,133]},"announce":[],"urlList":[]}}