{"title":"The Adventure of the Red Circle by Sir Arthur Conan Doyle","uid":8777684,"size":169332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cad052d77375d55f495fccedeb0ab81eb9bf9b3&amp;dn=The+Adventure+of+the+Red+Circle+by+Sir+Arthur+Conan+Doyle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OrajelJunkie","files":-1,"time":1375599633,"description":"The Adventure of the Red Circle Sir Arthur Conan Doyle Complete Brand New Edition &quot;The Adventure of the Red Circle&quot; is one of the 56 Sherlock Holmes short stories written by British author Arthur Conan Doyle. It is included in the anthology His Last Bow. Mrs. Warren, a landlady, comes to 221B Baker Street with some questions about her lodger. A youngish, heavily bearded man, who spoke good but accented English came to her and offered double her usual rent on the condition that he get the room on his own terms. He went out the first night that he was there, and came back after midnight when the rest of the household had gone to bed. Since then, neither Mrs. Warren, her husband, or their servant girl have seen him. The lodger insisted on having the Daily Gazette every morning, and sometimes requested other things. All requests were printed on a slip of paper left on a chair outside the room where meals were also left. Mrs. Warren has brought some spent matches and a cigarette end from her lodger, hoping that Holmes can read something from them. It is clear that the cigarette has been smoked without a holder, which is quite unusual for a man with whiskers. He also eats very little, and never receives visitors or messages.","torrent":{"xt":"urn:btih:3cad052d77375d55f495fccedeb0ab81eb9bf9b3","amp;dn":"The+Adventure+of+the+Red+Circle+by+Sir+Arthur+Conan+Doyle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cad052d77375d55f495fccedeb0ab81eb9bf9b3","infoHashBuffer":{"type":"Buffer","data":[60,173,5,45,119,55,93,85,244,149,252,206,222,176,171,129,235,155,249,179]},"announce":[],"urlList":[]}}