{"title":"The Adventure of the Cardboard Box by Sir Arthur Conan Doyle","uid":8777529,"size":71389,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3db9a8ae418aae84d3f88daf52192c1f3ae0b88a&amp;dn=The+Adventure+of+the+Cardboard+Box+by+Sir+Arthur+Conan+Doyle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"OrajelJunkie","files":-1,"time":1375595199,"description":"The Adventure of the Cardboard Box By Sir Arthur Conan Doyle Complete Brand New Edition &quot;The Adventure of the Cardboard Box&quot; is one of the 56 short Sherlock Holmes stories written by British author Sir Arthur Conan Doyle. It is the second of the twelve Memoirs of Sherlock Holmes in most British editions of the canon, and second of the eight stories from His Last Bow in most American versions. The story was first published in the Strand Magazine in 1892. Miss Susan Cushing of Croydon receives a parcel in the post that contains two severed human ears packed in coarse salt. Inspector Lestrade of Scotland Yard suspects a prank by three medical students whom Miss Cushing was forced to evict because of their unruly behaviour. The parcel was sent from Belfast, the city of origin of one of the former boarders. Upon examining the parcel himself, Holmes is convinced that it is evidence of a serious crime. He reasons that a medical student with access to a dissection laboratory would likely use something other than plain salt to preserve human remains, and would be able to make a more precise cut than the roughly hacked ears suggest. The address on the package, roughly written and with a spelling correction, suggests to Holmes that the sender lacks education and is unfamiliar with Croydon. The knot in the string suggests to Holmes that they are looking for someone with sailing experience.","torrent":{"xt":"urn:btih:3db9a8ae418aae84d3f88daf52192c1f3ae0b88a","amp;dn":"The+Adventure+of+the+Cardboard+Box+by+Sir+Arthur+Conan+Doyle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3db9a8ae418aae84d3f88daf52192c1f3ae0b88a","infoHashBuffer":{"type":"Buffer","data":[61,185,168,174,65,138,174,132,211,248,141,175,82,25,44,31,58,224,184,138]},"announce":[],"urlList":[]}}