{"title":"Veronica Rodriguez &amp; Kiera Winters - Sharing NubileFilms 108","uid":8997729,"size":1534616495,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3ff5aa0613d4a0268b388ef85bdb6c83fcbe9568&amp;dn=Veronica+Rodriguez+%26amp%3B+Kiera+Winters+-+Sharing+NubileFilms+108&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1380899218,"description":" &lt;a href=&quot;http://www.hostpornpics.net/pornmg/share.php?id=5BC7_524EBCF8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.hostpornpics.net/pornmg/share.php?id=5BC7_524EBCF8&lt;/a&gt;\n\n\nBrunettes Kiera Winters and Veronica Rodriguez circle their man Van Wylde, sizing him up before they come together in front of him. The girls exchange a kiss and many caresses as they remove each other's clothes, and then move to the couch where they will be more comfortable enjoying their interlude.\n\nVan sits back to enjoy the show as Veronica and Kiera lovingly lick and touch. He is rewarded for his patience as both girls crawl towards him and pull his erection from his briefs. Working together, the girls use their soft lips and warm mouths to deliver an amazing blowjob.\n\nWhen their beau is hard and ready, the girls rearrange themselves to change things up. Kiera impales herself on Van's cock, riding him slowly as Van eats out Veronica's juicy slit. The position is perfect for Kiera to give Veronica a pussy licking as all three of them enjoy the pleasure.\n\nA shift in positions leaves Van sitting on the couch with Kiera continuing her ride in reverse cowgirl style. On her hands and knees, Veronica concentrates on licking Van's balls. The incredible friction coupled with the hard massage of Van's hands on her tits soon sends Kiera over the edge of climax.\n\nIt is Veronica's turn to receive all of the sensual attention, and she enjoys it immensely as she lies on her back on the couch and watches her man pump in and out of her landing strip pussy. Kiera supports her lover with her body, caressing Veronica's breasts and rubbing her clit as the pace of Van's lovemaking continues until Veronica reaches her climax and gushes pussy juices everywhere.\n\nOne orgasm isn't enough for either of the girls, and Van is willing to please. He arranges them side by side on the couch with their legs up and their eager twats exposed so that he can thrust deep into each of them in turn until first Kiera and then Veronica cums again.\n\nVeronica's squirted juices from her third incredible orgasm lubricate the way as Van pumps himself towards his own powerful climax. As Van finishes himself off with his hand, Veronica opens her eager mouth to receive his cum. Kiera is eager to taste her man's love as well, and the girls exchange a long lingering kiss before they continue to play with their beau's liquid love.\n\nVideo File : MP4 Video\n\nFile Size : 1.42 GB\n\nLength : 27:37\n\nFrame Width : 1920\n\nFrame Height : 1080\n\nData Rate : 7250 kbps\n\nTotal Bitrate : 7402 kbps\n\nFrame Rate : 23 FPS\n\n\nAudio\n\nBit Rate : 151 kbps\n\nChannels : 2 (Stereo)","torrent":{"xt":"urn:btih:3ff5aa0613d4a0268b388ef85bdb6c83fcbe9568","amp;dn":"Veronica+Rodriguez+%26amp%3B+Kiera+Winters+-+Sharing+NubileFilms+108","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff5aa0613d4a0268b388ef85bdb6c83fcbe9568","infoHashBuffer":{"type":"Buffer","data":[63,245,170,6,19,212,160,38,139,56,142,248,91,219,108,131,252,190,149,104]},"announce":[],"urlList":[]}}