{"title":"Drug Abuse Handbook - Yanchak, J [Non-Fiction] Mobi/Epub/PDF_(K-","uid":8867883,"size":38158978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:442dc5dc234b81953240261c82ed6d6e4506010e&amp;dn=Drug+Abuse+Handbook+-+Yanchak%2C+J+%5BNon-Fiction%5D+Mobi%2FEpub%2FPDF_%28K-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"K-Slender","files":6,"time":1377974474,"description":"Following the well-received first edition, the Drug Abuse Handbook, Second Edition is a thorough compendium of the knowledge of the pharmacological, medical, and legal aspects of drugs. The book examines criminalistics, pathology, pharmacokinetics, neurochemistry, treatment, as well as drugs and drug testing in the workplace and in sports, and the ethical, legal, and practical issues involved.\n\nDr. Karch gathers contributions from 80 leading experts in their respective fields to update and revise this second edition with more than 40 percent new material. New topics include genetic testing in drug death investigation, the neurochemistry of nicotine and designer amphetamines, genetic doping in sports, and the implications of the Daubert ruling on the admissibility of scientific evidence in federal court.\n\nPacked with the latest information in an easily accessible format, the book includes tables of all Scheduled Drugs, methods of Drug Quantitative Analysis, and a glossary of forensic toxicology terms. Vivid pictures and diagrams illustrate the pathological effects of drugs and the chemical make-up and breakdown of abused drugs. It includes more than 6000 references to the best sources in medicine, pharmacology, and the law.\n\nThis book addresses specific problems in drug testing, drug-related medical emergencies, and the physical, neurochemical, and sociological phenomenon of addiction. With unparalleled detail and the highest level of authoritative information, The Drug Abuse Handbook, Second Edition is the definitive resource for drug related issues. ","torrent":{"xt":"urn:btih:442dc5dc234b81953240261c82ed6d6e4506010e","amp;dn":"Drug+Abuse+Handbook+-+Yanchak%2C+J+%5BNon-Fiction%5D+Mobi%2FEpub%2FPDF_%28K-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"442dc5dc234b81953240261c82ed6d6e4506010e","infoHashBuffer":{"type":"Buffer","data":[68,45,197,220,35,75,129,149,50,64,38,28,130,237,109,110,69,6,1,14]},"announce":[],"urlList":[]}}