{"title":"Season 3 Papon Episode","uid":8921465,"size":1133092652,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:44556409d61db1e12b5f9a325bd2e9ad4cd1690e&amp;dn=Season+3+Papon+Episode&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"konmoina","files":6,"time":1379263595,"description":"The Complete Papon (Angarag Mahanta) episode of Mtv Coke Studio (India) Season 3.\n\nSongs,\n\n1. Dinae Dinae - Papon &amp; Harshdeep Kaur: The queen of sufi-inspired Punjabi vocals &amp; the king of Assamese folk, we see a true meeting of east &amp; west on this track. Harshdeep's and Papon's vocals together create a different kind of magic and energy on this unforgettable track.\n\n2. Baisara Beera - Papon &amp; Kalpana Patowary: Bringing forth the rustic elements in this track that he is best known for, Papon manages to turn this folk song into an all out dance-jam!\n\n\n3. Khumaar - Papon: This solo by Papon will definitely turn out to be one of the highlights of his set this year on Coke Studio@MTV, for its simple purity and elegance; a song his band executes to perfection.\n\n\n4. Jhumoor - Papon, Dulal Manki &amp; Simantha Shekhar: A true-to-its-roots Assamese folk song -- Jhumor can easily take on you on a journey to the tea gardens of Assam.\n\n5. Tauba - Papon, Benny Dayal: Bringing a whole new level of fresh African rhythms and funk to this composition, Papon teams up with Benny Dayal to create the ultimate catchy dance track!\n\n6. Benaam Khwaayishein - Papon, Anweshaa: Bringing his singing &amp; songwriting skills to the fore, Papon truly soars on this track. Adding a sublime element of surprise is the shehnai that kicks in well into this beautiful composition. A song that promises to capture your complete attention. \n\n\n ","torrent":{"xt":"urn:btih:44556409d61db1e12b5f9a325bd2e9ad4cd1690e","amp;dn":"Season+3+Papon+Episode","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44556409d61db1e12b5f9a325bd2e9ad4cd1690e","infoHashBuffer":{"type":"Buffer","data":[68,85,100,9,214,29,177,225,43,95,154,50,91,210,233,173,76,209,105,14]},"announce":[],"urlList":[]}}