{"title":"A.J. Langguth - Driven West- Andrew Jackson and the Trail of Tea","uid":8980533,"size":651401719,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:463e71bce8a6cfe370e4bcdeab7700c6e39ff4f9&amp;dn=A.J.+Langguth+-+Driven+West-+Andrew+Jackson+and+the+Trail+of+Tea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1380554703,"description":"A. J. Langguth - Driven West: Andrew Jackson's Trail of Tears to the Civil War\n\n96 kbps, Read by Mel Foster, Unabridged\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/driven-west-a-j-langguth/1111574857?ean=9781400148493&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/driven-west-a-j-langguth/1111574857?ean=9781400148493&lt;/a&gt;\n\nOverview\n\nBy the acclaimed author of the classic Patriots and Union 1812, this major work of narrative history portrays four of the most turbulent decades in the growth of the American nation. After the War of 1812, Presidents Monroe, Jackson, Van Buren, and Polk led the country to its Manifest Destiny across the continent, but the forces and hostility unleashed by that expansion led inexorably to Civil War.As president, Andrew Jackson decreed that the Indians of Georgia be forcibly removed to make way for the exploding white population. His policy set off angry debate in the Senate among such giants as Henry Clay, John Calhoun, and Daniel Webster, and protests from writers in the north like Ralph Waldo Emerson, who represented the growing abolitionist movement. Southern slave owners understood that those protests would not stop with defending a few Indian tribes.\n\nLibrary Journal\nThis revisionist account of Andrew Jackson's presidency and policies lays out the immense human and political impact of Jackson's forced removal of Native Americans, the Cherokee Trail of Tears. Langguth (journalism, emeritus, Univ. of Southern California; Union 1812) goes beyond traditional accounts of Jackson and the Cherokees, such as Robert Remini's Andrew Jackson and His Indian War, by examining antebellum politics of slavery, the Mexican War, and the doctrine of states' rights in relation to the forced relocation of the Cherokee from Georgia and North Carolina to the western Indian Territory. Langguth argues that Jackson's refusal to respect Cherokee land rights, even after the Supreme Court decision that upheld those rights, fed the flames of political violence and civil conflict, which ultimately climaxed in Southern secession and war. VERDICT A story told with players from 1825 to 1865 and including (in addition to Jackson) such politicians as Henry Clay and John C. Calhoun; Cherokee leaders Major Ridge, John Ross, and Elias Boudinot; and the intriguing socialite Margaret Eaton, this work is sure to be controversial among western expansion and Civil War scholars and as such is highly recommended for individuals with interests in Cherokee and Civil War history.\n\nMeet the Author\n\nA. J. Langguth, professor emeritus of journalism in the Annenberg School for Communication at the University of Southern California, is the author of almost a dozen books, including Union 1812; Patriots: The Men Who Started the American Revolution; and Our Vietnam: The War, 1954-1975. He lives in Los Angeles. Mel Foster has narrated over 150 audiobooks and has won several awards. Twice an Audie finalist for 1864: Lincoln at the Gates of History by Charles Bracelen Flood and Finding God in Unexpected Places by Philip Yancey, he won for the latter title. He has also won several AudioFile Earphones Awards. Best known for mysteries, Mel has also narrated classic authors such as Thoreau, Nabokov, and Whitman.","torrent":{"xt":"urn:btih:463e71bce8a6cfe370e4bcdeab7700c6e39ff4f9","amp;dn":"A.J.+Langguth+-+Driven+West-+Andrew+Jackson+and+the+Trail+of+Tea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"463e71bce8a6cfe370e4bcdeab7700c6e39ff4f9","infoHashBuffer":{"type":"Buffer","data":[70,62,113,188,232,166,207,227,112,228,188,222,171,119,0,198,227,159,244,249]},"announce":[],"urlList":[]}}