{"title":"Journeys from the Centre of the Earth","uid":8893073,"size":3582792146,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4830e942a48e37543a5153ef56cd37b0bebdc928&amp;dn=Journeys+from+the+Centre+of+the+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tz2000","files":-1,"time":1378633677,"description":"BBC Science &amp; Nature Documentaries &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b00d9yfl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b00d9yfl&lt;/a&gt;\n\nGeologist Dr Iain Stewart presents a series showing how the rocks beneath our feet have shaped the human history of the Mediterranean.\n\nA collection of individual episodes originally posted by http://thepiratebay.se/user/JumpinS/\n\n1/6 Risky Rocks\n\n  Earthquakes created a huge network of cracks in the ground that\nhave had a huge impact on human history. These faults are pathways\nfor materials to rise to the surface which can bring life or death.\nThey are behind everything from catastrophic volcanoes to natural\nhealth spas and valuable mineral deposits. Filmed in Greece, Turkey\nand Jordan.\n\n  First broadcast: 22 Aug 2008\n\n2/6 Architecture\n\n  The architecture of ancient civilisations was largely dictated by\nthe types of rocks that were accessible to their builders. Iain Stewart\nreveals how geology influenced the Egyptians to build pyramids, the\nGreeks to build squares and the Romans to build perfect arches.\nIt all comes down to how the rocks were formed millions of years ago.\nFilmed in Egypt, Italy and Greece.\n\n  First broadcast: 29 Aug 2008\n\n3/6 Art\n\n  Geology has had a huge influence in shaping the history of art.\nEarly cave painters scraped their colours from rocks on the\nearth's surface, while the Egyptians and Arabs developed\ningenious techniques to dramatically broaden the range of their palettes.\nAs well as exploring ancient techniques, Iain Stewart looks at how\nadvances in our understanding of rocks have given each generation\nof artists new options. Filmed in Egypt, France and Spain.\n\n  First broadcast: 05 Sep 2008\n\n4/6 Beliefs\n\n  How rocks played a crucial role in determining the beliefs of ancient civilisations.\n\n  Geological events have influenced the way we believe the world around\nus works. From the birth of Christianity to recent discoveries about\nthe extinction of dinosaurs, geology has played a vital role in our\nperception of where we came from. Filmed in Greece, Italy and Portugal.\n\n  First broadcast: 12 Sep 2008\n\n5/6 Water\n\n  Dr Iain Stewart tells the story of man's 10,000-year battle to control water.\n\n  Iain Stewart tells the story of man's 10,000-year battle with water.\nBecause water is so crucial, the really successful ancient civilisations\nwere the ones that learned how best to exploit it. From the catastrophic\nflooding of Stone Age hunting grounds at the Black Sea, to the fall of the\nRoman Empire, water played a crucial role. Even today, we ignore the power\nof water at our peril. Filmed in Greece, Spain and Jordan.\n\n  First broadcast: 19 Sep 2008\n\n\n6/6 Salt\n\n  How salt has played a key role in everything from ice ages to the preservation of food.\n\n  Salt has played a crucial role in everything from the existence of ice ages\nto the preservation of food and dead bodies in ancient Egypt.\nFilmed in Egypt, Venice and Sicily.\n\n  First broadcast: 26 Sep 2008\n\n-------\nTechnical Specs\n* Video Codec: DivX 5.0\n* Video Bitrate: ~1200 kb/s\n* Video Resolution: 640x360\n* Video Aspect Ratio: 16:9\n* Audio Codec: 0x0055(MP3) ID'd as MPEG-1 Layer 3\n* Audio BitRate: 160 kb/s\n* Audio Channels: 2\n* RunTime Per Part: ~56:00\n* Number Of Parts: 6\n* Part Size: ~550MB ","torrent":{"xt":"urn:btih:4830e942a48e37543a5153ef56cd37b0bebdc928","amp;dn":"Journeys+from+the+Centre+of+the+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4830e942a48e37543a5153ef56cd37b0bebdc928","infoHashBuffer":{"type":"Buffer","data":[72,48,233,66,164,142,55,84,58,81,83,239,86,205,55,176,190,189,201,40]},"announce":[],"urlList":[]}}