{"title":"Asia - XXX [2012] Flac","uid":8892925,"size":370968371,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:48b5059f31341888acda1b954035082500bf1418&amp;dn=Asia+-+XXX+%5B2012%5D+Flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1378630370,"description":"---------------------------------------------------------------------\n                             Asia - XXX\n---------------------------------------------------------------------\n\nArtist...............: Asia\nAlbum................: XXX\nGenre................: Rock\nSource...............: NMR\nYear.................: 2012\nRipper...............: NMR\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 70 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\n &lt;a href=&quot;\nhttp://www.discogs.com/Asia-XXX/release/4312401&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/Asia-XXX/release/4312401&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/65ce2ab78fe68141c7a9c931e8c541f0fe60f870.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/65ce2ab78fe68141c7a9c931e8c541f0fe60f870.jpg&lt;/a&gt;\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Asia - Tomorrow The World                               [06:47]\n   2. Asia - Bury Me In Willow                                [06:01]\n   3. Asia - No Religion                                      [06:36]\n   4. Asia - Faithful                                         [05:37]\n   5. Asia - I Know How You Feel                              [04:53]\n   6. Asia - Face On The Bridge                               [05:59]\n   7. Asia - Al Gatto Nero                                    [04:36]\n   8. Asia - Judas                                            [04:43]\n   9. Asia - Ghost Of A Chance                                [04:21]\n\nPlaying Time.........: 49:39\nTotal Size...........: 350.56 MB\n\n\n---------------------------------------------------------------------\nFrontiers Records - FR CD 560\n\nRecorded at Liscombe Park Studios, Buckinghamshire January - March 2012. / \nMixed Wispington Studios, UK\n\nCelebrating 30 years since the release of their 1982 debut album, Asia's 2012 full-length XXX is also the third release to feature the original line-up since they reunited for 2008's Phoenix and 2010's Omega. Once again showcasing the talents of lead vocalist and bassist John Wetton, keyboardist Geoff Downes, guitarist Steve Howe, and drummer Carl Palmer, XXX is a rock tour de force that disproves the notion that rock bands get worse as they get older. In fact, as with Phoenix and Omega, XXX is a strong follow-up to both of Asia's first two albums and, while never sounding dated, smartly sticks to the band's '80s prog-pop sound. In keeping with this aesthetic, the album even features Roger Dean cover art reminiscent of his 1982 serpent on the band's self-titled debut. These are bright, pristine productions with a bit more of a pop-leaning sensibility than the slightly harder rocking Omega and more prog-oriented Phoenix. As with much of Asia's work since Wetton's emergency heart surgery in 2007, there is an ever deepening maturity and emotional weight to the band's songs. Which isn't to say they were lightweight in the past. On the contrary, Asia have always displayed a knack for balancing pop radio melodicism with serious and universally relatable lyrics, as on their classic 1982 anthem for middle-age ennui, &quot;Heat of the Moment.&quot; On XXX, songwriters Wetton and Downes, while less concerned with disco hot spot fatigue, and more preoccupied with the fragility of life and the emotions it brings to the surface, are nonetheless still at the top of their pop music game. For his part, Wetton sounds ridiculously good, having lost none of his robust and burnished vocal chops over the years. He also seems to have spiritual matters on his mind and songs like the propulsive &quot;No Religion&quot; and the dramatic &quot;Faithful&quot; find him and co-songwriters Downes and Howe investigating the nature of faith, belief in a higher power, and a lack thereof. Similarly, on the elegiac ballad &quot;Bury Me in Willow,&quot; Wetton takes a cathartic stance on living a &quot;Life of conflict.&quot; He begs, &quot;When I'm gone, do this thing for me/No red, no white and blue, no scepter and no cloak/Just bury me in willow, not in oak.&quot; The song, as with much of XXX, has a bittersweet, poetic vibe that matches a rousing melodic theme with a tone of peaceful resignation. Which shouldnÃ†t suggest that Asia has grown soft and dropped the rock from their prog. In fact, as on the arena-ready &quot;Judas&quot; and the sparkling &quot;Face on the Bridge,&quot; the band let loose with the double-barreled attack of Howe's mile-wide guitar lines and Downes' glass-cutter keyboard hits. In 1982, Asia caught the pop/rock pearl and 30 years on, XXX shows the band is still flying high, having never stopped riding the dragon's wings.\n","torrent":{"xt":"urn:btih:48b5059f31341888acda1b954035082500bf1418","amp;dn":"Asia+-+XXX+%5B2012%5D+Flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b5059f31341888acda1b954035082500bf1418","infoHashBuffer":{"type":"Buffer","data":[72,181,5,159,49,52,24,136,172,218,27,149,64,53,8,37,0,191,20,24]},"announce":[],"urlList":[]}}