{"title":"Crunchbang Waldorf unoffizial lite version","uid":8967843,"size":708640768,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:492797f963ce1746110422779cf06791d17f9960&amp;dn=Crunchbang+Waldorf+unoffizial+lite+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Naik007","files":1,"time":1380272275,"description":"Commentary from CBizgreat:\n\n&quot;1. This is not an officially endorsed Crunchbang Waldorf iso. Haven't been given the nod by Corenominal ... no public post, no PM. So no outright approval. Same time haven't received anything from Core saying cease and desist. So taking that to mean he doesn't disapprove and thus proceeding as planned.\n\n2. Standard disclaimer, this is opensource + gnu/nix, as such it comes with no warranty, express or implied. If after downloading and using this dorkish iso, your dog bites you, family, friends, gf(s)/bf(s) whatever decide they no longer like you, you get hit by a bus ( even though you looked both ways.) You see a penny and don't pick it up, you see a penny ... pick it up and contract cooties from it. You experience a bad hair day, bed head ... bad breath or other hygiene problems, miss winning the lottery by one or more numbers or your inner child suddenly goes all emo, throws a fit and starts weeping. While cbiz is sorry aboutcha luck ... it's not my problem and I take no responsibility for anything craptastic that befalls you.\n\n3. A noticeable quirk with the crunchbang-lite.iso. You will not be able to use live session, the iso apparently did not appreciate some step of the fiddling or the type of compression format used to squash the squashfs or whatever. However, it installs just fine, which is all I cared about. No live test drive ... install it.\n\nFor those of you with access to a Nix or Window$ Virtualbox ... give is a test there, for those who don't either damn the torpedoes or go ahead and install the sucker to harddrive and/or wait till some others report back with their experience installing it in VB-etc. I did ... used my much beloved crusty desktop system and tested it in Virtualbox too. Works fine.\n\n4. Take a few moments to report your experience with the iso, success/failure ... thoughts. Your undying gratitude for all the time and headache I went through to do this junk ! Etc.\n\n5. Check the md5sum of the iso, when it left my pc that was &quot;1b8ee2df9471da48da868023b964db6b&quot; and it needs to match that when it reaches your pc. If not ... DO NOT install it. Have no experience with FileFactory ... but in general, trust online file sharing sites about as far as I can throw em. big_smile&quot;\n\nread more:\n &lt;a href=&quot;\nhttp://crunchbang.org/forums/viewtopic.php?id=29162&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://crunchbang.org/forums/viewtopic.php?id=29162&lt;/a&gt;","torrent":{"xt":"urn:btih:492797f963ce1746110422779cf06791d17f9960","amp;dn":"Crunchbang+Waldorf+unoffizial+lite+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"492797f963ce1746110422779cf06791d17f9960","infoHashBuffer":{"type":"Buffer","data":[73,39,151,249,99,206,23,70,17,4,34,119,156,240,103,145,209,127,153,96]},"announce":[],"urlList":[]}}