{"title":"WW2 Battles DVD 3 Stalingrad  Dutch Subs","uid":9024694,"size":1933770752,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4acbe27cc13ed059ca2663645d5dc49a9cee76cb&amp;dn=WW2+Battles+DVD+3+Stalingrad++Dutch+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mpkeuter","files":1,"time":1381344846,"description":"The Russians hailed it a &quot;contemporary Cannae,&quot; and the Germans condemned it as a Rattenkrieg (rat war). Both descriptions were fitting. In the Battle of Stalingrad, Soviet forces surrounded and crushed an entire German army under General Friedrich Paulus, emulating Hannibal's encirclement and destruction of a Roman army under Aemilius Paulus in 216 b.c. For both sides, Stalingrad became a desperate ordeal of rodentlike scurrying from hole to hole.\n\nThis monumental battle is justly considered a turning point in the war on the Eastern Front and one of the most crucial engagements of World War II. The invading Germans saw the conquest of Stalingrad as essential to their campaign in southern Russia, since from this strategic point on the Volga River they could launch further assaults in the Caucasus. The Russians were determined to defend the city as a vital industrial and transportation center. Both Joseph Stalin and Adolf Hitler understood the symbolic importance of the only city to bear the Soviet dictator's name.\n\nOn September 3, 1942, the German Sixth Army under Paulus reached the outskirts of Stalingrad, expecting to take the city in short order. But the Russians had built up their defenses and continued to bring in reinforcements. A very able general, V. I. Chuikov, took command of the main defending force, the Sixty-second Army, while Marshal Georgii K. Zhukov, Soviet Russia's greatest general, planned a counteroffensive.\n\nIn subsequent days the invaders fought their way into Stalingrad against fierce resistance. This was urban street fighting of the most bitter sort, occasioning tremendous losses on both sides. The blasted ruins of houses and factories began to stink as hot winds carried the smell of decaying corpses into every nook and cranny. By late September the Germans could raise the swastika flag over the Univermag department store in the center of town, but they could not dislodge the Russians from the sprawling industrial quarters along the Volga.\n\nIn mid-November, as the stalled invaders were running short of men and munitions, Zhukov launched his counteroffensive to encircle the enemy. At this point the Germans probably could have fought their way out, but Hitler would not allow them to: they were ordered to hold their ground at all costs. Air Marshal Hermann Goring promised to resupply the Sixth Army from the air but proved unable to do so. As winter set in, Field Marshal Erich von Manstein mounted a rescue mission, but it was halted short of its goal, and the freezing and starving Germans in Stalingrad were forbidden to try to reach their would-be rescuers. On February 2, 1943, General Paulus surrendered what remained of his army-some 91,000 men. About 150,000 Germans had died in the fighting.\n\nThe Soviet victory at Stalingrad was a great humiliation for Hitler, who had elevated the battle's importance in German opinion. He now became more distrustful than ever of his generals. Stalin, on the other hand, gained confidence in his military, which followed up Stalingrad with a westward drive and remained largely on the offensive for the rest of the war.\n\nSubs - NL\nAudio - English","torrent":{"xt":"urn:btih:4acbe27cc13ed059ca2663645d5dc49a9cee76cb","amp;dn":"WW2+Battles+DVD+3+Stalingrad++Dutch+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4acbe27cc13ed059ca2663645d5dc49a9cee76cb","infoHashBuffer":{"type":"Buffer","data":[74,203,226,124,193,62,208,89,202,38,99,100,93,93,196,154,156,238,118,203]},"announce":[],"urlList":[]}}