{"title":"The Mark (1961)","uid":8624251,"size":2086587020,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4c71c801372b2e22e312a41cb49a49a485de3686&amp;dn=The+Mark+%281961%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"guidoanselmi","files":3,"time":1372459330,"description":"Problem with original seed.\n\nBased on the 1958 novel by Charles E. Israel, &quot;The Mark&quot; covers the first few months of a ex-con named Jim (Stuart Whitman)'s readjustment to society. Jim's &quot;crime&quot; isn't fully revealed until about halfway through the film. Drawn to young girls, he was convicted of kidnapping and molestation, though he could not bring himself to physically attack the girl. With the help of a prison psychiatrist (Rod Steiger, in one of his best performances) and group therapy, Jim learns the cause and &quot;triggers&quot; of his sexual deviancy, but can he now lead a normal life? When Jim meets Ruth Leighton (Maria Schell), he falls in love -  but his recovery is threatened by a unscrupulous reporter and Ruth's young daughter. \n\nRichard Burton and Jean Simmons (who co-starred earlier in &quot;The Robe&quot;) were originally cast in the roles played by Whitman and Schell but the parts were recast due to production delays and Burton's stage commitments to &quot;Camelot.&quot; Still, Whitman won a Best Actor Oscar nomination for his performance, only to lose - ironically - to Maria Schell's brother, Maximillian, who received the trophy for his performance in &quot;Judgment at Nuremberg.&quot;\n\nGuy Green directed this superb but now nearly forgotten drama. Unavailable in the US.  ","torrent":{"xt":"urn:btih:4c71c801372b2e22e312a41cb49a49a485de3686","amp;dn":"The+Mark+%281961%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c71c801372b2e22e312a41cb49a49a485de3686","infoHashBuffer":{"type":"Buffer","data":[76,113,200,1,55,43,46,34,227,18,164,28,180,154,73,164,133,222,54,134]},"announce":[],"urlList":[]}}