{"title":"Fruit Ninja: Puss in Boots","uid":8790945,"size":32739009,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:4de0ec001486c5fcd21a409e77b7f2da0a7e4e4c&amp;dn=Fruit+Ninja%3A+Puss+in+Boots&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Dr_rahul","files":1,"time":1375944157,"description":"Games\nVer.: 1.0.4 (12)\nReleased: 2013-07-21\nShared: 2013-07-21\nDownloads:21740\nSize: 35.2 MB\nRequirements: Compatible with iPhone, iPod touch, and iPad. Requires iOS 4.3 or later. This app is optimized for iPhone 5.\n\nEn garde! Fruit meets fairytales in the juiciest iPhone game this year - Fruit Ninja: Puss in Boots!\n\nThe suave fruit-slashing swashbuckler, Puss in Boots, faces a challenge that would make Sensei proud. His search for the Magic Beans brings him to developer Halfbrick's legendary hit game Fruit Ninja. Prepare for a journey full of familiar and fruit slicing action he encounters a huge variety of new and exciting challenges!\n\nFruit Ninja: Puss in Boots features the all-new Bandito mode! Slice through a series of increasingly exciting challenges to become the greatest Fruit Ninja warrior ever! Each stage thrusts you into never-seen-before fruit frenzy adventure: Massive fruit from the Giant's castle, precision and timing challenges, all-out fruit onslaughts with new obstacles And for the first time EVER: Throw down against the most-requested addition in Fruit Ninja history - the tomato!\n\nReal Banditos must put their best blade forward because scoring is based on the number of fruit sliced, ninja reflexes and slicing efficiency. A true produce warrior can attain massive high scores and upload their best to Global Leaderboards to compare against friends and the best players online!\n\nBring your blade to Desperado mode - an enhanced and re-mastered version of the Classic Fruit Ninja game that introduced 400 million players to the world's biggest dojo! But this time, you will face even more fruit, unique waves and Puss in Boots' elusive Magic Beans from the DreamWorks Animation feature film!\n\nFinally, bask in the fruit-stained glory of Puss in Boots' own exclusive ninja Stash, featuring a whole range of unique customizable content, including new backgrounds and blades with elements from both the film and Fruit Ninja.\n\nStay juicy, amigos!\n\nTo view Halfbrick's Privacy policy please go to: www.halfbrick.com/pp","torrent":{"xt":"urn:btih:4de0ec001486c5fcd21a409e77b7f2da0a7e4e4c","amp;dn":"Fruit+Ninja%3A+Puss+in+Boots","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4de0ec001486c5fcd21a409e77b7f2da0a7e4e4c","infoHashBuffer":{"type":"Buffer","data":[77,224,236,0,20,134,197,252,210,26,64,158,119,183,242,218,10,126,78,76]},"announce":[],"urlList":[]}}