{"title":"Sexually Broken--Asphyxia Noir Double Category 5 fucked!  Asphy","uid":8626233,"size":1491889363,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4e0fbb2566e565284ee99971a3765653530b302e&amp;dn=+Sexually+Broken--Asphyxia+Noir+Double+Category+5+fucked%21++Asphy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1372514447,"description":"\nAsphyxia Noir Double Category 5 fucked! Brutal deep throating, BBC pounded! Cum drunk to the max! | Asphyxia Noir | Matt Williams\n\nJune 28, 2013 \n \n\nMP4 only.\n \n \nWe got lucky and once again scored the amazing Asphyxia Noir for the page of Sexually Broken. With her long sexy legs, perky natural breasts, runway model looks and alabaster skin, Asphyxia is one of the busiest models in the industry today!. \n\nWe are about to sexually wreck that pretty face and destroy her amazingly tight and perfect pussy with hard cock. Bound in a modified Japanese box tie, Asphyxia is completely helpless but comfortable, on her knees, blindfolded and worshiping cock with her mouth. We let her suck and play for a bit, then we take over and the skull fucking begins! \n\nWe push the cock deep, balls deep and give Asphyxia the face fucking of a life time, all she can do is survive. Before she even knows what happens one cock is replaced by a huge black 10 inch monster cock. Asphyxia mouth and throat are used and used well. She struggles to stay on top of the brutal face fucking, but we are relentless. \n\nNow both cocks attack and Asphyxia finds herself filled from both ends. One end is getting fucked so good, orgasms are being fucked out of her, at the same time her throat is getting used and air is scarce. The harder it is to get air, the harder she comes, the harder she comes, the more air she uses It is a vicious circle!\n\nWhat happens next is legendary. Two men manhandle Asphyxia expertly. It is bondage and rough sex at it's best. Asphyxia is fucked and throated every possible way. She is bound and rebound, fucked and re-fucked to several heart wrenching orgasms. She can barely catch her breath as orgasm after orgasms is simply fucked out of her. In the end Asphyxia is almost mindless, cum drunk and deep in subspace. Completely destroyed by hard pounding sex and skull fucking, until next time that is... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/06_28anoir4/SexuallyBroken-Asphyxia-Noir-Matt-Williams-Asphyxia-Noir-Double-Category-5-fucked-Brutal-deep-throating-BBC-pounded-Cum-drunk-to-the-max.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/06_28anoir4/SexuallyBroken-Asphyxia-Noir-Matt-Williams-Asphyxia-Noir-Double-Category-5-fucked-Brutal-deep-throating-BBC-pounded-Cum-drunk-to-the-max.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:4e0fbb2566e565284ee99971a3765653530b302e","amp;dn":"+Sexually+Broken--Asphyxia+Noir+Double+Category+5+fucked%21++Asphy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e0fbb2566e565284ee99971a3765653530b302e","infoHashBuffer":{"type":"Buffer","data":[78,15,187,37,102,229,101,40,78,233,153,113,163,118,86,83,83,11,48,46]},"announce":[],"urlList":[]}}