{"title":"Secrets In The Shadwos - The Art and Life of Gene Colan","uid":8653011,"size":138791709,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4eeb900fc938861331afd6a55d9130c500ca0879&amp;dn=Secrets+In+The+Shadwos+-+The+Art+and+Life+of+Gene+Colan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"LeonardTSpock","files":-1,"time":1373151326,"description":"'Secrets In The Shadwos - The Art and Life of Gene Colan'\n\nTwoMorrows Publishing, 2005, 168 pages\n\nWritten by Tom Field\n\nIllustrated by Gene Colan\n\nFrom Daredevil to Dracula, from Batman to Brother Voodoo, from Howard the Duck to Stewart the Rat, Secrets in the Shadows: The Art &amp; Life of Gene Colan is the ultimate retrospective on one of comics' all-time unique artists. Featuring rare childhood drawings, photos, recently-discovered wartime illustrations, and original art and sketches from throughout his nearly 60-year career, this book offers new insight on the inspirations, challenges, and successes that shaped Gene 'the Dean' Colan. Among the highlights are: A comprehensive overview of Gene's glory days at Marvel Comics! Marv Wolfman, Don McGregor and other favorite writers share plot/script samples and anecotes of their Colan collaborations! Tom Palmer, Steve Leialoha, and other noted artists show how they approached the daunting task of inking Colan's famously nuanced penciled pages! Plus: a new portfolio of never-before-seen collaborations between Gene and such masters as John Byrne, Michael Kaluta, and George Perez, and all-new artwork created specifically for this book by Gene Colan, who is still inspired by the Secrets in the Shadows.","torrent":{"xt":"urn:btih:4eeb900fc938861331afd6a55d9130c500ca0879","amp;dn":"Secrets+In+The+Shadwos+-+The+Art+and+Life+of+Gene+Colan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eeb900fc938861331afd6a55d9130c500ca0879","infoHashBuffer":{"type":"Buffer","data":[78,235,144,15,201,56,134,19,49,175,214,165,93,145,48,197,0,202,8,121]},"announce":[],"urlList":[]}}