{"title":"Collected Poems","uid":8946684,"size":2202922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fe2f70b0647c555403ba649c5894387799b7a25&amp;dn=Collected+Poems&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"livhre","files":-1,"time":1379793405,"description":"This bilingual editions provides all of Rimbaud's poems, with the exception of his Latin verses and some small fragments. It also includes some of his prose pieces, chosen because they offer a commentary on his poetic concerns. - ;'Rimbaud, the poet of revolt, and the greatest' Albert Camus Rimbaud is the enfant terrible of French literature, the precocious genius whose extraordinary poetry is revolutionary in its visionary, hallucinatory content and its often liberated forms. He wrote all his poems between the ages of about 15 and 21, after which he turned his back on family, friends, and France to roam the world. In his final years he was a trader in the Horn of Africa. Out of the brief, colourful life and the poetry of sensory wildness has been created the myth of Rimbaud, an enduring icon of youth, rebellion, and freedom. But behind the myth lies a poetic adventure of high ambition and painful rigour, poignant yet heroic. Rimbaud is one of the greatest French poets of all times. This bilingual edition provides all of Rimbaud's poems, with the exception of his Latin verses and some small fragments. It also includes some of his prose pieces, chosen because they offer a commentary on his poetic concerns. - ;...user-friendly parallel text, which makes it the ideal choice for students - The Cambridge Quarterly, Vol. 36, No. 1","torrent":{"xt":"urn:btih:4fe2f70b0647c555403ba649c5894387799b7a25","amp;dn":"Collected+Poems","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe2f70b0647c555403ba649c5894387799b7a25","infoHashBuffer":{"type":"Buffer","data":[79,226,247,11,6,71,197,85,64,59,166,73,197,137,67,135,121,155,122,37]},"announce":[],"urlList":[]}}