{"title":"POtHS - Holy Treasures - 40 - The Forbidden Book","uid":8879959,"size":5960553565,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:503836e533c97de20f323ec189421c761e9077a5&amp;dn=POtHS+-+Holy+Treasures+-+40+-+The+Forbidden+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1378303288,"description":"\n\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Holy Treasures - 40 - The Forbidden Book\n\n\n\n\nPOtHS Comment:66 Books, inspired by The Holy Spirit to 40 Authors and it Is Absolutely The divine Word of God.\n\nINTRODUCTION\n\nThe Forbidden Book - History of the English Bible  \n\nDiscover the fascinating story behind the preservation of the Bible, the best selling book of all times.\n\nDuring the Dark Ages, superstition and ignorance controlled the minds of the masses.A few brave men obeyed God and brought the Scriptures to the world.....historical figures responsible for bringing us the Bible as we know and love it today: Wycliffe, Hus, Gutenberg, Colet, Erasmus, Tyndale, Luther and so on.  \n\nJohn Wycliffe, the brilliant 14th century Oxford scholar, translated the Bible from Latin into English in order to enlighten the masses oppressed through ignorance. His work was so despised by the established church, that Pope Martin the Fifth ordered Wycliffe's bones to be dug up and burned forty years after his death.\nMartin Luther was one of the few who challenged church authority in the 16th century and lived to tell the tale. In exposing the folly of indulgences (paying money to the church in order to obtain favor with God), he revealed what had always been written in Scripture, that justification was through faith and faith alone.\nWilliam Tyndale was not spared like his friend Luther. Tyndale spent the last 500 days of his life in a cold castle dungeon. He was then tied to a stake, strangled, and burned. His crime?.. printing Bibles in the English language!\n\nThis one-hour documentary takes us on a fascinating journey through time. It was shot all across Europe and shows all the important places of Christian history. Here you will learn how God's Word was originally scribed and discovered and how the Word was preserved through the 1,000 year period of the Dark and Middle Ages. It will also enlighten you how the King James version was created.\n\nThere are many amazing facts worked into the presentation. Dr. Lampe shows a scroll that is 1000 years old, and tells the viewer that it is word-for-word the same as the text of the Dead Sea Scrolls that were written a full millennium before.\n\nBeing reminded of the blood that was shed to bring the Bible to common folk like us will make us consider just how flippantly we treat the Scriptures. It will make us truly realize how privileged our generation is to have not just one Bible but an entire stack of them in many outstanding translations. It will make us thank God for the faithful men and women who gave their lives that we can have unlimited access to His Word.\n\nRuntime: 59 mins\nLanguage: English (No-Subtitles)\nYear: 2006\nMy Rating: 10/10\nQuality: 10/10\n\nIf financially possible, please buy this CD/DVD to keep Christian films/documentaries in business. If Christians won't buy Christian films/documentaries then who will? If possible please share the movies with your neighbors.\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\nPS: If you need any specific christian movie/documentary or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;4f26212b262e212c273d263c3b262e217d7f7f760f362e272020612c20612621&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;Don't ask me what Christ can do for you!\nHe has done all he could.\nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n &lt;a href=&quot;\nhttp://conspiracyhub.com/membershares.php?it=41&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyhub.com/membershares.php?it=41&lt;/a&gt;  \n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:503836e533c97de20f323ec189421c761e9077a5","amp;dn":"POtHS+-+Holy+Treasures+-+40+-+The+Forbidden+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"503836e533c97de20f323ec189421c761e9077a5","infoHashBuffer":{"type":"Buffer","data":[80,56,54,229,51,201,125,226,15,50,62,193,137,66,28,118,30,144,119,165]},"announce":[],"urlList":[]}}