{"title":"Under Capricorn 1949 DVDRip Sonata Premiere","uid":8877488,"size":707634003,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:513cfc2c7adde42216cecff2289fc57654d36518&amp;dn=Under+Capricorn+1949+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"klinho","files":2,"time":1378247884,"description":"Returning to his old Elstree Studios headquarters in England, Alfred Hitchcock did his best with Hume Cronyn's adaptation of the James Bridie novel Under Capricorn. Costume drama was never Hitchcock's forte, as proven by his disappointing Jamaica Inn (1939), but Capricorn does have its moments. Set in Australia in the early 19th century, the film concerns the tribulations of Lady Henrietta (Ingrid Bergman), who was driven out of her home in disgrace after eloping with unkempt stableman Sam Flusky (Joseph Cotten). Accused of the murder of Henrietta's brother, Flusky has been transported to Australia, where he starts life anew as a prosperous businessman, even while his wife descends further and further into alcoholism and self-hatred. When her cousin Charles Adare (Michael Wilding) comes to visit, Henrietta falls in love with him; she also confides that it was she, and not Flusky, who was responsible for her brother's death. The operatic climax finds Lady Henrietta doing the &quot;right thing&quot; at the cost of her own happiness. At times ponderously directed, the film comes explosively to life whenever Margaret Leighton, cast as Lady Henrietta's spiteful housekeeper, dominates the scene. On a technical level, Under Capricorn is distinguished by the same &quot;ten-minute takes&quot; that Hitchcock had utilized in Rope; particularly effective is an uninterrupted dialogue sequence, played against the backdrop of a spectacular Technicolor sunset (courtesy cinematographer Jack Cardiff). ","torrent":{"xt":"urn:btih:513cfc2c7adde42216cecff2289fc57654d36518","amp;dn":"Under+Capricorn+1949+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"513cfc2c7adde42216cecff2289fc57654d36518","infoHashBuffer":{"type":"Buffer","data":[81,60,252,44,122,221,228,34,22,206,207,242,40,159,197,118,84,211,101,24]},"announce":[],"urlList":[]}}