{"title":"Alex Jones Show - 2013 Aug 23 FR [sebaygo1]","uid":8843535,"size":67023753,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:52206649410e116be436b12b3cc9ff84a2a26eae&amp;dn=Alex+Jones+Show+-+2013+Aug+23+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1377312533,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nFriday, 23 August 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Friday, August 23 edition of The Alex Jones Show, Alex exposes how the mainstream media may be downplaying the possible racial motivation behind recent, high-profile murders because it does not fit the media's agenda. \n\nAlex welcomes back Syrian Girl to get the latest updates on the situation in Syria. In yet another example of war propaganda, the U.S. government is now claiming that Syrian President Bashar al-Assad is using chemical weapons against his own people. \n\nAlex interviews Dr. Duane Weed and Marc Messmer, the two Impeach Obama protestors arrested by police in Missouri for not leaving a public area. \n\nDr. Christopher Busby, a British scientific advisor to the Low Level Radiation Campaign, also joins the show to discuss new developments in the Fukushima nuclear disaster. A Japanese governor has recently announced that the massive leak of radioactive water from the damaged nuclear plant is a national emergency.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:52206649410e116be436b12b3cc9ff84a2a26eae","amp;dn":"Alex+Jones+Show+-+2013+Aug+23+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52206649410e116be436b12b3cc9ff84a2a26eae","infoHashBuffer":{"type":"Buffer","data":[82,32,102,73,65,14,17,107,228,54,177,43,60,201,255,132,162,162,110,174]},"announce":[],"urlList":[]}}