{"title":"1 - Angel  the most beautiful Porn Star  ever - Classic Porn XXX","uid":8922950,"size":118308970,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:52232f6844c416b961cefc56f263dde2a19e1120&amp;dn=1+-+Angel++the+most+beautiful+Porn+Star++ever+-+Classic+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"KidAtomic","files":-1,"time":1379298032,"description":"Angel in a scene (1) from Too Naughty To Say No\n\n\nDate of Birth\n1966\n\nBirth Name\nJennifer James\n\nMini Biography\n\nLong considered by many to be the single most classically, naturally beautiful woman to ever hit the porn industry, Angel burst onto the scene in 1984. Her freshness, her infectious smile and giggle, her enthusiasm, and - most importantly - her heart-stopping beauty and flawless, non-enhanced, virtually perfectly proportioned body mesmerized all who saw her. She made less than 40 films in her seven-year career, the vast majority of them between 1984-1988. At a time when many actresses were averaging five or six films a month, Angel's career average was about six films a year, enabling her to avoid the tough, jaded look many porn queens get after several years (and several hundred films). She basically quit the business in 1989, although she made a few films that year and a few more in 1991 (she didn't make any in 1990). She made a return in 1991 with several new films, but whatever happened to her in the interim affected her looks; she had gained a fair amount of weight, looked somewhat puffy and didn't seem to have the spark and enthusiasm she did in her earlier films, and these new efforts weren't as successful as the ones she made at the beginning of her career. She apparently left the business for good in 1991, and nothing has been heard from her since.\n\n","torrent":{"xt":"urn:btih:52232f6844c416b961cefc56f263dde2a19e1120","amp;dn":"1+-+Angel++the+most+beautiful+Porn+Star++ever+-+Classic+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52232f6844c416b961cefc56f263dde2a19e1120","infoHashBuffer":{"type":"Buffer","data":[82,35,47,104,68,196,22,185,97,206,252,86,242,99,221,226,161,158,17,32]},"announce":[],"urlList":[]}}