{"title":"BBC Stacey Dooley Investigates Series 1 4of6 Tourism and the Tru","uid":8917409,"size":702014098,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:52609939251a6702bb88afcb906088b2005727f6&amp;dn=BBC+Stacey+Dooley+Investigates+Series+1+4of6+Tourism+and+the+Tru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MVGroup","files":-1,"time":1379174519,"description":"Stacey Dooley Investigates: Series 1\n\nSociopolitical Documentary hosted by Stacey Dooley, published by BBC in 2011 - English narration\n\n\nInformation\n------------------------------\n\nStacey Dooley Investigates: Series 1\nIn 2007, fashion fanatic Stacey Dooley's life took an unexpected turn when she travelled to India for Blood, Sweat and T-Shirts to live and work alongside the people in the Indian fashion industry making clothes for the UK high street. In the cramped backstreet workshops of the Mumbai slums she came face to face with child labour and what she saw there changed her life.\n\n\n1)  Kids with Guns \nStacey Dooley returns with a moving and insightful documentary exploring the issue of child soldiers in the Democratic Republic of Congo, where an estimated 5.4 million people have died in the civil war. An estimated 30,000 children have been used as soldiers during the 14-year conflict in the DRC and no one knows how many thousands are still in the forests, enslaved by armed militias. Stacey meets kids who have been soldiers. She goes to a rescue centre where boys and girls arrive daily, rescued from guerrilla militia units as well as the Congolese National Army. She befriends one boy, 16-year-old Patrick, who was kidnapped when he was just 12. He tells her how he was forced to kill people and was even made to drink their blood to give him magic powers. Stacey witnesses for herself the terrifying complexities of war where young kids have been manipulated to commit atrocities, but who still have to return to living a normal life again.\n\n2)  Kids for Sale \nIn Kathmandu it is estimated that thousands of children work for wages. As the government clamps down on child labour in India more children are crossing the border to work in Nepal's embroidery and carpet factories. Stacey discovers children working in terrible conditions and for very little pay. She befriends a young boy who is beaten by his factory manager and helps him escape to the safety of a children's hostel. Stacey meets children who have been sold into domestic slavery by their families, including a girl in her teens who was rescued three years ago and is now being looked after and educated in a hostel. With the aid of a charity Stacey joins her as she tries to save her 13-year-old sister from the same situation.\n\n3)  Sex Trafficking in Cambodia \nStacey Dooley explores the issue underage sex trafficking in Cambodia, investigating how thousands of young girls are being sold into sexual slavery often by those they trust the most, their family. She confronts the problem head on as she joins the police on raids to shut down brothels and learns the harsh realities for girls who are trafficked and abused in the sex industry It is thought that around a third of the estimated 100,000 sex workers in Cambodia are under the age of 18. Stacey starts her journey in the capital Phnom Penh's red light district, where thousands of these girls are thought to be working. Here she sees how young girls are paraded in front of local Cambodian men in bars. She meets a young girl who describes how she was trafficked when she was just 12 years old - she thought her aunt was taking her to school but found herself sold into sexual slavery from which she has never escaped. Stacey then goes on a road trip with 18-year-old Alang to the backstreet brothels and gangland areas where sex is the only commodity that's recognised.\n\n4)  Tourism and the Truth Kenya \nThis time, Stacey is heading to Kenya to investigate the side of tourism that the average holidaymaker doesn't see. Kenya is fast emerging as one of the world's hottest tourist destinations, with its beautiful beaches, luxury hotels and safaris. More and more Brits flock there every year, and with a week all-inclusive costing as little as 600 pounds it's not hard to see why. But is the influx of tourists making life hell for the locals? Just down the road from the hotel strip she discovers a world of squalid living conditions and families struggling to survive, she hears stories of terrible pay and extreme lack of rights, and joins one group of workers as they hit the streets to protest.\nShocked by what she has seen and determined to do something to help the plight of the hotel workers, Stacey goes head to head with the Kenyan Minister for Tourism.\n\n5)  Tourism and the Truth Thailand \nIn this episode, Stacey is travelling to one of our favourite holiday destinations, Thailand, to explore the darker side of tourism that the average holiday maker doesn't see. Hundreds of thousands of us flock to Thailand every year, where for just a few hundred pounds you can enjoy beautiful beaches, top hotels and unbeatable service. A trip to Thailand has become a rite of passage for many young Brits, but why is it possible to enjoy such luxury at such bargain prices? Stacey begins her trip in Phuket, where she stays as a tourist before swapping roles and becoming a hotel worker. She works as a chambermaid and struggles with the hard work and incredibly high standards, having to clean 14 rooms a day for just four pounds. She also discovers what it's like to live on such low wages and the sacrifices that some hotel workers have to make. Many live in slum conditions or in hotel dormitories, separated from their children for months at a time.\n\n6)  Tourism and the Truth Magaluf \nStacey Dooley travels to Magaluf, on the Spanish island of Mallorca, to get under the skin of this popular resort. The resort is famous for the drunken antics of the British tourists who go there, but Stacey wants to find out what it's like for the thousands of Spanish workers who serve, police and clear up. What starts out as a regular shift at a bar or cleaning hotel rooms often ends up with Stacey uncovering a darker side that only the workers and residents get to see. Working in a bar Stacey is not only surprised to learn how much free alcohol is on offer to young British tourists, but she's horrified when she witnesses the sexually explicit drinking games the drunk tourists are encouraged to play. When she spends a morning cleaning hotel rooms, not only does she learn about the vandalism and mess tourists leave behind, but she meets one member of staff who's been left traumatised after he saw a young girl fall to her death at the hotel earlier this year, leaving him constantly worried about the safety of inebriated guests. Stacey discovers that the high numbers of tourists who die or are badly injured every year is linked to heavy drinking.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img845.imageshack.us/img845/2475/a9zl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img845.imageshack.us/img845/2475/a9zl.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img41.imageshack.us/img41/3415/6t4o.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img41.imageshack.us/img41/3415/6t4o.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img600.imageshack.us/img600/2726/s9x5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img600.imageshack.us/img600/2726/s9x5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img407.imageshack.us/img407/754/s703.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img407.imageshack.us/img407/754/s703.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img14.imageshack.us/img14/7018/t9nf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img14.imageshack.us/img14/7018/t9nf.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img838.imageshack.us/img838/438/qlct.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img838.imageshack.us/img838/438/qlct.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img51.imageshack.us/img51/6748/8yun.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img51.imageshack.us/img51/6748/8yun.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img6.imageshack.us/img6/5831/1s7q.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img6.imageshack.us/img6/5831/1s7q.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img812.imageshack.us/img812/6925/todp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img812.imageshack.us/img812/6925/todp.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;cf87a6a8a78f83fce1ff&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1638 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 58mins\n * Framerate: 25fps\n * Number of Parts: 6\n * Part Size: 670 MB\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Stacey_Dooley&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Stacey_Dooley&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:52609939251a6702bb88afcb906088b2005727f6","amp;dn":"BBC+Stacey+Dooley+Investigates+Series+1+4of6+Tourism+and+the+Tru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52609939251a6702bb88afcb906088b2005727f6","infoHashBuffer":{"type":"Buffer","data":[82,96,153,57,37,26,103,2,187,136,175,203,144,96,136,178,0,87,39,246]},"announce":[],"urlList":[]}}