{"title":"Alex Jones Show - 2013 Sep 01 SU [sebaygo1]","uid":8872213,"size":40434001,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5269a452a2fa7e6c72799f18e379ff6b22c85704&amp;dn=Alex+Jones+Show+-+2013+Sep+01+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":9,"time":1378094909,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 01 September 2013\n\n\n[sebaygo1]\n\nShow description from theweb site :: Today on the Sunday, September 1 broadcast of the Alex Jones Show, Alex talks again with American author and political commentator, Dr. Jerome R. Corsi, and continues to break down the conflict with Syria and Obama's recent decision to seek Congressional authorization before intervening militarily. Alex will discuss the uphill battle Obama faces as he attempts to convince Congress to vote yes on a war with Syria. Alex talks about Salon's recent attack on Infowars, Ron Paul and other media outlets that called out the false flag attack in Syria. New York Times best selling author and freelance journalist Greg Palast joins Alex to discuss the economic meltdown of America and the financial consequences of a war with Syria.\n\nNOTE: Most of today's show is previously aired material e.g., the Greg Palast interview from Tuesday's radio show. In the later part of the second hour is an interview with iconic actor and comedian Russell Brand which was done Friday (and a portion of which aired on Friday's Infowars Nightly News).\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:5269a452a2fa7e6c72799f18e379ff6b22c85704","amp;dn":"Alex+Jones+Show+-+2013+Sep+01+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5269a452a2fa7e6c72799f18e379ff6b22c85704","infoHashBuffer":{"type":"Buffer","data":[82,105,164,82,162,250,126,108,114,121,159,24,227,121,255,107,34,200,87,4]},"announce":[],"urlList":[]}}