{"title":"Interracial Fuck Sluts #2 - Anal Interracial Porn XXX","uid":8888860,"size":3278184849,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:52d07ec22f150079d168776ecb3a10435b08b49f&amp;dn=Interracial+Fuck+Sluts+%232+-+Anal+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KidAtomic","files":-1,"time":1378533808,"description":"\nInterracial Fuck Sluts #2\n\nFor some, there's nothing more taboo and exciting that crossing the color barrier. Jonni Darkko's Interracial Fuck Sluts 2 explores that forbidden desire with the help of five young knockouts who can't get enough black cock! Glammed up, tattooed fetish girl Juelz Ventura spews a constant stream of dirty talk as she takes Prince Yahshua's huge African prong in her shaved pussy. He gags her with his pole, getting several sloppy, gooey blow jobs, then makes the stylish slut wear an O-ring gag that makes shooting cum in Juelz' gutter mouth convenient. Bikini-clad Alanah Rae has absurdly big, round tits which she uses to pleasure Sean Michaels' famous black cock. Alanah's bald honey hole gets thoroughly filled, and she takes a facial that she drips all over her tremendous boobies. Slim, French brunette Lou Charmelle wears pink underwear and matching stockings for her date with racial destiny. Li'l Lou takes Yahshua's enormous black dick up her ass, fingering her sensitive pussy all the while, and sucks the invader clean. She gets her throat and anus stretched, and a wad of sperm in her open mouth, which Lou drools and spreads all over her belly and chest. Soft, young blonde Lea Lexis masturbates her asshole in a solo display, soon interrupted by Sean, who's in the mood for sodomy. He plows Lea's hungry butthole, making it gape, and then has the sexy whore suck him clean. Lea gags on his black dick, expectorates lots of stringy saliva and takes a well-earned facial blast. Finally, sexy, natural-bodied, tattooed bitch Tori Lux gets an interracial workout with Sean. The scene includes lots of baby oil, ass-stretching toys, butt-fucking, ass-to-mouth blow jobs and nasty, gag spit-inducing face-fuck, ending with a mess of a cum facial. Can't we all just get along like this?\n\n    Scene 1. Juelz Ventura, Prince Yahshua\n    Scene 2. Alanah Rae, Sean Michaels\n    Scene 3. Lou Charmelle, Prince Yahshua\n    Scene 4. Lea Lexus, Sean Michaels\n    Scene 5. Tori Lux, Sean Michaels\n\nLength 2 hrs. 48 mins.\nRating XXX\nReleased Jan 20 2011\nProduction Year 2011\nStudio  Evil Angel\n\nActresses:\n    Alanah Rae [IR]\n    Juelz Ventura [IR]\n    Lea Lexus (as Lea Lexis) [Anal IR]\n    Lou Charmelle [Anal IR]\n    Tori Lux [Anal IR]\n\nActors:\n    Prince Yahshua\n    Sean Michaels\n\n","torrent":{"xt":"urn:btih:52d07ec22f150079d168776ecb3a10435b08b49f","amp;dn":"Interracial+Fuck+Sluts+%232+-+Anal+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52d07ec22f150079d168776ecb3a10435b08b49f","infoHashBuffer":{"type":"Buffer","data":[82,208,126,194,47,21,0,121,209,104,119,110,203,58,16,67,91,8,180,159]},"announce":[],"urlList":[]}}