{"title":"Anal.Enthusiasts.XXX.DVDRip.x264-CHiKANi","uid":8941133,"size":1862588617,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5362a437cc93d4129932f4621dd9a7ad50981302&amp;dn=Anal.Enthusiasts.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1379659142,"description":"Anal.Enthusiasts.XXX.DVDRip.x264-CHiKANi\n\nStarring : AJ Applegate, Bailey Blue, Criss Strokes, Gabriella Paltrova, Mark Wood, Will Powers, Zoey Monroe. Description : LeWood Productions, the perverse, anally obsessed husband-wife team of Mark Wood and Francesca Le, requires a special type of girl for their intense sodomy videos. The starlets that sign up for LeWood's ruthless sessions must be truly eager for hard-core ass play. In &quot;Anal Enthusiasts,&quot; tempting American-Latina MILF Francesca and well-hung Mark present four nasty vignettes marked by gagging deep-throat domination, rough butt fucking and ass-to-mouth cocksucking, all enjoyed with unbridled lust! Glamorous, exotic interior decorator Gabriella Paltrova is helping Mark Wood spruce up the place. Wearing tight leather booty shorts, the sultry girl services the client, gagging on his thick cock. He porks her asshole and splatters her gorgeous face with hot splooge. Next, adorable, all-natural blonde cutie AJ Applegate seduces lucky pool boy Will Powers. He relentlessly plows AJ's plush, plump derriere. Firm, young yoga instructor Bailey Blue teaches goofball novice Mark, her slim, athletic figure displayed in a tank top and her enticing camel toe outlined in skimpy shorts. Tattooed Bailey works on his circulation by releasing his big boner for a wet blow job and some vigorous backdoor ramming. Sexy, naive Zoey Monroe, trying to launch a show biz career, meets sleazy agents Chris Strokes and Mark. She ends up taking their throbbing pricks in a lewd double-penetration and gobbling two messy cum loads. The DVD includes 15 minutes of cum-faced post-scene interviews! Looking for some high-energy buggery? LeWood's &quot;Anal Enthusiasts&quot; are downright passionate about getting their assholes pounded. \n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5golwf0x0zocdiuyeai1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5golwf0x0zocdiuyeai1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=3khzi2vqg62ihawk7hsb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=3khzi2vqg62ihawk7hsb.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5362a437cc93d4129932f4621dd9a7ad50981302","amp;dn":"Anal.Enthusiasts.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5362a437cc93d4129932f4621dd9a7ad50981302","infoHashBuffer":{"type":"Buffer","data":[83,98,164,55,204,147,212,18,153,50,244,98,29,217,167,173,80,152,19,2]},"announce":[],"urlList":[]}}