{"title":"Brewster's Millions  &amp;ndash; George Barr McCutcheon","uid":8937911,"size":224405,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53b40e5421141474fd3c470373a267d75d5152fd&amp;dn=Brewster%27s+Millions++%26ndash%3B+George+Barr+McCutcheon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1379613315,"description":"George Barr McCutcheon (1866-1928), an American novelist and playwright, was born in Tippecanoe County, Indiana. He attended Purdue University but was dismissed when he failed his exams in second year. He then began working as a reporter for the Lafayette Journal and became City Editor of the Lafayette Daily Courier in 1893. He is famous largely because of his Graustark series of novels. In total, McCutcheon wrote forty novels and also wrote plays, Brood House (1910), and Mary Midthorne (1911).\n\nFirst published in 1902 under the pseudonym Richard P. Greaves, Brewster's Millions was one of George Barr McCutcheon's most successful titles. The prolific author was noted for his ability to write page-turners, full of vivid characters and with an attention to detail. There have, in fact, been six movie versions of this one book, most recently starring Richard Pryor and John Candy. A new version from Warner Bros. is set to hit theaters in 2012. It's popularity serves as a testament to a great story well told. \n\nWould you be able to spend a million dollars in cash and leave yourself penniless if it meant you would then be given many more millions? That's poor Monty Brewster's dilemma in this charming tale.\n\nJust as poor Monty Brewster, twice heir to a fortune, is beginning to adjust to his cold and distant grandfather's ''paltry'' million-dollar bequest, an even more mysterious benefactor emerges offering to leave him some ''real'' wealth. All he has to do is be penniless at nine o'clock on the morning of his twenty-sixth birthday. It seems like an easy task, but Monty discovers that it is no simple matter to divest oneself of a million dollars, especially as the bank insists on paying him $19,607.84 in interest per day. And what can you do when each ridiculous ''sure-loss'' suddenly skyrockets when you invest in it? Money seems to flow in faster than a person can throw it overboard. And then there are Peggy and Barbara; how are they going to react to each attempt to squander a fortune? Can Monty keep the girl while losing the money?","torrent":{"xt":"urn:btih:53b40e5421141474fd3c470373a267d75d5152fd","amp;dn":"Brewster%27s+Millions++%26ndash%3B+George+Barr+McCutcheon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b40e5421141474fd3c470373a267d75d5152fd","infoHashBuffer":{"type":"Buffer","data":[83,180,14,84,33,20,20,116,253,60,71,3,115,162,103,215,93,81,82,253]},"announce":[],"urlList":[]}}