{"title":"The Tao of Chemistry and Life -Cordes- [Non-Fiction] PDF_(K-Slen","uid":8990452,"size":5474028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53ef2c4ba49c9b244ad63b2b2e033e6ab59aab40&amp;dn=The+Tao+of+Chemistry+and+Life+-Cordes-+%5BNon-Fiction%5D+PDF_%28K-Slen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"K-Slender","files":3,"time":1380769381,"description":"\nPublication Date: June 4, 2009 | ISBN-10: 0195369637 | ISBN-13: 978-0195369632\n\nWritten with the non-scientist in mind, this book employs the molecule and its interactions to explain the characteristics of living organisms in terms of the underlying chemistry of life. Following introductory chapters on the fundamentals of life, attention then turns to small molecules such as hormones and neurotransmitters and subsequently to macromolecules including proteins and nucleic acids. The interactions between small and macromolecules remains a central point throughout the book. These include enzymatic catalysis, hormone action, neurotransmission, regulation of metabolism, biosynthesis of macromolecules, the mechanism of action of drugs, taste, olfaction, learning and memory, and chemical communication.\n\nA second central point of emphasis is the sensitive relationship between chemical structure and biological activity. Examples abound and include why subtle changes in fatty acid architecture have positive or negative outcomes for human health in omega-three fatty acids and trans fats and how modest changes in the chemical decoration of the steroid skeleton provide the difference between male and female sex hormones. Beyond these examples taken from the chemistry of small molecules, the book includes a thoughtful consideration of genomics, including the relationship between genome structure and species. The theme of human health appears throughout the book. Cardiovascular medicine, cancer, metabolic diseases, and diseases of the nervous system receive significant attention including consideration of how a variety of drugs work in combating these issues.\n\nIn sum, the goal of this book is to inform the non-scientist community in a way that will lead to increased understanding of the relationship between chemistry and life.\n\nGene Cordes has been a professor of chemistry and pharmacy at Indiana University and the University of Michigan, a VP in the Merck Research Labs and President of R&amp;D at Sterling Winthrop Inc. His research work has been largely in the area of enzymatic and non-enzymatic mechanisms of catalysis whereas his pharmaceutical industry work focused on drug discovery with emphasis on cardiovascular medicine, metabolic diseases, and diagnostic imaging agents.","torrent":{"xt":"urn:btih:53ef2c4ba49c9b244ad63b2b2e033e6ab59aab40","amp;dn":"The+Tao+of+Chemistry+and+Life+-Cordes-+%5BNon-Fiction%5D+PDF_%28K-Slen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53ef2c4ba49c9b244ad63b2b2e033e6ab59aab40","infoHashBuffer":{"type":"Buffer","data":[83,239,44,75,164,156,155,36,74,214,59,43,46,3,62,106,181,154,171,64]},"announce":[],"urlList":[]}}