{"title":"The.Ass.Party.5.DiSC1.XXX.DVDRip.x264-Pr0nStarS","uid":8651948,"size":1768442092,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:562bda956f6f478ba9dd3db455bdfefc09942104&amp;dn=The.Ass.Party.5.DiSC1.XXX.DVDRip.x264-Pr0nStarS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":3,"time":1373129691,"description":"Director Joey Silvera cordially invites you to a special, all-star jamboree of anal jammin. The Ass Party 5, Joeys new double-disc gonzo celebration of hard-core sodomy, features some of Porn Valleys most gorgeous, young butt sluts having a backdoor open-house with whatever toys and big, hard cocks happen to be handy. Joeys parties are always unpredictable... First, adorable cum slut Luna C. Kitsuen and frisky Cameron Canada enjoy a nasty rectal soiree with fat dildos, Jordan Ashs giant erection and even a ripe tomato! The ladies orally swap a creamy load of sperm. Stunning blonde Sierra Day teases us with her perfect, all-natural body. She buzzes her clit with a powerful vibrator before using an enormous butt plug and a massive dick to make her prolapsed anus bloom like a rose! Ass-obsessed cuties Ashley Fires and Mischa Brooks drill each others plump ass with phallic tools and probing tongues, then team up to service Chris Johnsons manhood. Pretty newbie Kristen Jordan and modelesque beauty Sarah Shevon stretch each others sphincter all out of shape with a strap-on dildo and other party favors. Kristen slurps the directors cock POV-style and laps up all his cum. Finally, tattooed bikini bitch Bailey Blue gets totally butt-fucked and showered in Kurt Lockwoods semen. Plus theres over an hour of revealing interviews, dressing room footage and extra sex! This butt bangers ball gets all the girls on their feet... and after The Ass Party 5, they wont be able to sit down!\n\nAshley Fires, Bailey Blue, Cameron Canada, Kristen Jordan, Luna Kitsuen, Mischa Brooks, Sarah Shevon, Sierra Day\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=theassupu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=theassupu.jpg&lt;/a&gt;\n\n\ncd1 &lt;a href=&quot;\nhttp://www.fastpics.net/?v=theassyyy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=theassyyy.jpg&lt;/a&gt;\n\n\ncd2 &lt;a href=&quot;\nhttp://www.fastpics.net/?v=theasstft.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=theasstft.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:562bda956f6f478ba9dd3db455bdfefc09942104","amp;dn":"The.Ass.Party.5.DiSC1.XXX.DVDRip.x264-Pr0nStarS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"562bda956f6f478ba9dd3db455bdfefc09942104","infoHashBuffer":{"type":"Buffer","data":[86,43,218,149,111,111,71,139,169,221,61,180,85,189,254,252,9,148,33,4]},"announce":[],"urlList":[]}}