{"title":"English subtitles for Snake and Crane Arts of Shaolin Blu-ray Re","uid":8927647,"size":58881,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5775a1777ff528295f11d9f5a70fe051d9c1e2a4&amp;dn=English+subtitles+for+Snake+and+Crane+Arts+of+Shaolin+Blu-ray+Re&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"_mr3_","files":1,"time":1379393370,"description":"English subtitles for Snake and Crane Arts of Shaolin Blu-ray Release (subtitle data only)\n\nAn English subtitle track in .srt format that fits the Japanese Blu-Ray release of Snake and Crane Arts of Shaolin:\n &lt;a href=&quot;\nhttp://www.blu-ray.com/movies/Snake-and-Crane-Arts-of-Shaolin-Blu-ray/52850/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blu-ray.com/movies/Snake-and-Crane-Arts-of-Shaolin-Blu-ray/52850/&lt;/a&gt;\ntime: 1:40:34 (100.34)\naspect: ~2.37\n(Audio) Language: ç®€ä½“ä¸­æ–‡ (Simplified Chinese), Japanese\n&lt;now with English sub track&gt;\n\nLineage: ripped from a DVD release, decoded, and hand edited to a) maximize accuracy of timings (start and duration) of the blu-ray cut, b) split out a few of the confusing joined dialogs (not nearly all), c) correct misspellings and mismarkings (ex. mismatched quotes), d) convert British-specific spellings to standard English (don't ask why), e) provide more accurate translations in a few cases, and f) readjust line breaks to keep dialog on one line where possible (to minimize screen image intrusion).\n\nThis is one of my all-time favorite movies, and maybe I'm out of touch but the only official Blu-Ray release that I know of is the Japanese one mentioned above.  Since I have no idea when I'll actually get around to fully learning Mandarin, I figured I should try to hack an English sub track (sorry international bros/sis's, if I were less ignorant and knew more languauges I'd do them too).  After spending hours doing this for myself I figured anyone else that might want it for their blu-ray could benefit too (extract video and audio tracks as desired and repackage with subs).  I'm sorta providing it as-is, but feel free to give feedback (especially broken stuff, it works for me but who knows), and if I get a chance to breathe I'll see if I can do more work on it...for ex. the many cases of joined dialog ie. one subtitle holding dialog between multiple cast members.  Another option is to use an .srt editor like SubtitleEdit, feel free.","torrent":{"xt":"urn:btih:5775a1777ff528295f11d9f5a70fe051d9c1e2a4","amp;dn":"English+subtitles+for+Snake+and+Crane+Arts+of+Shaolin+Blu-ray+Re","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5775a1777ff528295f11d9f5a70fe051d9c1e2a4","infoHashBuffer":{"type":"Buffer","data":[87,117,161,119,127,245,40,41,95,17,217,245,167,15,224,81,217,193,226,164]},"announce":[],"urlList":[]}}