{"title":"A Democracy Is Born: An Insider's Account of the Battle Against","uid":8626398,"size":1312216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:588940a87465df6e012924138200c40e8a116c17&amp;dn=A+Democracy+Is+Born%3A+An+Insider%27s+Account+of+the+Battle+Against&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"blackatk","files":-1,"time":1372516790,"description":"In October 2004, more than eight million citizens of Afghanistan turned out to vote in the first democratic election in the turbulent, 5,000-year history of the country. This incredible voter turnout in the face of horrific threats and actual bullets, rockets, and bombs was a shout of defiance and a significant setback to the former Taliban regime and their al Qaeda allies. It was a stunning success and serious step forward for the Afghan people and for the United States in the campaign against international terrorism. The change is more dramatic than the American Revolution, in the aftermath of which the new American democracy maintained a representative form of government similar to its British roots. The change is also more positive than the French Revolution, which degenerated into tyranny and anarchy. The Afghan Revolution of democratic governance, albeit aided and guided by international military and political powers, is thus one of the most historic events of our time.\n\nWritten by a former U.S. Army intelligence officer, this book provides readers with a candid account of Afghanistan's first presidential election and its subsequent transition to democratic self-governance. In particular, Morgan speaks to the security apparatus and the measures protecting the election. The election's security process marked a defeat for the al-Qaeda and Taliban terrorist insurgents attempting to frustrate Afghanistan's transformation into a democratic nation. Morgan's narrative of Afghan development is interspersed with firsthand, personal accounts from the author's eleven-month deployment as an officer serving in the U.S. military in Afghanistan. His stint there, embedded within the United Nations in a civilian-clothes role, enables him to write from the perspective of a UN security officer, offering insights beyond those that might be gained on the battlefield.\n\n\n# Publisher: Praeger (September 30, 2007)\n# Language: English\n# ISBN-10: 0275999998\n# ISBN-13: 978-0275999995\t","torrent":{"xt":"urn:btih:588940a87465df6e012924138200c40e8a116c17","amp;dn":"A+Democracy+Is+Born%3A+An+Insider%27s+Account+of+the+Battle+Against","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"588940a87465df6e012924138200c40e8a116c17","infoHashBuffer":{"type":"Buffer","data":[88,137,64,168,116,101,223,110,1,41,36,19,130,0,196,14,138,17,108,23]},"announce":[],"urlList":[]}}