{"title":"The Fosters COMPLETE SEASON 1","uid":8794544,"size":3405095497,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5ac91fab91b406f91fd7911e02c119e07d51ce2e&amp;dn=The+Fosters+COMPLETE+SEASON+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":20,"uploader":"Lal0JR","files":10,"time":1376038895,"description":"I don't take Credit for this. I just gathered all Episodes and made it into one whole big file Hope you Enjoy! Please Seed! This is my first torrent Hope it turn out ok :D\n\n\n=================PLOT=========================\n\n\n\nThe Fosters is an American drama series on ABC Family that premiered on June 3, 2013. The series follows the lives of the Foster family, a lesbian couple raising children together. On July 30, 2013, The Fosters was picked up for a full season.[1] An \nadditional ten episodes will be produced, with the episodes airing in January 2014.\nLena Adams (Sherri Saum) and Stef Foster (Teri Polo) are same-sex domestic partners living in (San Diego, California). Lena, a school administrator, and Stef, a police officer, are raising three children: Stef's biological son from a previous marriage, Brandon (David Lambert), and a pair of adopted twins, Jesus (Jake T. Austin) and Mariana (Cierra Ramirez). Lena and Stef also agree to take on a troubled foster child, Callie (Maia Mitchell), and her younger brother, Jude (Hayden Byerly). Their lives become more complicated as the family members deal with Stef being partnered at work with her ex-husband, Mike (Danny Nucci); with Mariana secretly reaching out to her drug-addicted birth mother; and with a growing romantic attraction between Callie and Brandon.\n","torrent":{"xt":"urn:btih:5ac91fab91b406f91fd7911e02c119e07d51ce2e","amp;dn":"The+Fosters+COMPLETE+SEASON+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ac91fab91b406f91fd7911e02c119e07d51ce2e","infoHashBuffer":{"type":"Buffer","data":[90,201,31,171,145,180,6,249,31,215,145,30,2,193,25,224,125,81,206,46]},"announce":[],"urlList":[]}}