{"title":"Australian Country Music Part Three","uid":8790734,"size":1450089216,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5cc2f1ef90f50e537b50d7f7fb9e5d08f8fe6b1f&amp;dn=Australian+Country+Music+Part+Three&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"Frankentech","files":-1,"time":1375939104,"description":"This is Part Three of a collection of Australian country music. It features mostly Bush Ballads including just about every Slim Dusty record ever produced. Also included is the greats like Tex Morton, Buddy Williams, Gordon Parsons and so many others. This one and Part Two is 100% Slim Dusty, the first one is the rest of the collection. I had to split them up because TPB said the metadata was too large.\n\nThis collection is very special to me because I was fortunate enough to have been knocking around Australia when many of these artists were still alive and performing so not only have I seen some of these songs performed live, I have shaken hands with the men who sang them and sometimes shared a beer. I knew Tex when he lived in the Sydney suburb of Manly and had many a cold beer with Stan Coster and Gordon Parsons. \n\nI really hope you enjoy this collection as much as I have. It's part of an Australia that's probably gone for good and I think in many ways, that's a shame. This music preserves some of that Australia for our kids so don't let this torrent die... seed you bastards!","torrent":{"xt":"urn:btih:5cc2f1ef90f50e537b50d7f7fb9e5d08f8fe6b1f","amp;dn":"Australian+Country+Music+Part+Three","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cc2f1ef90f50e537b50d7f7fb9e5d08f8fe6b1f","infoHashBuffer":{"type":"Buffer","data":[92,194,241,239,144,245,14,83,123,80,215,247,251,158,93,8,248,254,107,31]},"announce":[],"urlList":[]}}