{"title":"Abbot Suger and Saint Denis (Art Architecture History Ebook).pdf","uid":9008786,"size":47976181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d713201840ddcda456b887cee5b65af283e3227&amp;dn=Abbot+Suger+and+Saint+Denis+%28Art+Architecture+History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":15,"uploader":"STBGD","files":-1,"time":1381087215,"description":"Gerson, Paula Lieber, &quot;Abbot Suger and Saint-Denis&quot;\nPublisher: Metropolitan Museum of Art/H.N.Abrams | 1986 | ISBN: 0870994085/0810915170 | English | PDF | 304 pages | 45.75 Mb\n\nSuger, abbot of the French abbey of Saint-Denis, lived from 1081 to 1151. This book of essays about his life and achievements grew out of a symposium sponsored by the International Center of Medieval Art and by Columbia University. The symposium was held in 1981 simultaneously at The Cloisters and Columbia University in conjunction with an exhibition at The Cloisters that commemorated the 900th anniversary of Suger's birth. For the symposium, twenty-three medieval scholars from all parts of the world, representing a wide range of humanistic disciplines, were brought together to discuss the varied nature of Suger's activities. Suger has been best known for his contributions as a patron of art and architecture. As H.W. Janson wrote, &quot;The origin of no previous style can be pinpointed as exactly as that of Gothic. It was born between 1137 and 1144 in the rebuilding, by Abbot Suger, of the Royal Abbey Church of Saint-Denis, just outside the city of Paris.&quot; Within decades of its &quot;invention,&quot; the style spread throughout the Capetian domains and by the thirteenth century to all of Europe where it dominated architecture for the next two to three hundred years. Perhaps because Suger's achievements in art and architecture were so extraordinary, they have eclipsed the public's awareness of his crucial role in the growth of the Capetian monarchy and in other aspects of his participation in twelfth-century affairs. As royal advisor, Suger illustrates that superb collaboration between church and state so fundamental to an understanding of the development of the national states of Western Europe. As the essays in this volume devoted to Suger's political activities and historical writings demonstrate, he was, in addition to being a brilliantly innovative patron of architecture, an important architect of the French state. Only by bringing together differing humanistic perspectives on Suger and Saint-Denis has it been possible to achieve, for the first time, a fully rounded appreciation of a man who was, at the same time, a patron of the arts and literature, a politician who adroitly used his ecclesiastical position to enhance the growth and power of the monarchy, and a churchman consistently devoted to the promotion of the cult of Saint-Denis, the patron saint of his abbey and of France.","torrent":{"xt":"urn:btih:5d713201840ddcda456b887cee5b65af283e3227","amp;dn":"Abbot+Suger+and+Saint+Denis+%28Art+Architecture+History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d713201840ddcda456b887cee5b65af283e3227","infoHashBuffer":{"type":"Buffer","data":[93,113,50,1,132,13,220,218,69,107,136,124,238,91,101,175,40,62,50,39]},"announce":[],"urlList":[]}}