{"title":"X-Art.11.07.11.Gabriella.Siempre.En.Mi.Corazon.XXX.1080p.MOV-SEX","uid":8632848,"size":1272846278,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5d94db2a9babb7c7b3f305315f5d0edc632d022e&amp;dn=X-Art.11.07.11.Gabriella.Siempre.En.Mi.Corazon.XXX.1080p.MOV-SEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"novitie1","files":2,"time":1372677477,"description":"Modelpics:  &lt;a href=&quot; http://x-art.com/models/gabriella/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://x-art.com/models/gabriella/&lt;/a&gt;\n\n\n\nRELEASE.......: X-Art.11.07.11.Gabriella.Siempre.En.Mi.Corazon.XXX.1080p.MOV-SEXORS\n\nFORMAT........: MOV\n\nRESOLUTION....: 1920 x 1080\n\nCATEGORY......: Hardcore\n\nMODEL INFO....: Name: Gabriella\n                Age: 20\n                Country: Spain\n\n                Gabriella is a gorgeous 20 year old from Spain. She has a sweet and sunny disposition -\n                the kind of girl you can easily fall in love with. Her favorite pastimes are reading \n                fiction books, drinking red wine and - riding motorcyles! Yes, Gabriella may be sweet, \n                but she has a definite WILD SIDE. Our kind of girl!\n\nDESCRIPTION...: Enjoy this full HD video featuring 20 year-old Spanish beauty Gabriella as she gives \n                herself body, mind and spirit to one very lucky guy!\n\n                When Mr. X first met Gabriella, he says his heart skipped a beat. The two hit it off\n                right away. They spent an entire day together sunbathing naked by the pool, getting \n                to know each other, laughing and having a great time.\n\n                Conversation led to kisses, and the sparks started to fly. Gabriella suggested they\n                head to an open bedroom upstairs, and of course our cameras were their to capture the\n                natural evolution of their summer romance.\n\n                Gabriella dropped her towel and pushed X back onto the bed. They rubbed noses and \n                giggled before sharing a long, slow, romantic kiss. X gently pushed her hair back out\n                of her eyes as Gabriella lowered herself down.\n\n                She wasted no time taking his cock in her mouth. She flicked the head with her tongue, \n                and then swallowed as much as she could. Mr. X was in heaven as he felt the inside of\n                her throat, closing in around him.\n\n                He eagerly returned the favor, circling her clit with his tongue. In his words, she \n                tasted, &quot;So good!&quot;\n\n                He lifted himself up, teasing her pussy with his rock hard cock. Finally she could\n                wait no more. She turned over onto all fours, lifting her pussy high in the air.\n\n                Mr X pressed the tip of his cock into her eagerly awaiting pussy. The wetness invited \n                him in. He filled Gabriella, satisfying her desire to be taken. She could feel the \n                head of his cock rubbing against her G-spot.\n\n                Gabriella climbed on top - the easiest way for her to have an orgasm. She rode him,\n                bucking her hips, pressing her weight down onto her clit. She drew in a big breath \n                just before she came. Her eyes closed instinctively, as if her soul might leave her\n                body when she came if she left them open.\n\n                Although she felt love for Mr. X, Gabriella wasn't ready to get pregnant. So she asked\n                him if he would cum in her mouth.\n\n                &quot;For you, anything&quot; he replied. As she gazed up at him, his cock in her mouth, he came\n                in spurts. Gabriella smiled, the two lovers finally satisfied. \n\nRELEASE DATE..: July 26, 2011\n                                                                                                \nURL...........: http://www.x-art.com\n","torrent":{"xt":"urn:btih:5d94db2a9babb7c7b3f305315f5d0edc632d022e","amp;dn":"X-Art.11.07.11.Gabriella.Siempre.En.Mi.Corazon.XXX.1080p.MOV-SEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d94db2a9babb7c7b3f305315f5d0edc632d022e","infoHashBuffer":{"type":"Buffer","data":[93,148,219,42,155,171,183,199,179,243,5,49,95,93,14,220,99,45,2,46]},"announce":[],"urlList":[]}}