{"title":"Gnomoria v0.8.49","uid":8787343,"size":206376056,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5f13f28e6bfbbbac1f5339b2b20d026b4f6208be&amp;dn=Gnomoria+v0.8.49&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aedziex23","files":-1,"time":1375857673,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies!\n\nKey Features:\n\n- Procedurally generated world - Every game is different\n- Fully destructible environment - Everything can be mined, dug, chopped and rebuilt or used for crafting\n- Open sandbox gameplay - Play how you want - manage a peaceful town or build up military and fend off invasions.\n- Crafting - Tons of items to craft at different workshops\n- Mechanisms - Construct elaborate contraptions using parts like hatches, levers, steam engines\n\nGnomoria v0.8.49\n\nFixed:\n\n- A couple instances in the behavior tree where a gnome tried to do work on a job with a wheelbarrow after it had been canceled, resulting in a crash\n- Crash on load with the personal quarters\n- Gnomes stocking items into a wheelbarrow that was in a stockpile\n- Wheelbarrows not becoming unclaimed if the job was canceled before a gnome picked it up\n- Resource piles (dirt, raw stone, etc) and corpses displaying as the wrong item while held\n- Wheelbarrows and troughs not being listed in stockpile options or when viewing all items\n\nSystem requirements:\n\nOS: Windows XP, Vista, 7, 8\nProcessor: 2.0 GHz\nMemory: 1 GB\nHard Disk Space: 200 MB\nVideo Card: 128 MB Video Memory\nDirectX: 9.0c or Greater\n\nInstallation:\n\n1. Unzip\n2. Place Gnomoria folder anywhere on your drive\n3. PLAY!\n\nXNA Framework 4.0 and .NET Framework 4.0 are included in the _CommonRedist folder. (Install these first)\n\nYou can help the developer and buy the game on steam here: http://store.steampowered.com/app/224500/","torrent":{"xt":"urn:btih:5f13f28e6bfbbbac1f5339b2b20d026b4f6208be","amp;dn":"Gnomoria+v0.8.49","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f13f28e6bfbbbac1f5339b2b20d026b4f6208be","infoHashBuffer":{"type":"Buffer","data":[95,19,242,142,107,251,187,172,31,83,57,178,178,13,2,107,79,98,8,190]},"announce":[],"urlList":[]}}