{"title":"Girl Boy (Evil Angel) XXX DVDRip NEW (2013)","uid":9004419,"size":2002248843,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5f640768cc206b22c2ed87a2fdb1b20fe9411cf7&amp;dn=Girl+Boy+%28Evil+Angel%29+XXX+DVDRip+NEW+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xuluhulu","files":1,"time":1381009329,"description":"Blurring Gender Boundaries Is Fucking Fun!\n\nIn 'Girl/Boy,' creative director/gorgeous performer Dana Vespoli lewdly explores the diverse permutations of 'straight' sex with the kinky twists that are par for this artistic pornographer's course. Four sensuous vignettes showcase strong, intimate hard-core fucking with intriguing variations on gender relations. First, stunning, all-natural Valentina Nappi puts on a seductive private show for a decadent couple - Ramon Nomar and Dana, who's sporting a strap-on. Their nasty anal threesome includes a daisy-chain butt fuck, double-penetration, foot worship and ass-to-mouth cocksucking. The scene climaxes with Valentina squirting her ejaculate into Dana's gaping asshole!\n\nNext, pale, petite brunette pixie Veruca James shares a passion-filled afternoon with androgynous alt-boy Danny Wylde; she rides his prick as she screams in a sweaty orgasm. Strikingly beautiful baby-butch cover girl Jiz Lee is an androgynous model sporting a formal men's suit and a short, dykey haircut. She meets the gaze of suave superstud Manuel Ferrara, and soon the toned, sexy girl is grinding away on his enormous cock and hungrily bobbing her pretty head on his massive meat. In the final scene, Dana plays a brusque, tattooed businesswoman who turns a cold, no-nonsense outcall date with muscular escort Johnny Castle into a fierce, emotional session of intense fucking. The pro leaves his satisfied customer exhausted and splattered with gooey cum. Get ready for a trip into the unexpected - in 'Girl/Boy,' the blurring of gender boundaries is serious fucking fun!\n\nCOVERS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=91311499604280240200.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=91311499604280240200.jpg&lt;/a&gt;\n\n\nTHUMBSNAIL SCREENS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=49569811347078897442.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=49569811347078897442.jpg&lt;/a&gt;\n\n\nCAST:\n\nManuel Ferrara, Ramon Nomar, Johnny Castle, Dana Vespoli, Danny Wylde, Veruca James, Valentina Nappi, Jiz Lee\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:5f640768cc206b22c2ed87a2fdb1b20fe9411cf7","amp;dn":"Girl+Boy+%28Evil+Angel%29+XXX+DVDRip+NEW+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f640768cc206b22c2ed87a2fdb1b20fe9411cf7","infoHashBuffer":{"type":"Buffer","data":[95,100,7,104,204,32,107,34,194,237,135,162,253,177,178,15,233,65,28,247]},"announce":[],"urlList":[]}}