{"title":"Alex Jones Show - 2013 Oct 02 WE [sebaygo1]","uid":8990288,"size":63246408,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6110f64e9baa3fc5a511878a7736f9398c92e618&amp;dn=Alex+Jones+Show+-+2013+Oct+02+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1380766818,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 02 October 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Wednesday, October 2, edition of The Alex Jones Show, Alex brings back former pilot for clandestine CIA flights, Tosh Plumlee, to discuss the Benghazi attack and also his whistle blowing efforts to expose &quot;Guatemalan Guerillas&quot; training at a ranch owned by a Mexican drug lord, which also happened to be a CIA training site where weapons were exchanged for drugs in support of the Contra effort in Nicaragua and Costa Rica. Plumlee, a former undercover pilot, flew into the ranch on several occasions and witnessed the illegal smuggling operation through Mexico into the United States, which was supported by the US Military. \n\nAlex will also discuss the escalating drama of the government shutdown, and Obama's disgusting orders to build more barricades around the WWII Memorial, and arrest Vets who have traveled thousands of miles to visit their Memorial.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:6110f64e9baa3fc5a511878a7736f9398c92e618","amp;dn":"Alex+Jones+Show+-+2013+Oct+02+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6110f64e9baa3fc5a511878a7736f9398c92e618","infoHashBuffer":{"type":"Buffer","data":[97,16,246,78,155,170,63,197,165,17,135,138,119,54,249,57,140,146,230,24]},"announce":[],"urlList":[]}}