{"title":"Cayenne.Loves.Rocco.XXX.DVDRip.x264-SWE6RUS","uid":8896389,"size":2700167200,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:68f60022f64e55ef64863384e4eb4af0ae334ee4&amp;dn=Cayenne.Loves.Rocco.XXX.DVDRip.x264-SWE6RUS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":3,"time":1378712017,"description":"Cayenne Loves Rocco XXX DVDRip x264-SWE6RUS\n\nStarring : Cayenne Klein, Nicoline, Tara White, Vittoria Risi Description : Italian porn legend Rocco Siffredi showcases his latest anal muse, blonde Hungarian beauty Cayenne Klein, in a filth-fest called 'Cayenne Loves Rocco. 'The well-endowed director (and some lucky studs and sluts) found shooting with this adorable ingenue an incredibly intense experience. 'When I decide to do a full movie around one girl, that means I love everything in the girl - the attitude, the body, the way of doing sex,' he explains. 'Cayenne is a stunning, pretty, sexy and perverted girl. Tarra White gives me huge presence ... she loved to fuck Cayenne as much as I did. Tarra loves to fuck Cayenne like a man. 'First, a photo shoot with voluptuous Italian photographer Vittoria Risi turns into a nasty anal three-way with Rocco and Cayenne ... leading to well-stretched buttholes and spermy A kiss! Next, crazy Preacher Mike Chapman Spirits Cayenne away for some religious Twisted Sister Salvation with Tarra, A Super-stacked Nun. In an interracial session of backdoor perversity, Mike's big black cock makes Cayenne and Tarra see God. Next, businessmen Ian Scott and Marcus stuff the ladies' tight assholes with throbbing meat, even stretching Cayenne's holes in a rude double-penetration. Finally, Rocco enlists kinky Mongolian geisha girl Nicoline to join a threesome with black kimono-clad Cayenne. This workout is replete with Asian tradition, not to mention big rectal beads and ass-to-mouth cocksucking. They say that love is best expressed in action, not words. The action of 'Cayenne Loves Rocco' demonstrates one comely, young slut's total erotic devotion!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=qlp5b25mqqzuova65chx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=qlp5b25mqqzuova65chx.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=mgnzea8ehs9ruq1sysd2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=mgnzea8ehs9ruq1sysd2.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:68f60022f64e55ef64863384e4eb4af0ae334ee4","amp;dn":"Cayenne.Loves.Rocco.XXX.DVDRip.x264-SWE6RUS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68f60022f64e55ef64863384e4eb4af0ae334ee4","infoHashBuffer":{"type":"Buffer","data":[104,246,0,34,246,78,85,239,100,134,51,132,228,235,74,240,174,51,78,228]},"announce":[],"urlList":[]}}