{"title":"The Hangover III.hardcore74.720p","uid":8966388,"size":5966057621,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:69f0bc03c72072cc702a65d34f46158db54f0fa4&amp;dn=The+Hangover+III.hardcore74.720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hardcore74","files":3,"time":1380228974,"description":"The Hangover Part III is a 2013 American comedy film produced by Legendary Pictures and distributed by Warner Bros. Pictures. It is the sequel to 2011's The Hangover Part II, and the third and final film in The Hangover trilogy. The film stars Bradley Cooper, Ed Helms, Zach Galifianakis, Justin Bartha, and Ken Jeong. The supporting cast includes: Jeffrey Tambor, Heather Graham, Jamie Chung, Mike Epps and John Goodman with Todd Phillips directing a screenplay written by himself and Craig Mazin. The film follows the &quot;Wolfpack&quot; (Phil, Stu, Doug, and Alan) as they try to get Alan the help he needs after facing a personal crisis. However, things go awry when an incident from the original film comes back to haunt them.\nThe Hangover Part III was announced days before the release of The Hangover Part II and Mazin who co-wrote Part II was brought on board. In January 2012, the principal actors re-signed to star. In March 2012, Warner Bros. announced a U.S. Memorial Weekend release. The supporting roles were cast between June and September 2012. Principal photography began in September 2012 in Los Angeles, California before moving to Nogales, Arizona and Las Vegas, Nevada. The film was released on May 23, 2013. Despite negative reviews, The Hangover Part III had the second biggest worldwide box office opening for an R-rated comedy following The Hangover Part II in 2011.","torrent":{"xt":"urn:btih:69f0bc03c72072cc702a65d34f46158db54f0fa4","amp;dn":"The+Hangover+III.hardcore74.720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69f0bc03c72072cc702a65d34f46158db54f0fa4","infoHashBuffer":{"type":"Buffer","data":[105,240,188,3,199,32,114,204,112,42,101,211,79,70,21,141,181,79,15,164]},"announce":[],"urlList":[]}}