{"title":"Yumemiru yôni nemuritai aka To Sleep so as to Dream (1986)","uid":8796687,"size":734241459,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6a361563d525a4190430eb5f873ba79e56b989dd&amp;dn=Yumemiru+y%26ocirc%3Bni+nemuritai+aka+To+Sleep+so+as+to+Dream+%281986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZGNN","files":-1,"time":1376092441,"description":"'To Sleep,' From Japan, Recalls Detective Serials \n\nBy WALTER GOODMAN \n\n''To Sleep So As to Dream,'' a not-quite silent not-quite mystery in black and white, may be taken as a tribute to, or overextended joke about, those movie buffs who dream of a magical world where reality and illusion merge, where the show goes on forever. This Japanese work, which will be shown at the New York Film Festival today at 4 P.M. and tomorrow at 9:30 P.M., begins with the climactic scene of a 50-year-old serial called ''The Eternal Mystery.'' It is being watched by an elderly woman, and the reel breaks off abruptly just as the hero, The Black Mask, is about to reveal his identity. \n\nCut to the real world, where a couple of young fellows in a detective agency are hired by a representative of that mysterious elderly woman to find the heroine of the serial, the beauteous Bellflower, who, it appears, has been kidnaped by M. Pathe &amp; Co. These honest sleuths are more like the Hardy Boys than like Sam Spade. The elder, Uotsuka, is a real eggomaniac: he gobbles down prodigious quantities of eggs, which must be doing more for his cholesterol level than for his brain cells. His assistant, Kobayashi, proves to be a master of the martial arts. \n\nThe trail leads to such exotic spots as the General Jintan Tower, the Flower Star Wheel, the Moon Island Shrine and finally the Electric House, where the M. Pathe Co. is presenting ''The Eternal Mystery.'' The boys are dogged. ''Could it be a trap?'' they ask each other. ''There should be a clue around here,'' they agree. When they finally catch sight of Bellflower (or is it just a celluloid vision?), she pleads with them, ''Save me from this endless story.'' To do that, of course, Uotsuka, has to take his part in ''The Eternal Mystery.'' \n\nThis movie with the ungainly title is the first by Kaizo Hayashi, who, at age 29, is too young to have grown up with the shows that he kids or celebrates here. Yet he has a good feel as well as good feelings for the old favorites; he catches the energetic artificiality, the bloodless derring-do of yesteryear's flickering flicks in which the hero would slash at the air and the villain would hit the dust. He also gives us several amusing moments as Uotsuka and Kobayashi go sleuthing, especially their encounter with a trio of elegant magicians and a spoof of a chase scene in which the good guys make the mistake of catching up with the bad guys. And after watching nearly 90 minutes of detective work with no detection, the audience may join Mr. Hayashi in his appreciation of the moviemakers who used to turn this stuff out in 15-minute segments.\n\nPLEASE SEED AT LEAST AS MUCH AS YOU DOWNLOAD SO THIS TORRENT WILL NEVER DIE, THANK YOU :)","torrent":{"xt":"urn:btih:6a361563d525a4190430eb5f873ba79e56b989dd","amp;dn":"Yumemiru+y%26ocirc%3Bni+nemuritai+aka+To+Sleep+so+as+to+Dream+%281986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a361563d525a4190430eb5f873ba79e56b989dd","infoHashBuffer":{"type":"Buffer","data":[106,54,21,99,213,37,164,25,4,48,235,95,135,59,167,158,86,185,137,221]},"announce":[],"urlList":[]}}