{"title":"Peeppa - Personal email encryption privacy protection applicatio","uid":8921919,"size":13840884,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6d43200f35bf5b5da1580521bde626ee3bba4a06&amp;dn=Peeppa+-+Personal+email+encryption+privacy+protection+applicatio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BertieBooster","files":1,"time":1379273595,"description":"Peeppa - Personal email encryption privacy protection application.\n\n\nGreat little program for keeping your online stuff safe from snoopers such as Google, Facebook, Microsoft, NSA, Prism, Yahoo and all the others who steal your data through their online services.does a whole heap more than just protect your emails.\n\nUnlike most other encryption software you do not haveto be a Crypotgrapher to use this, just copy and paste text between your regular applications, chat s and social networks sites.....\n\nJust type or paste anything you want into the app and it will encrypt it to a very high level (believe it is a full 256 AES algorithm used for encryption) that is military standard security in the US.\nEasily use the encrypted text in almost all email and chat applications just paste into outlook, hotmail, gmail facebook etc the app automatically copies encrypted and decrypted messages to your clipboard.\n\nWorks in a variety  of languages.\n\nChoose encryption level\n\nChoose your encryption key or let the app generate one for you.\n\nDont be fooled by its simplicity this is a very very poweful piece of software.\n\n\n\nTo install.\n\n1) Open and install the setup file.\n\n2) Start the trial period, on the registration screen you will see a &quot;Hardware ID&quot; number. Make a note of this you will need it to get your serial.\n\n3) Go to this web page http://www.flashbytes.co.uk/index.php/activate and choose the licence type, enter the hardware ID the program generated,any email address and Cw2JMz0L as the purchase ID number. The site will generate a serial number for you.\n\n4) Restart the app and use these three numbers (HWID, purchase ID and serial) to MANUALLY activate the programme.\n\n5) If it doesnt work make sure you selected the right type of licence ie business or personal (it makes a difference).\n\n6) Enjoy your privacy.\n\n\n","torrent":{"xt":"urn:btih:6d43200f35bf5b5da1580521bde626ee3bba4a06","amp;dn":"Peeppa+-+Personal+email+encryption+privacy+protection+applicatio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d43200f35bf5b5da1580521bde626ee3bba4a06","infoHashBuffer":{"type":"Buffer","data":[109,67,32,15,53,191,91,93,161,88,5,33,189,230,38,238,59,186,74,6]},"announce":[],"urlList":[]}}