{"title":"Stossel.2013.06.27.[Big Brother].Fox Business.CF.avi","uid":8627678,"size":313112996,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6d60a28c63a9a5eb7b406b0b97388dfcf796e724&amp;dn=Stossel.2013.06.27.%5BBig+Brother%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1372551245,"description":"----------\n\nSTOSSEL - [Big Brother] - Fox Business Network\n2013, June 27, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\n65 years ago, the novel 1984 suggested the future would bring government spying through telescreens that were even in bedrooms. Big brother would be watching.\n\nSome believe recent revelations about the NSA tracks on our phone calls, and some emails, mark the start of that. Michigan Congressman Justin Amash says the NSA's actions are a threat to liberty.\n\nKansas Congressman Mike Pompeo supports NSA spying.\n\nI've taken heat from libertarians because I'm sympathetic to the congressman's arguments. I'm not yet angry about data mining for two reasons:\n\n1. It might prevent terrorism\n\n2. I can think of at least 100 other things that government does that enrage me as much, or more.\n\nJudge Andrew Napolitano tries to educate me on why I should be much more upset about the NSA.\n\nThe IRS bias against conservative groups... that's a scandal clearly worth getting angry about. Brooke Rollins runs the Texas Public Policy Foundation, one group that was targeted.\n\nIncreasingly, surveillance cameras watch us. Sheriff Russ Martin says the loss of privacy is worth it; we are safer because of cameras. But Ginger McCall from the Electronic Privacy Information Center says the cameras threaten our freedom of movement, and don't even work.\n\nPeople say &quot; if you're not doing anything wrong, you have nothing to worry about.&quot; But Oregon lawyer, Brandon Mayfield did nothing wrong. He spent two weeks in jail because he was mistakenly caught up in a terrorism investigation.","torrent":{"xt":"urn:btih:6d60a28c63a9a5eb7b406b0b97388dfcf796e724","amp;dn":"Stossel.2013.06.27.%5BBig+Brother%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d60a28c63a9a5eb7b406b0b97388dfcf796e724","infoHashBuffer":{"type":"Buffer","data":[109,96,162,140,99,169,165,235,123,64,107,11,151,56,141,252,247,150,231,36]},"announce":[],"urlList":[]}}