{"title":"Facesitting.Tales.2.XXX.DVDRip","uid":8910528,"size":1651784752,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6e2092a70ba07cd347b87bc8591ad331b4e2aabf&amp;dn=Facesitting.Tales.2.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1379009441,"description":"Category Fetish, FemDom, Smothering\n\n Director Glenn King\n Starring Brooke Haven, Tara Lynn Foxx, Tory Lane, Tom Byron, Bonnie Rotten, Gabriella Paltrova, Zoey Monroe, Glenn King, Jeremy Conway, Flynt Dominic\n\n Fetish company MeanBitch Productions has carved out a porn niche that caters to the worship of dominant goddesses and their big, powerful asses. 'FaceSitting Tales #2' is a collection of fantasy vignettes suggested by viewers - four breathtaking episodes of butt-smothering female superiority. The pathetic dudes here get their faces and spirits crushed by the cruel kind of ladies that like putting males in their proper place - groveling under a masterful female ass. When boss Tom Byron returns to work, he discovers that his unstable secretary, Tara Lynn Foxx, has been abusing all the employees. Little does he realize ... he's next in line for Tara Lynn's sick games of foot submission and asshole licking!\n\n Busty, tattooed, fishnet-clad teenage dominatrix Bonnie Rotten takes a break from paddling Jeremy Conway, her wimpy client. She exposes his secret perversions to his wife, Zoey Monroe. The evil domme makes the couple crawl, tongue her puckered anus and suck on Bonnie's manicured feet. After discovering his collection of kinky porn, foxy office bitch Gabriella Paltrova decides to make co-worker Flynt Dominic into her human chair. Finally, harsh mistress Tory Lane makes her slave wear a sign declaring him to be her property; the big-boobed dungeon ruler torments him with her muscular buns and toys with his dick using her bare feet. Each of these nasty tales climaxes with a pitiful male loser receiving the mercy of a happy-ending hand job. 'FaceSitting Tales #2' is feminine supremacy at its most irresistibly cruel.\n\n\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=44492949564202929417.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=44492949564202929417.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=45192232311304508967.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=45192232311304508967.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:6e2092a70ba07cd347b87bc8591ad331b4e2aabf","amp;dn":"Facesitting.Tales.2.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2092a70ba07cd347b87bc8591ad331b4e2aabf","infoHashBuffer":{"type":"Buffer","data":[110,32,146,167,11,160,124,211,71,184,123,200,89,26,211,49,180,226,170,191]},"announce":[],"urlList":[]}}