{"title":"MomsBangTeens - India Summer, Lola Foxx (Lusty Exchange)","uid":8979784,"size":462286930,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6f3da7bdcf1e86a1af0cfb3039de261705abebf7&amp;dn=MomsBangTeens+-+India+Summer%2C+Lola+Foxx+%28Lusty+Exchange%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"codho","files":-1,"time":1380532513,"description":"Lola has gotten extremely close to her stepmother, India, while her father has been away on business. Today they're out in the pool and the subject of Lola's new boyfriend, Xander, comes up. Lola's only complaint is that he doesn't seem to satisfy her sexually anymore. She goes on to say that this is most probably the result of how well India eats her pussy. This gets India's juices flowing. She presses her fit and sexy body against Lola's firm, young breasts. The two kiss passionately rubbing each other's tits and pussies. India proceeds to go down and get a mouthful of Lola's creamy cooch. Xander unexpectedly stops by and is shocked by the scene he observes. He confronts Lola and India takes action. She grabs Xander by the shirt and tells him that her step-daughter deserves to be satisfied and she's gonna show him how to do it. This aggressiveness turns Xander on and he follows Indias orders, no questions asked. She walks him through eating pussy properly and Xander excels in learning. The two girls decide to reward him with some cock sucking and plenty of fucking. Feeling content that Xander knows what has to be done now, and having both came themselves, they hungrily drink in his cum as it covers their faces.\n\n\nScreenshot :\n &lt;a href=&quot;\nhttp://bayimg.com/caaaiaAFE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/caaaiaAFE&lt;/a&gt;","torrent":{"xt":"urn:btih:6f3da7bdcf1e86a1af0cfb3039de261705abebf7","amp;dn":"MomsBangTeens+-+India+Summer%2C+Lola+Foxx+%28Lusty+Exchange%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3da7bdcf1e86a1af0cfb3039de261705abebf7","infoHashBuffer":{"type":"Buffer","data":[111,61,167,189,207,30,134,161,175,12,251,48,57,222,38,23,5,171,235,247]},"announce":[],"urlList":[]}}