{"title":"Alex Jones Show - 2013 Jul 08 MO [sebaygo1]","uid":8661667,"size":71188992,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6fc399ae8fbe34e06348c6f93439f06bb3c666ba&amp;dn=Alex+Jones+Show+-+2013+Jul+08+MO+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1373326775,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nMonday, 08 July 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: Alex exposes scandal-driven federal agencies on this Monday, July 8 transmission of The Alex Jones Show. Alex speaks with Larry Pratt, executive director of Gun Owners of America about the ATF pressuring and arming people to rob fictitious drug &quot;stash houses&quot; in sting operations as well as the latest on Operation Fast and Furious. This ATF gunwalking scandal claimed another life over the weekend as a drug cartel member gunned down a Mexican police chief with a rifle lost by the agency. \n\nAlex also examines yet another federal agency scandal: the TSA groped, screened, and interviewed the panicking family members of Asiana Airlines Flight 214 crash victims who had no idea whether their loved ones were still alive. The TSA stood in the way of their reunions for up to five hours. \n\nAlex also speaks with radio host Adam Kokesh who recently loaded a 12 gauge shotgun in Freedom Plaza near the White House during his D.C. open carry protest on the 4th of July.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:6fc399ae8fbe34e06348c6f93439f06bb3c666ba","amp;dn":"Alex+Jones+Show+-+2013+Jul+08+MO+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fc399ae8fbe34e06348c6f93439f06bb3c666ba","infoHashBuffer":{"type":"Buffer","data":[111,195,153,174,143,190,52,224,99,72,198,249,52,57,240,107,179,198,102,186]},"announce":[],"urlList":[]}}