{"title":"Son Frere by Patrice Chereau.avi","uid":8630252,"size":1691469496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6ff479b4477d23884015e058997ca6ef28f547d5&amp;dn=Son+Frere+by+Patrice+Chereau.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"athak","files":1,"time":1372616276,"description":"Format                                   : AVI\nFormat/Info                              : Audio Video Interleave\nFormat profile                           : OpenDML\nFile size                                : 1.58 GiB\nDuration                                 : 1h 28mn\nSON FRERE (His Brother)\nReviewed by: Harvey S. Karten Grade: B Strand Releasing Directed by: Patrice Chereau Written by: Patrice Chereau, novel by Philippe Besson Cast: Bruno Todeschini, Eric Caravaca, Nathalie Boutefeu, Maurice Garrel, Catherine Ferran, Antoinette Moya, Sylvain Jacques, Fred Ulysse, Robinson Stevenin Screened at: Review 2, NYC, 3/17/04\n\nThe Greek philosopher Theognis said in his &quot;Elegies,&quot; &quot;The best of all things for earthly men is not to be born,&quot; and if Theognis saw Patrice Chereau's &quot;Son Frere&quot; which he adapted from Philippe Besson's novel, his view would be unchanged. A quick, sudden death many years after the biblically allotted three-score and ten is desirable. Unfortunately for most people, the grim reaper takes his time, leaving most of us to take final leave after long illnesses. Chereau, whose &quot;Intimacy&quot; three years back deals with an arrangement between a man and a woman to have brutal, anonymous sex without small talk, may be more crowd-pleasing than his new picture, &quot;Son Frere&quot; (&quot;His brother&quot;), but if we want to get more than an inkling of what it's like to die slowly, to lose the will to fight, to suffer, than &quot;Son Frere&quot; is the picture du jour.\n\nThere is a bright side to the happenings on the screen, since a pair of estranged brothers, one gay and the other straight, get to know each other, to bond, to come across when the chips are down. On the other hand, the picture could have been directed by Mel Gibson, given not only the hopelessness and helplessness of the hapless sib, graphically illustrated in the real-time scene of nurses preparing the fellow for major surgery by shaving his armpits, his chest, and the lower regions--though for removal of a spleen, one wonders what's wrong with hairy armpits.\n\nChereau shifts backwards and forwards from a depressing apartment in Paris to equally somber summer scenes on a Brittany beach, to explore the crisis-driven feelings of Thomas (Bruno Todeschini) and his younger, gay brother, Luc (Eric Caravaca). Thomas is losing platelets rapidly. The doctors don't know why. (My view is that he is suffering from idiopathic thrombocytopenic purpura, but that's another story.) Because untreated, Thomas could die of a hemorrhage, he is frequently hospitalized, where he is poked and prodded, carved and IV'd, all of which leads to a reconciliation of Thomas with the regularly-visiting Luc. At the same time, the illness causes a split between Thomas and his father (Fred Ulysse) and girlfriend, Claire (Nathalie Boutefeu), while the stress leads to a breakup between Luc and his boyfriend, Vincent (Sylvain Jacques).\n\nThe film is French, which means that there's a great deal of talking, some in anger as Thomas's father callously shouts that Luc should have had the disease instead (nominally because Luc is the &quot;stronger&quot; person who'd fight harder, the subtext being that daddy does not like the idea of having a gay son).\n\n&quot;Son Frere&quot; is more austere than any of Hollywood's of television's disease-of-the-week dramas, avoiding the stylizing that most directors would use to keep the action moving. Chereau is hellbent on giving the audience a less prettified commentary about the downside of life, spare even in the use of music (there's but one song, Marianne Faithful's &quot;Sleep,&quot; which is in English and is repeated once).\n\nMost adults today have experienced repercussions from life- and-death tragedies affecting their loved ones, whether the illnesses draw them closer or pull them apart. For those who have avoided such dilemmas, &quot;Son Frere&quot; will afford a modicum of insight.","torrent":{"xt":"urn:btih:6ff479b4477d23884015e058997ca6ef28f547d5","amp;dn":"Son+Frere+by+Patrice+Chereau.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ff479b4477d23884015e058997ca6ef28f547d5","infoHashBuffer":{"type":"Buffer","data":[111,244,121,180,71,125,35,136,64,21,224,88,153,124,166,239,40,245,71,213]},"announce":[],"urlList":[]}}