{"title":"Game Pack 4 - LastEnd Games (9-2013)","uid":8844876,"size":41442318,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:70dc50c34e9ce072f52fd55036bd27652840aecd&amp;dn=Game+Pack+4+-+LastEnd+Games+%289-2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LastEnd","files":-1,"time":1377352194,"description":"Casino Slots \nTry your luck at slot machines in this 3D environment. Casino Slots has Random Number Generators (RNG) which are continually generating so the game play is always changing. This is a nice way to try out your luck on slot machines without using real money. \n\nMaze - Unsafe Mine \nThe goal in Maze Unsafe Mine is to get past a level before the timer runs out and try to get as many points as you can. This version has ten levels each getting harder as you go. Remember to get the lights. You can control the game 2 ways. 1. Using the keyboard [W,S,A,D] keys and the mouse. 2. Uses a Xbox 360 controller. \n\nLucky Farm \nMatch cards before the timer runs out and don't waste to many remaining turns. This game is a great way to test your kids memory speed and recall limits as they have fun matching cows, pigs, and other animals in 20 levels that change each time the game is played. \n\nManic Matching \nMatch cards before the timer runs out and don't waste to many turns. This game is a great way to test your memory speed and recall limits.\n\nBlackjack\nLastEnd Blackjack features an online high scoreboard that allow you to compare your skills against other players from around the world. So come see if your the best by downloading our free Blackjack video game software using the download button located on this page.\n","torrent":{"xt":"urn:btih:70dc50c34e9ce072f52fd55036bd27652840aecd","amp;dn":"Game+Pack+4+-+LastEnd+Games+%289-2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70dc50c34e9ce072f52fd55036bd27652840aecd","infoHashBuffer":{"type":"Buffer","data":[112,220,80,195,78,156,224,114,245,47,213,80,54,189,39,101,40,64,174,205]},"announce":[],"urlList":[]}}