{"title":"Black Faith - Jubilate Diabolo (2013)","uid":8894120,"size":82086140,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:712a4f63817ffe005ab7df10a5c47a39d266f161&amp;dn=Black+Faith+-+Jubilate+Diabolo+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Baphom3t","files":9,"time":1378657773,"description":"February 2004 - Black Faith borns. First line up was: Snarl V.R.J., Vocals/Guitars, Fabio Notarfranco (Guitar), Tiphereth (Bass), Tamoth (Drums). In late 2004 they begin to write down proper songs.\n\n2005 - Live debut. This gig's line up: Snarl V.R.J. (Vocals/Guitars), Tiphereth (Bass), Tamoth (Drums). After this gig Melqart (Later known as Malebolgia) enter at guitar, LucasDemon enters at drums.\n\n2006 - First demo &quot;Proclaim my victory&quot; is out.\n\n2007 - After some gigs, only Snarl and LucasDemon remain. Black Faith uses this period to compose a lot.\n\n2008 - Kjiel enters in the Line up as 2nd Guitar player and Melan Nefos Thanatos join the bass player role. Black Faith hits back the stage.\n\n2009 - Line up: Snarl (Vocals, Guitars, Bass), Kjiel (Guitar), Hyakrisht (Drums): with this line up Black Faith records in August a cover version of the classic Darkthrone's &quot;Under a Funeral Moon&quot; song for the &quot;Italian Tribute to Darkthrone&quot;, that will be out via Novecento Produzioni. Kjiel goes abroad and is replaced by Funestum.\n\n2010 - A 6-tracks Promo Cd (5 Brand new songs + 2 &quot;Full length only&quot; songs + 1 Darkthrone's cover version of &quot;Under a Funeral moon&quot; only for the promo) is recorded,mixed and mastered in the Hybrid Recording Studios (Lanciano (CH)), with Simone di Cicco. Line up: Snarl (Vocals, Guitars, Bass), Funestum (Guitar), Hyakrisht (Drums).\n\n2011 - In may Black Faith enter into their own rehearsal room and records 3 brand new songs for a Split cd.. This release stands as a tribute to the 80's metal, showing a Black Metal style with lots of Rock, Thrash and Heavy Metal influences.After this Funestum is out of the band and gets replaced by Vinterblot.\n\nCurrent lineup:\nSNARL - Vocals/Lead Guitars\nACHERON - Bass/Choirs\nHYAKRISHT - Drums\nVINTERBLOT - Rhythm Guitar","torrent":{"xt":"urn:btih:712a4f63817ffe005ab7df10a5c47a39d266f161","amp;dn":"Black+Faith+-+Jubilate+Diabolo+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"712a4f63817ffe005ab7df10a5c47a39d266f161","infoHashBuffer":{"type":"Buffer","data":[113,42,79,99,129,127,254,0,90,183,223,16,165,196,122,57,210,102,241,97]},"announce":[],"urlList":[]}}