{"title":"VNC Viewer v1.2.5.108866 [Satfoun] {AMRG}","uid":8779053,"size":4805901,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:76b89430b02c390fc1b45a8e1507683bc4f4651e&amp;dn=VNC+Viewer+v1.2.5.108866+%5BSatfoun%5D+%7BAMRG%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Satfoun","files":1,"time":1375635409,"description":"Required Android O/S : 2.1+\n\nVNCÂ® Viewer connects your device to a computer anywhere in the world, displays its desktop, and lets you take control. You can run applications, change settings, and access data exactly as you would be permitted to do were you sitting in front of that computer, and using the keyboard and mouse.\n\nVNC Viewer is from RealVNC, the inventor of VNC technology. It can connect to any Windows, Mac OS X, Linux, or UNIX computer running VNC-compatible Server technology. RealVNC recommends VNC 5 for robust, secure, and high-performance connections, and for its unrivalled flexibility; free and trial licenses are available. For more information, visit www.realvnc.com.\n\nSummary\nDownload VNC Viewer.\nObtain and start VNC-compatible Server technology for the computer you want to control, for example VNC 5.\nIf you are connecting over the Internet (for example, via 3G), configure firewalls and routers protecting the computer to allow and forward network communications to it. Start with www.realvnc.com/products/android/1.2 for more information. If you are connecting over a Wi-Fi-enabled private network such as a LAN or VPN, you should be able to connect without further configuration.\nFind out the network address of the computer. If you are connecting over the Internet, this will probably be that of a router. You will also need a port number if the VNC-compatible Server is listening on a port other than the default for VNC, 5900.\nStart VNC Viewer, identify the computer you want to control, and connect!\nFeatures:\nInteract with your computer as though sitting in front of it.\nGive connections user-friendly names, and see desktop previews.\nPinch to zoom in to a specific area, or out to see the whole picture.\nEasy navigation, scrolling, dragging, and selection using standard touch, tap, and drag gestures.\nMouse button mode for precise control over mouse button and scrolling operations.\nEasy text entry using on-screen keyboard with preview.\nImportant non-character keyboard keys (function, modifier, and so on) available on a scrolling key bar.\nAutomatic performance optimization.\nSupport for screen resolutions up to 5120 by 2400 pixels (though the actual resolution is limited only by the memory of your device).\nUsers connecting to VNC 5 with a Personal or an Enterprise license also enjoy the following significant benefits:\nConnections encrypted using up to 256-bit AES technology.\nAuthentication credentials protected by 2048-bit RSA public keys.\nSystem authentication to connect using computer log on credentials.\nEnhanced performance.\nSupport for non-US keyboards.\nTransfer text between applications on your computer and device.\nVNC 5 is available for a wide range of Windows, Mac OS X, Linux, and UNIX computers. For more information, visit www.realvnc.com/products/vnc.\n\nConnectivity:\nVNC Viewer can establish standard (insecure) connections to:\nVNC 5.x with a Free license, from RealVNC.\nMac OS X 10.4 or later with built-in Apple Remote Desktop/Screen Sharing enabled (System Preferences &gt; Sharing). Note this does not apply to PowerPC Macs running 10.4 (Tiger); install VNC-compatible Server technology instead.\nAMX touch panels.\nThird-party VNC-compatible Servers.\nVNC Viewer can establish secure (authenticated and encrypted) connections to:\nVNC 5.x with a Personal or an Enterprise license, from RealVNC. 30 day trials are available.\nLegacy VNC Enterprise Edition 4.x, from RealVNC.\nLegacy VNC Personal Edition 4.x, from RealVNC.\nWhat's in this version : (Updated : Apr 30, 2013)\nImproved keyboard support for manufacturers' virtual keyboards, including gesture typing, and for the SwiftKey third-party keyboard app.\nImproved user interface for small tablet devices\n\n\n &lt;a href=&quot;\nhttp://kickass.to/vnc-viewer-v1-2-5-108866-satfoun-amrg-apk-t7695681.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kickass.to/vnc-viewer-v1-2-5-108866-satfoun-amrg-apk-t7695681.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:76b89430b02c390fc1b45a8e1507683bc4f4651e","amp;dn":"VNC+Viewer+v1.2.5.108866+%5BSatfoun%5D+%7BAMRG%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76b89430b02c390fc1b45a8e1507683bc4f4651e","infoHashBuffer":{"type":"Buffer","data":[118,184,148,48,176,44,57,15,193,180,90,142,21,7,104,59,196,244,101,30]},"announce":[],"urlList":[]}}