{"title":"Milf.Mania.XXX.DVDRip.x264-CHiKANi","uid":9007967,"size":3374605419,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:799605c3f2f20bb9219ec220459f14a65d1b86b3&amp;dn=Milf.Mania.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1381071288,"description":"Milf.Mania.XXX.DVDRip.x264-CHiKANi\n\nKora Peters, Mellanie Monroe, Payton Leigh, Vannah Sterling, Devon Lee, James Deen, Mr. Pete, Brian Street Team.\n\nMILF Mania!: If you're anything like porn superstud James Deen, you appreciate the sexual adventurousness of an experienced lady. The handsome director's new 'MILF Mania!!!!' is a five-scene showcase of those beautiful broads who'll do anything for a younger man's hard-on. These luscious MILFs are right in their erotic prime, old enough to know what they like and young enough to want more! James is completely captivated by older hussy Kora Peters, a slender, seductive married lady. The petite slut gets her asshole well stuffed until he spurts goo into her gaping sphincter. Phat-assed blonde Mellanie Monroe sucks the director's throbbing boner and gets a special treat when horny stud Mr. Pete arrives to plow the hot blonde's juicy pussy!\n\nPayton Leigh wants to satisfy her husband's anal needs, so she requests some proper butthole training. By the time James is easing his shaft up Payton's rectum, she's in the throes of an intense anal orgasm. Busty, 38-year-old Vannah Sterling is a gorgeous brunette with a big, meaty booty and huge, firm titties. This Greek-American beauty slides Brian Street Team's meat inside her thick, juicy ass. And delicious bombshell Devon Lee can't wait to hustle her husband off to work before James comes over to passionately sodomize the adulterous MILF and splatter her enormous boobs with cum. There's also 18 minutes of revealing behind-the-scenes interview footage and outtakes. For first-class cougars that love to play filthy, get ready to rumble with 'MILF Mania!!!!'\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2013puzeuc0rk9gdynfy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2013puzeuc0rk9gdynfy.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=e1hutp9ettqqylkc5eu9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=e1hutp9ettqqylkc5eu9.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:799605c3f2f20bb9219ec220459f14a65d1b86b3","amp;dn":"Milf.Mania.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"799605c3f2f20bb9219ec220459f14a65d1b86b3","infoHashBuffer":{"type":"Buffer","data":[121,150,5,195,242,242,11,185,33,158,194,32,69,159,20,166,93,27,134,179]},"announce":[],"urlList":[]}}