{"title":"Alex Jones Show - 2013 Oct 10 TH [sebaygo1]","uid":9030723,"size":63016277,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:847959812d0c6adc9bcbae3ea87410e9c6bc3854&amp;dn=Alex+Jones+Show+-+2013+Oct+10+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":11,"time":1381447377,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 10 October 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Thursday, October 10 edition of The Alex Jones Show, Alex and Infowars Nightly News host David Knight examine the complete failure of Obamacare. The healthcare.gov web site, which doesn't even work, cost taxpayers $634 million. The White House knew about the problems but still insisted on the Oct. 1 rollout. Regardless, Obamacare is too expensive for Americans with lower incomes and credit scores. \n\nEverett Stern, a bank whistleblower, joins the show to discuss the allegations that HSBC, an international bank, financed criminals, drug cartels and terrorists. Back in March, Attorney General Eric Holder declined to prosecute HSBC for money laundering, implying that the bank was &quot;too big to jail.&quot; \n\nAnthony Gucciardi also joins the show to provide updates on the Fukushima radiation crisis.\n\nAlex participates in the first 30 minutes of the show. David Knight hosts the rest.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:847959812d0c6adc9bcbae3ea87410e9c6bc3854","amp;dn":"Alex+Jones+Show+-+2013+Oct+10+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"847959812d0c6adc9bcbae3ea87410e9c6bc3854","infoHashBuffer":{"type":"Buffer","data":[132,121,89,129,45,12,106,220,155,203,174,62,168,116,16,233,198,188,56,84]},"announce":[],"urlList":[]}}