{"title":"POtHS - Creation - 74 - Icons of Evolution","uid":9016767,"size":5010245813,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:866ac62400e6f799e0bfec31c305e51620ac0a50&amp;dn=POtHS+-+Creation+-+74+-+Icons+of+Evolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1381204708,"description":" POtHS - E V I L - U T I O N - School Your Professor on The Facts\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&lt;/a&gt;\n &lt;a href=&quot;\nhttp://conspiracyhub.com/details_resource.php?it=10031&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyhub.com/details_resource.php?it=10031&lt;/a&gt;\n\n\n\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\n\n\nPOtHS - Creation - 74 - Icons of Evolution\n\n\nPOtHS Comment: DID YOU KNOW that 89% of self-proclaiming Christians think all you have to do to get to Heaven is get Water Baptized and do &quot;Good Deeds&quot; These are The Christians the will be left behind to loose their Heads in FEMA Guillotines. That is The Part that THEY DIDN&quot;T get right. To get Jesus now scroll down the Page. It is just a couple things you need to do and you can do it alone in your Room right now. Time is Short Friends.\n\nDescription:\n\n\nTitle: Icons of Evolution\nReleased: 2002\nIMDB: http://www.imdb.com/title/tt1712181/\n\nSource: Library DVD\n\nDuration:\nMain Feature: 52 mins\nSpecial Edition Extras: 24 mins\n\nRipped with: Handbrake 0.94\n\nVIDEO:\nResolution: 720 x 544 px,\nAspect Ratio: 4:3\nFramerate: 29.97 fps\nVideo Codec: H.264 (x264)\nConstant Quality 50% RF:25.5\nDeinterlace: slower\n\nAUDIO\nAudio Codec: AAC (faac)\nBitrate: 128 kb/s\nSamplerate: 48 kHz\nChannels: Stereo\n\n\nProduct Description\n-==================\nAre students learning the whole truth about Darwin's theory of evolution?\n\nAccording to a growing number of scientists, the suprising answer is no. They claim that many of the most famous &quot;Icons of Evolution&quot;-including Darwin's &quot;Tree of Life,&quot; finches from the Galapagos Islands, and embryos that look remarkably similar-are based on outdated research and sloppy logic. They say students are being hurt by the failure to present both sides of an emerging scientific debate over Darwin's theory.\n\nCome explore this fascinating new conflict over evolution in the classroom-a conflict based on science, not religion. Learn about the controversy that engulfs one town when a teacher actually tries to tell students that some scientists disagree with Darwin.\n\nFrom the Galapagos Islands to China, Icons of Evolution will take you on a fast-paced, fascinating journey into one of the most contoversial issues in today's public arena.\n\n\nReview\n===============\n&quot;True science and freedom of thought are inseparable, but as this video shows, some scientists prefer power to truth.&quot;\n- Philip E. Johnson, author of Darwin on Trial\n\nReviews of book: &lt;a href=&quot;\nhttp://www.iconsofevolution.com/reviews&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.iconsofevolution.com/reviews&lt;/a&gt;\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:866ac62400e6f799e0bfec31c305e51620ac0a50","amp;dn":"POtHS+-+Creation+-+74+-+Icons+of+Evolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866ac62400e6f799e0bfec31c305e51620ac0a50","infoHashBuffer":{"type":"Buffer","data":[134,106,198,36,0,230,247,153,224,191,236,49,195,5,229,22,32,172,10,80]},"announce":[],"urlList":[]}}