{"title":"Two books by Carol O'Connell","uid":8830165,"size":1061609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87ffe7808fc777f304a97854bfaadabb9d575ed0&amp;dn=Two+books+by+Carol+O%27Connell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":2,"time":1376950201,"description":"Bone By Bone\nIn the northern California town of Coventry, two teenage brothers go into the woods one day, but only one comes back. No one knows what happened to the younger brother, Josh, until twenty years later, when the older brother, Oren, now an ex-investigator for the Army CID, returns to Coventry for the first time in many years. His first morning back, he hears a thump on the front porch. Lying in front of the door is a human jawbone, the teeth still intact. And it is not the first such object, his father tells him. Other remains have been left there as well. Josh is coming home . . . bone by bone.\n\nUsing all his investigative skills, Oren sets out to solve the mystery of his brother's murder, but Coventry is a town full of secrets and secret-keepers: the housekeeper with the fugitive past, the deputy with the old grudge, the reclusive ex-cop from L.A., the woman with the title of town monster, and, not least of all, Oren himself. But the greatest secret of all belonged to his brother, andit is only by unraveling it that Oren can begin to discover the truth that has haunted them all for twenty years.\n\nJudas Child\nThe disappearance of two children from a New York suburb is a chilling reminder of 15 years before when Detective Rouge Kendall's twin sister vanished at the hands of a sadistic predator. It's an omen of something terrible to come.","torrent":{"xt":"urn:btih:87ffe7808fc777f304a97854bfaadabb9d575ed0","amp;dn":"Two+books+by+Carol+O%27Connell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ffe7808fc777f304a97854bfaadabb9d575ed0","infoHashBuffer":{"type":"Buffer","data":[135,255,231,128,143,199,119,243,4,169,120,84,191,170,218,187,157,87,94,208]},"announce":[],"urlList":[]}}