{"title":"Lightning Browser + v2.5.0.2[Satfoun]{AMRG}","uid":8778675,"size":127470,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:884461b2a3d44721efda503d78d7806e3c4f7729&amp;dn=Lightning+Browser+%2B+v2.5.0.2%5BSatfoun%5D%7BAMRG%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Satfoun","files":1,"time":1375625716,"description":"Required Android O/S : 2.1+\n\nLux isn't your ordinary brightness app. It intelligently adjusts the brightness of your display based on the environment you're in. If, for example, you step into a dimly lit room, Lux will automatically lower the brightness of your display to make it not only comfortable to read, but to also preserve battery power.\n\nLux provides the option to automatically adjust the backlight at fixed intervals (periodic mode), when a change in environment is detected (dynamic mode), or when the phone wakes from sleep. It's also possible to adjust the backlight manually. Simply disable automatic mode and you can use it like a traditional brightness tool!\n\nPerhaps the best thing about Lux is that you can teach it how to behave. If the backlight is too bright or dim for your liking, simply open the provided Dashboard, adjust the brightness slider to the level you desire, then hold the link button. Lux will use this new 'link' as a reference in future.\n\nGive it a go! I want you to test Lux for more than the 15 minute refund period offered by Google. I understand that some devices may not have the best quality light sensor, and that you may need more time to play around with settings. If you find that Lux doesn't suit you after the 15 minutes is up, you can request a refund at any time via e-mail - no questions asked.\n\nDO NOT request features, report bugs, or ask for assistance in your review. I can't reply to them! Please e-mail me instead.\n\nFeatures:\nCustom auto brightness.\nSub-zero brightness to make reading in the dark significantly less irritating.\nBattery efficient\nHandy brightness widget\nOption to use the camera to read in ambient light.\nPower-user settings such as choice of interpolation, sensor debugging, and linked sample editing.\nBackup to SD.\nCustomisable data filtering for phones with inaccurate light sensors.\nGradual fade effect for backlight adjustments.\nAstronomer mode adds a red filter to the screen to preserve the eyesight of stargazers.\nJitter control to prevent constant small changes to the backlight.\nNight mode, to change the colour temperature of the display for comfortable night time viewing.\nAdd app specific exceptions via compatibility mode\nNo ads, or other nuisances.\n[new] Tasker and Locale support!\nWhat's in this version : (Updated : Aug 3, 2013)\nbug fixes to uploading and viewport\nadded History viewer\nbetter bookmark layout\nbetter full screen URL bar handling\nsmaller size\nadded some more animations\nincognito mode\nmore settings\nnotify of SSL errors\nMore, all the changes won't fit in here...\n\n\n &lt;a href=&quot;\nhttp://kickass.to/lightning-browser-v2-5-0-2-satfoun-amrg-t7695244.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kickass.to/lightning-browser-v2-5-0-2-satfoun-amrg-t7695244.html&lt;/a&gt;","torrent":{"xt":"urn:btih:884461b2a3d44721efda503d78d7806e3c4f7729","amp;dn":"Lightning+Browser+%2B+v2.5.0.2%5BSatfoun%5D%7BAMRG%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"884461b2a3d44721efda503d78d7806e3c4f7729","infoHashBuffer":{"type":"Buffer","data":[136,68,97,178,163,212,71,33,239,218,80,61,120,215,128,110,60,79,119,41]},"announce":[],"urlList":[]}}