{"title":"Meet David X - Part 3 - Ultimate Honesty","uid":8949134,"size":2514091704,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:899452be95f2921bbd98cdfe5b970b50cd8ea1bd&amp;dn=Meet+David+X+-+Part+3+-+Ultimate+Honesty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"acer47x","files":-1,"time":1379844755,"description":"Part 3 - &quot;The Ultimate Honesty&quot; (4 hours)\n\nFrom this DVD set you will learn:\n\nHow to deal with women who flake on you?\nHow to make it hard for women to cancel the date?\nHow to take total control on the date, from the first minutes of the relationship?\nHow staying focused prevents you from ruining the date?\nThe worst sins in the relationships - becoming lazy, making her not feel special, not taking her seriously, taking her for granted.\nCalling her or texting her - which is more efficient and why?\nBest &quot;romantic&quot; tricks.\nHow to deal with bitches?\nHow to get her trust and respect, to move things forward?\nHow to win in a situation, when a woman is more successful than a man?\nHow to become a guy she gets excited about?\nHow REALLY the women and the money are connected?\nWhat do women want and how can you position yourself with respect to that?\nIf you don't obey Rule #2, it means that you don't like or respect or value yourself - how can you change that?\nHow to deal with last minute resistance, and how to eliminate it?\nTricks to get women in bed as fast as possible.\nWhy the women are emotionally tougher than men, and why male ego gets hurt so easily?\nWhy the women want guys that feel good about themselves?\nOverthinking is a &quot;crime against humanity&quot; - how to limit your thinking and start acting?\nHow to treat the women who can't handle your honesty, who lie to you?\nHonesty as a way of life.\nHow to take care about relationship well?\nHow to manage a harem?\nWhy do you most often loose the women?\nHow to be honest and not stupid at the same time?\n&quot;Let's just be friends&quot; - how to convey that it is a ridiculous idea?\nWhat mistakes take you to LJBF zone?\nIf you are a busy person - how to manage your time with the women efficiently?\nHow to make the women not cheat on you?\nHow can you &quot;repair&quot; the relationship?\nHow to develop a &quot;tough guy&quot; character - do you need a transition?\n\n\n\nIf you are not as successful with women as you would like to be, what is it costing you? Your confidence? Long lasting feelings of undesirability? Worry over whether or not you will actually get this area of your life handled?\n\nImagine your life and all the benefits you would receive by having a consistent flow of beautiful women coming (in more ways than one!) and going? Imagine all of the crazy parties that you would be invited to, knowing that you will walk into any venue with gorgeous babes on your arm.\n\nThe long term success and happiness you will have FAR EXCEEDS the price of the seminar.\nNow it is time for YOU to make the choice. I hope that you make the right one.\n\nDavid X","torrent":{"xt":"urn:btih:899452be95f2921bbd98cdfe5b970b50cd8ea1bd","amp;dn":"Meet+David+X+-+Part+3+-+Ultimate+Honesty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"899452be95f2921bbd98cdfe5b970b50cd8ea1bd","infoHashBuffer":{"type":"Buffer","data":[137,148,82,190,149,242,146,27,189,152,205,254,91,151,11,80,205,142,161,189]},"announce":[],"urlList":[]}}