{"title":"Smart Volume Control+ v1.1.5 [Satfoun] {AMRG}","uid":8902055,"size":9028593,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:899b636ef0c1a4c6ae2b341f8ebb3f4da35f767a&amp;dn=Smart+Volume+Control%2B+v1.1.5+%5BSatfoun%5D+%7BAMRG%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Satfoun","files":1,"time":1378827353,"description":" &lt;a href=&quot;http://kickass.to/smart-volume-control-v1-1-5-satfoun-amrg-apk-t7848192.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://kickass.to/smart-volume-control-v1-1-5-satfoun-amrg-apk-t7848192.html&lt;/a&gt;\n\n\nRequired Android O/S : 2.1+\n\n\n\nFully customizable profiles are the basis of SVC+. You can switch them manually, using smart scheduling, or according to your location. Also, you get the ultimate Speed Volume mode, headphones mode and many more cool features.\n\nFeatures:\n\n*fully customizable sound Profiles\n*setup Volumes, Bluetooth, WiFi, Mobile data, Aeroplane mode, Call forwarding, *Screen brightness and Ringtone\n*mute or raise volume for selected contacts\n*switch profiles by Timers, Locations and Calendar events\n*Speed volume mode and Headphones mode\n*23 Widgets designed for quick and convenient control from your home screen\n*various application and widget skins for perfect harmony with the color and *settings of your Android\n*localized in 13 languages: ENG, SPA, POR, FRE, GER, RUS, KOR, CHI, JPN, ITA, POL, CZE, SLO\n\n*PROFILES BY TIMERS\n\nAre you tired of adjusting volumes manually? With SVC+ you can schedule activation of profiles using timers.\n\nAre you sick of muting ringer at night, restoring it in the morning, or even turning WiFi or Mobile data on and off? Smart scheduling in SVC+ can do it for you.\n\n*PROFILES BY LOCATIONS\n\nAdd your favorite places and let the application switch profiles according to your current location. It is easy, just drag and drop the pin on the map, or let the application find your current location.\n\nDo you use Bluetooth and Mobile data on your way to work, and then in the office you want to enable WiFi instead? Add both the place you park your car and the location of your office, and let SVC+ to take care of the rest! Everything can be set to fit your specific needs.\n\n*PROFILES BY CALENDAR EVENTS\n\nDo you have a busy schedule? Let the profiles be switched by the events in your calendar. All you need to do is to add a profile tag to the title or description of the event.\n\nDoes your assistant schedule events to your calendar? Don't waste your time on setting up your phone right before a meeting. Thanks to the tags in the calendar, the assistant will be able to activate a profile that mutes all sounds or even forward all calls to him/her.\n\nThe application is compatible with any calendar you use or synchronize to your phone (Gmail, MS Exchange and more).\n\n*SPEED VOLUME MODE\nDo you listen to the music in the public transport? Does it bother you that the music is too loud at the bus stop and while driving you barely hear it? Does the constant manual volume adjustment spoiling your enjoyment of the music? Treat your hearing better with SVC+ and Speed volume mode, which can dynamically adjust volume according to the speed you are moving.\n\n*HEADPHONES MODE\nDo you want to hear music in the headphones and also be sure, that even if the headphones are accidentally ripped off, you won't be embarrassed by loud noises of your phone, e.g. in your doctor's waiting room? Headphones mode ensures that sounds are muted when the headphones are unplugged. Also, it restores volume back once the headphones are plugged again.\n\n*SILENT MODE DETECTION\n\nDo you wish to take a nap after lunch and don't want to be disturbed at least half an hour? SVC+ can detect silent or vibrate mode and offer you an option to automatically increase volume after selected time.\n\n*BATTERY LIFE\n\nAre you worried about batter life? From the beginning the application was designed to have the smallest energy demands possible. Its consumption has been reduced to a minimum. Also, you can limit or completely disable energy intensive features in the application settings.\n\n*SUPPORT\n\nApplication SVC+ was battle tested on all supported versions of Android up to the latest 4.1 Jelly Bean. The wide range of test devices was formed by Galaxy Nexus, HTC Desire HD, HTC Hero, Samsung Galaxy Gio and more. It is optimized for tablets too.\n\nWhat's in this version : (Updated : Sep 9, 2013)\n\n*Profile switching based on connected Wi-Fi network (SSID/MAC)\n*Profile switching based on connected Bluetooth device\n*Switching by any string in the title or description of the calendar event\n*Ability to turn on/off GPS (Android 4.3&gt;)","torrent":{"xt":"urn:btih:899b636ef0c1a4c6ae2b341f8ebb3f4da35f767a","amp;dn":"Smart+Volume+Control%2B+v1.1.5+%5BSatfoun%5D+%7BAMRG%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"899b636ef0c1a4c6ae2b341f8ebb3f4da35f767a","infoHashBuffer":{"type":"Buffer","data":[137,155,99,110,240,193,164,198,174,43,52,31,142,187,63,77,163,95,118,122]},"announce":[],"urlList":[]}}