{"title":"Brand New 24 Bit Vinyl Pack","uid":8942118,"size":2216168872,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:89e44ce5c7ddfc9d46178522575be17bebf2ef08&amp;dn=Brand+New+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"politux","files":-1,"time":1379687813,"description":"\n  Brand New 24 Bit Vinyl Pack\n  \n  Genre: Pop/Rock\n  Styles: Indie Rock, Emo, Punk-Pop, Alternative\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n  \n  2003 Deja Entendu\n  2006 The Devil and God Are Raging Inside Me\n\n  Although the members of Brand New cut their teeth in various hardcore bands, the group took a more melodic approach to its own work, embracing punk-pop on the debut album Your Favorite Weapon and incorporating aspects of indie rock during future projects. Formed in Long Island, NY, the band took shape in 2000 around the talents of drummer Brian Lane, vocalist/guitarist Jesse Lacey, bassist Garrett Tierney, and guitarist Vin Accardi. Brand New wasted little time attracting local attention with a self-released demo, and shows alongside Midtown and Glassjaw helped spread the band's buzz outside of New York. In 2001, the musicians issued their first record, Your Favorite Weapon, which featured production from friend Mike Sapone. Lacey's clever and cutting lyrics sprinkled the album, which produced the semi-hit &quot;Jude Law and a Semester Abroad,&quot; and more touring with the likes of Taking Back Sunday and Finch followed.\n\n  Proving to be more than just another punk-pop outfit, the group made something of a stylistic leap with Deja Entendu, a decidedly matured follow-up that was recorded with Steve Haigler (Pixies, Blake Babies) and released in summer 2003 to warm reviews. Music videos for &quot;The Quiet Things That No One Ever Knows&quot; and &quot;Sic Transit Gloria...Glory Fades&quot; found significant airplay on MTV, and Brand New graduated to larger venues by playing with New Found Glory, Good Charlotte, Dashboard Confessional, and blink-182. By that fall, as the band's underground following continued growing into a mainstream audience, Brand New inked a deal with Dreamworks, which later led to a partnership with Interscope following the former label's buyout.\n\n  Touring eventually slowed to a halt as Brand New holed themselves up to work on their third album and major-label debut. After an extended quiet spell -- little to no interviews or updates came from the band's camp for quite some time -- Brand New finally emerged in summer 2006 for several headlining dates in America, their first nationwide tour in three years. The highly anticipated The Devil and God Are Raging Inside Me appeared in November 2006. Though significantly darker and less immediate than past efforts, the album was commended for its depth and maturity, and the band supported it with a sold-out spring 2007 tour. Meanwhile, sales for Deja Entendu continued to trickle in, and the album went gold that May. Brand New set to work on another album one year later, once again working with producer Mike Sapone on the new material. The resulting record, Daisy, was issued in 2009, and the band took a different approach by focusing nearly all of its promotional abilities on European audiences instead of American fans. A Deluxe version of Your Favorite Weapon was released in 2011.","torrent":{"xt":"urn:btih:89e44ce5c7ddfc9d46178522575be17bebf2ef08","amp;dn":"Brand+New+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89e44ce5c7ddfc9d46178522575be17bebf2ef08","infoHashBuffer":{"type":"Buffer","data":[137,228,76,229,199,221,252,157,70,23,133,34,87,91,225,123,235,242,239,8]},"announce":[],"urlList":[]}}