{"title":"Legends of the Dark Knight: Gothic","uid":8622633,"size":88299283,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8d062100fe4e230339ddad0d5bec89de953c7046&amp;dn=Legends+of+the+Dark+Knight%3A+Gothic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fudoh101","files":5,"time":1372420756,"description":"Gothic (6-10)\nBy Grant Morrison and Klaus Janson\nA man known as &quot;Mr. Whisper&quot; is killing off mob bosses one by one. The mobsters explain to Batman that he was a child killer over thirty years ago, and (similar to the film M) the mobsters had found and killed him when there was too much pressure from the cops over them. At the same time, Batman's investigation links Mr. Whisper with a hideous event in Bruce Wayne's school days, a bargain reminiscent of Don Giovanni, and the Gotham City Cathedral.\n\n-\n\nBatman: Legends of the Dark Knight, commonly referred to as simply Legends of the Dark Knight is a DC comic book featuring Batman. It was launched in 1989 with the popularity of the Batman movie, following on from Frank Miller's Batman: Year One. It differs from other Batman titles in that it has constantly rotating creative teams, and the stories are not necessarily part of the current events of the other Batman comics. Initially the title was promoted as running only stand alone self-contained five issue stories of graphic novel quality. However, after issue 20, stories of different lengths started to appear. While some stories have tied in with the other titles, generally this has not been the case\nAn episode of The New Batman Adventures was named after the comic.\nMost of the stories featured in Legends are set in the early years of Batman's career, though a few have been set in the present and even the future. Stories set at the beginning of Batman's career are referred to as taking place during Year One, meaning Bruce Wayne's first year (or first several years in some cases) of crime fighting as Batman.[1] The title had been initially promoted as only doing stories from before Robin, but Dick Grayson, the first Robin, did appear in issue 23, though he was still a circus performer. The series, for the most part, eschewed appearances by other DC universe characters save for Batman, Alfred Pennyworth, Commissioner Gordon and Batman's rogues gallery. The title was discontinued with issue #214, in March 2007, to make way for a new Batman anthology series, Batman Confidential, which focuses on more personal events in Batman's life (first encounters, building of new technology etc.), rather than early crime-fighting tales.","torrent":{"xt":"urn:btih:8d062100fe4e230339ddad0d5bec89de953c7046","amp;dn":"Legends+of+the+Dark+Knight%3A+Gothic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d062100fe4e230339ddad0d5bec89de953c7046","infoHashBuffer":{"type":"Buffer","data":[141,6,33,0,254,78,35,3,57,221,173,13,91,236,137,222,149,60,112,70]},"announce":[],"urlList":[]}}