{"title":"Fetish.Fanatic.Chapter.11.DiSC1.XXX.DVDRip","uid":8789308,"size":1473902747,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8e7618d1e8bad944c97d7426ed3cd1741ccc34a9&amp;dn=Fetish.Fanatic.Chapter.11.DiSC1.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1375900432,"description":"During his many years working with porn legend Belladonna on her famously kinky all-girl productions, director Aiden Riley developed a signature style of intimate reality porn that perfectly matches the special demands of the lesbian genre. In Aidens deluxe, double-disc Fetish Fanatic 11, the director has assembled a cast of all-natural, gorgeous girl-lovers for nearly six-and-a-half-hours of Sapphic slutting. Between the epic sex sessions are all the revealing behind-the-scenes interviews and intimate, unscripted footage that Aiden specializes in. Anally obsessed brunette Dana DeArmond and lushly voluptuous redhead Melody Jordan enjoy a sensuous afternoon of butthole insertions and rimming that leaves them both satisfied. Stunning blonde Ash Hollywood and exotic Mischa Brooks enjoy a Lycra-clad date with plenty of bare foot worship and pussy-eating pleasure. Next comes a fanatical session of ass play feisty Ashli Orion and pink-haired cutie-pie Proxy Paige stretch each others tender asshole using a variety of large anal toys, including inflatable dildos. Eagerly they lick each others gaping anus. Sweet Sovereign Syre and Lia Lor caress one anothers body, romantically slurping on bare toes and sensitive pussies. For those who prefer their lesbian encounters real and intense, Fetish Fanatic 11 delivers genuine girl-girl passion.\n\nAsh Hollywood, Ashli Orion, Dana Dearmond, Lia Lor, Melody Jordan, Mischa Brooks, Proxy Paige, Sovereign Syre\n\n\n","torrent":{"xt":"urn:btih:8e7618d1e8bad944c97d7426ed3cd1741ccc34a9","amp;dn":"Fetish.Fanatic.Chapter.11.DiSC1.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e7618d1e8bad944c97d7426ed3cd1741ccc34a9","infoHashBuffer":{"type":"Buffer","data":[142,118,24,209,232,186,217,68,201,125,116,38,237,60,209,116,28,204,52,169]},"announce":[],"urlList":[]}}