{"title":"[DBTech]-vBulletin Add-Ons - 2013 Updated","uid":8918608,"size":7625635,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8ed4f3f4a5877cac02c74cfef6aa1de31eb396e2&amp;dn=%5BDBTech%5D-vBulletin+Add-Ons+-+2013+Updated&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BagOfMoney","files":28,"time":1379200639,"description":"AJAX Threads\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nAJAX Threads brings your threads alive, making them automatically refresh without needing to reload the page.\n\nAdvanced Post Thanks / Like\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nAdvanced Thanks/Like mod is designed to cut down on spam and increase useful content in your forum by using a peer encouragement system - users thank/like each others posts, which can give them access to attachements, post content etc, as well as encourage the thanked person to post more great content.\n\nAdvanced Registration\nSupports: vBulletin 4.x.x\nAdvanced Registration is a registration overhaul to vBulletin which aims to improve the registration process by adding essential features, such as guest redirects, and improving on the original system.\n\n\nAdvanced User Tagging\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nAdvanced User Tagging is designed to increase activity on your forum by allowing members to mention each other in posts when talking about them. \nThis is done in a very easy way, very similar to how Twitter mentions people.\n\n\nDragonByte Custom Navigation\nSupports: vBulletin 4.x.x\nThis is a nifty mod that will allow administrators to add up to eight navigation items above the navbar like we have on DBT.\n\n\nDragonByte Forum Ads\nSupports: vBulletin 4.x.x\nDragonByte Forum Ads is an advanced advertising solution that allows you to easily show visitors you have advertisements available, offer multiple ad campaign options including banners, keywords and more and maximise the revenue potential of your community. Full PayPal integration and automated features such as deactivating expired ad campaigns allows you to make money without expending extra effort.\n\n\n\nDragonByte Forum Tabs\nSupports: vBulletin 4.x.x\nDragonByte Forum Tabs allows for forums to arrange their content into tabs and categories that are displayed to the user.\n\n\nDragonByte Gallery\nSupports: vBulletin 4.x.x\nDragonbyte Gallery is the most advanced vBulletin 4 gallery system ever created.\n\n\n\nDragonByte Reviews\nSupports: vBulletin 4.x.x\nDragonByte Reviews is an advanced review system that allows you to get your users interacting with your forums on a new level. With a wide range of permissions, you can allow your users to create/rate reviews, and customize it to your liking. You can also setup separate instances of the review system with different rating questions, custom fields and a review front page look.\n\n\n\nDragonByte vBForms\nSupports: vBulletin 4.x.x\nDragonbyte vBForms is a mod that forces users to fill out a form before posting threads in select forums.\n\n\n\nForum Live Feed &amp; User Wall\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nForum Live Feed &amp; User Wall lets you see a continuously updated feed of activities on the forum, with a powerful set of customisation options for sources of information.\n\n\nInfoPanels\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nInfoPanels allows you to display useful and interesting information in a much more user friendly way, allowing your members to access important areas of the forum, and important information, without having to go through different menu screens.\n\n\n\n\nPostbit Tabs\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nPostbit Tabs is a product that uses JavaScript to organise the postbit in a tab-like fashion, offering admins the opportunity to slim down their postbits and give it a more Web 2.0 look.\n\n\nProfile Hover\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nProfile Hover is a product that uses AJAX to display highly customizable user profile information when hovering over a users formatted name. It can be used to get a quick preview of a users profile information without loading the page or as a way to display a users information to encourage communication between your forum members.\n\n\nRandom Questions\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nThe Random Questions mod is intended to increase activity in your forum, attract back old members, and encourage members to form friendships (and thus stay).\n\n\nRedirect Banned Users\nSupports: vBulletin 4.x.x\nThis is a nifty mod that will allow administrators to redirect banned users, usergroups or banned ip's off your site.\n\n\nThread Ratings\nSupports: vBulletin 4.x.x\nThread rating is an all new AJAX method of members rating topics on your forum. It adds a much more noticeable and aesthetically pleasing system for your members to rate different topics.\n\n\nThreadmins and Group Moderators\nSupports: vBulletin 4.x.x\nThreadmins and Group Moderators is a self moderation system that allows threads to be moderated by the user that created them, also allows users to be assigned as moderators to a single thread also allows usergroups to be assigned as moderators to forums and also allows users to be assigned as moderators to a single Social Group discussion.\n\n\nvB Optimise\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nvB Optimise is an extension to vBulletin which aims to improve resources by eliminating MySQL queries commonly executed around your forum.\nIt supports multiple cache extensions available to the PHP language and additionally supports the File System for those without any Cache Extensions installed.\nvB Optimise can also integrate into other modifications to allow them to become less server intensive so the features you love don't become problems within the future.\n\n\n\n\nvBAnalytics\nSupports: vBulletin 4.x.x\nvBAnalytics provides detailed and customized analytics from traffic including bounce rates, landings, pageviews, visits and many more customized just for vBulletin! Think Google Analytics but made for vBulletin!\n\n\nvBArcade\nSupports: vBulletin 4.x.x\nvBArcade is a professional modular flash arcade game system. Easily converts your old favorites, and finds thousands more with the click of a button.\n\n\nvBAvatars\nSupports: vBulletin 4.x.x\nvBAvatars lets your members create a custom avatar for themselves, using clothing and body parts purchased from a shop.\n\n\n\nvBCredits II Deluxe\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nvBCredits II Deluxe is the evolution of the points hack that thousands of vBulletin owners have only been dreaming of. Completely rewritten to incorporate three years of requests and improvements, vBCredits II Deluxe is the pinnacle of simplicity and power for casual activity and serious ecommerce engines alike!\n\n\nvBDonate\nSupports: vBulletin 4.x.x\nvBDonate is a professional donation mod, allowing administrators to accept donations from PayPal (with more payment options to possibly come).\nvBDonate is the ideal product to accept donations from your members to help with the ever increasing costs of running your site.\n\n\n\nvBDownloads\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nvBDownloads is an advanced downloads repository for storing downloadable content on your vBulletin forum.\n\n\n\nvBMail\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nvBMail is a professional mailing list mod with Bounced Mail handling and advanced subscription management features.\n\n\n\nvBNavTabs\nSupports: vBulletin 4.x.x\nvBNavTabs is a professional navtab mod, allowing administrators to add, unlimited tabs and dropdown menus with no additional queries.\n\n\n\nvBNominate\nSupports: vBulletin 4.x.x\nvBNominate is an advanced nomination system. Several different types of nominations are available and fully automated to keep your users engaged and interested in your communities activity.\n\n\n\nvBNotifications\nSupports: vBulletin 4.x.x\nDragonbyte Tech are proud to present vBNotifications - extend the default vBulletin notifications system with this feature rich and clever system that will bring new meaning to notifications on your forum!\n\n\n\nvBQuiz\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nvBQuiz is an advanced quiz modification. You and your users will be able to create several different type of quizzes from basic multiple choice questions to advanced result generator quizzes using multiple variables to calculate end result.\n\n\n\nvBSecurity\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nvBSecurity keeps a watchful eye over your forum even when you are not there, and has the capability to alert you of any suspicious activity.\n\n\n\nvBShop\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nvBShop is the most advanced shop mod to date. Giving you unprecedented control over what items you can sell, vBShop is the perfect mod to go along with virtually any points modification.\nWith features like overriding any usergroup permission, including those of custom modifications, vBShop raises the bar for what you will come to expect from a shop mod.\n\n\n\nvBShout\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nDragonByte Technologies are proud to present vBShout v6: The most advanced, most feature-rich and most professional Shoutbox ever.\n\n\n\nvBSignatures\nSupports: vBulletin 4.x.x\nvBSignatures lets your members create a custom signature for themselves, using custom text and signature parts purchased from a shop.\n\n\n\nvBSlider\nSupports: vBulletin 3.8.x, vBulletin 4.x.x\nvBSlider is a professional slider mod, allowing administrators to show the latest threads, articles, and custom-defined content in a jQuery based slider.\n\n\n","torrent":{"xt":"urn:btih:8ed4f3f4a5877cac02c74cfef6aa1de31eb396e2","amp;dn":"%5BDBTech%5D-vBulletin+Add-Ons+-+2013+Updated","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ed4f3f4a5877cac02c74cfef6aa1de31eb396e2","infoHashBuffer":{"type":"Buffer","data":[142,212,243,244,165,135,124,172,2,199,76,254,246,170,29,227,30,179,150,226]},"announce":[],"urlList":[]}}