{"title":"The Odd Couple S1","uid":8947058,"size":5809700911,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8fa25b01a50d169c2cb72070c754e5652485d469&amp;dn=The+Odd+Couple+S1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":25,"time":1379799972,"description":"\nS1, Ep1\nSep. 24, 1970\nThe Laundry Orgy\nOscar has arranged dates for he and Felix with Gwendolyn and Cecily Pigeon who live upstairs. Oscar is excited but Felix is nervous and uncertain. Oscar tries to rally Felix to get back in the dating game but then both realize the date will conflict with poker night. Felix wants to cancel the date but Oscar wants to trick the guys into breaking up the game early.\n \nThe Fight of the Felix\nS1, Ep2\nOct. 1, 1970\nThe Fight of the Felix\nSplint McCullough is a rough and tough hockey player who spends as much time in the penalty box for fighting as he does on the ice. He and Oscar have just gone a round at a sports bar and Oscar comes away the loser with a black eye. He is determined to get revenge in his column by writing an expose about McCullough. Felix thinks revenge is wrong and when he confronts McCullough he too is forced into a fight.\n \nFelix Gets Sick\nS1, Ep3\nOct. 8, 1970\nFelix Gets Sick\nOscar has a date with an airline stewardess while Felix is away for the weekend on business. Only Felix isn't away...he's in bed sick with a 48 hour flu. With a high fever Oscar feels guilty about leaving Felix alone and is going to cancel his date. Felix convinces him to bring her to the apartment instead and assures Oscar he'll be quiet. This is just the beginning of a disastrous weekend for Oscar.\n \nThe Jury Story\nS1, Ep4\nOct. 15, 1970\nThe Jury Story\nLeo Garvey is being released from prison after serving 7 years of a 10 year sentence. The mention of this on the news makes Oscar and Felix reminisce about the first time they met...serving on Garvey's jury. What should be an open and shut case is dragged on by Felix's search for mitigating circumstances. After lengthy deliberation the jury is sequestered overnight and Oscar and Felix spend their first night together and get their first glimpse of each other's annoying habits.\n \nThe Breakup\nS1, Ep5\nOct. 22, 1970\nThe Breakup\nOscar has a bad hangover and has zero tolerance for Felix or the noise he's making cleaning. They have an argument and Oscar tells Felix to get out. Felix moves in with Murray, Vinnie and the Pigeon sisters and promptly begins driving them all crazy. Meanwhile Oscar is having his own problems with cooking, cleaning and ironing and it isn't long before he realizes how much he wants Felix to move back in.\n \nOscar's Ulcer\nS1, Ep6\nOct. 29, 1970\nOscar's Ulcer\nFelix is warning Oscar that he needs to change his lifestyle and get healthy or it could catch up with him. He could be right when Oscar folds during a poker game with a full house due to stomach pains. The doctor thinks it could be the beginning of an ulcer. Felix is determined to prevent this and begins to monitor Oscar's meals and habits to the point of creating the tension in Oscar's life he wanted to avoid in the first place.\n \nI Do, I Don't\nS1, Ep7\nNov. 5, 1970\nI Do, I Don't\nFelix ruins the wedding plans of a couple.\nWatch now\n \nOscar, the Model\nS1, Ep8\nNov. 12, 1970\nOscar, the Model\nFelix gets Oscar to pose in a cologne ad, but soon he lives to regret it.\n \nThe Big Brothers\nS1, Ep9\nNov. 19, 1970\nThe Big Brothers\nOscar and Felix join the Big Brothers foundation. Felix tries to show his little brother culture, but he prefers to be with Oscar.\n \nIt's All Over Now, Baby Bird\nS1, Ep10\nDec. 3, 1970\nIt's All Over Now, Baby Bird\nFelix's pet parrot passes away. While he wants to give the bird an honorable burial, Oscar just wants to get rid of the body.\n \nFelix Is Missing\nS1, Ep11\nDec. 10, 1970\nFelix Is Missing\nWhen Felix leaves on a sudden out of town assignment, their friends think he died at Oscar's hands.\n \nScrooge Gets an Oscar\nS1, Ep12\nDec. 17, 1970\nScrooge Gets an Oscar\nAfter Oscar refuses to be Scrooge in a children's play, his poker buddies come to him in a dream giving him the Christmas Carol treatment.\n \nThe Blackout\nS1, Ep13\nDec. 24, 1970\nThe Blackout\nOscar gets accused of stealing $50 from the poker pot during a blackout.\n \nThey Use Horse Radish, Don't They\nS1, Ep14\nJan. 7, 1971\nThey Use Horse Radish, Don't They\nBesides his bad back, Felix thinks he'll have trouble with the cooking contest after Oscar gave away his secret ingredients to his competitor.\n \nThe Hideaway\nS1, Ep15\nJan. 14, 1971\nThe Hideaway\nWhile Oscar thinks his Eskimo friend would make a great quarterback, Felix wants him to follow his cello talents.\n \nLovers Don't Make House Calls\nS1, Ep16\nJan. 29, 1971\nLovers Don't Make House Calls\nOscar falls in love with the doctor that is subbing for Felix's regular doctor.\nWatch now\n \nEngrave Trouble\nS1, Ep17\nFeb. 5, 1971\nEngrave Trouble\nA gift to Gloria is stolen and Oscar gets help from a shady friend.\n \nBunny Is Missing Down by the Lake\nS1, Ep18\nFeb. 12, 1971\nBunny Is Missing Down by the Lake\nOscar and Felix go into the woods and are interrupted by a girl's group.\n \nYou've Come a Long Way, Baby\nS1, Ep19\nFeb. 19, 1971\nYou've Come a Long Way, Baby\nOscar is all set to go to a sportswriter's dinner, but Felix can't leave since he found a baby.\n \nA Taste of Money\nS1, Ep20\nFeb. 26, 1971\nA Taste of Money\nHow could Oscar's neighbor's kid get $2000?\n \nOscar's New Life\nS1, Ep21\nMar. 5, 1971\nOscar's New Life\nFelix gets Oscar fired and he ends up at a new magazine, Harem.\n \nWhat Makes Felix Run\nS1, Ep22\nMar. 12, 1971\nWhat Makes Felix Run\nFelix begs Oscar to cure him of his neatness.\n \nWhat Does a Naked Lady Say to You?\nS1, Ep23\nMar. 19, 1971\nWhat Does a Naked Lady Say to You?\nHow does Felix tell Oscar that his new girlfriend is in a nude play?\n \nTrapped\nS1, Ep24\nMar. 26, 1971\nTrapped\nJust before a masquerade ball, Felix, Oscar and Nancy get trapped in the basement.\n \n","torrent":{"xt":"urn:btih:8fa25b01a50d169c2cb72070c754e5652485d469","amp;dn":"The+Odd+Couple+S1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fa25b01a50d169c2cb72070c754e5652485d469","infoHashBuffer":{"type":"Buffer","data":[143,162,91,1,165,13,22,156,44,183,32,112,199,84,229,101,36,133,212,105]},"announce":[],"urlList":[]}}