{"title":"God A Debate between a Christian and an Atheist - William Lane C","uid":8889979,"size":835789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ff87ceeef56ad6abd8142599b395969423fbf3f&amp;dn=God+A+Debate+between+a+Christian+and+an+Atheist+-+William+Lane+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"georgestrawson33","files":1,"time":1378559225,"description":"The question of whether or not God exists is profoundly fascinating and important. Now two articulate spokesmen--one a Christian, the other an atheist--duel over God's existence in an illuminating battle of ideas. \nIn God? A Debate between a Christian and an Atheist, William Lane Craig and Walter Sinnott-Armstrong bring to the printed page two debates they held before live audiences, preserving all the wit, clarity, and immediacy of their public exchanges. Avoiding overly esoteric arguments, they directly address issues such as religious experience, the Bible, evil, eternity, the origin of the universe, design, and the supposed connection between morality and the existence of God. Employing sharp and humorous arguments, each philosopher strikes quickly to the heart of his opponent's case. For example, Craig claims that we must believe in God in order to explain objective moral values, such as why rape is wrong. Sinnott-Armstrong responds that what makes rape wrong is the harm to victims of rape, so rape is immoral even if there is no God. By assuming a traditional concept of God in their discussion, the authors ensure that they are truly addressing each other's viewpoints and engaging in a disagreement over a unified issue. The book is composed of six chapters that alternate between Craig and Sinnott-Armstrong, so that each separate point can be discussed as it arises. Ideal for courses in the philosophy of religion and introduction to philosophy, this lively and direct dialogue will stimulate students and anyone interested in the existence of God, regardless of whether or not they believe in God.\n\nReview\n\n&quot;Bryan and Darrow redux! A lively and engaging debate on a topic both timely and ageless. Craig and Sinnott-Armstrong provide an eminently accessible introduction to arguments for and against the existence of God. While their method is philosophical, the authors' passion for their subject is always in evidence. God? may not settle the main question; it does demonstrate that the same questions ignite the curiosity of theists and atheists alike: where did we come from? why be moral? what does it all mean?&quot;--Louise M. Antony, Professor of Philosophy, Ohio State University\n\n&quot;This is a wonderful exchange about the existence of God--fast, fair, informative, intelligent, sincere, and above all terrific fun. It covers such topics as the original cause of the universe, the possibility of genuine morality, the nature of miracles, and the problem of evil. As an introduction to these really basic issues, it is simply the best that I have ever read. I will be recommending it to my relatives, to my friends, to my colleagues, and to all of my students.&quot;--Michael Ruse, Lucyle T. Werkmeister Professor of Philosophy, Florida State University\n\n&quot;In this book, the deepest controversies and issues related to the existence of God are debated, in an accessible but sophisticated way, by two first-rate philosophers. The exchanges are lively, incisive, and informed. The book is must reading for all who are interested in the simple question: Does God Exist?&quot;--Stephen T. Davis, Russell K. Pitzer Professor of Philosophy, Claremont McKenna College\n\n&quot;Two megawatt minds reduce humanity's oldest issue to understandable essentials.&quot;--Associated Press","torrent":{"xt":"urn:btih:8ff87ceeef56ad6abd8142599b395969423fbf3f","amp;dn":"God+A+Debate+between+a+Christian+and+an+Atheist+-+William+Lane+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ff87ceeef56ad6abd8142599b395969423fbf3f","infoHashBuffer":{"type":"Buffer","data":[143,248,124,238,239,86,173,106,189,129,66,89,155,57,89,105,66,63,191,63]},"announce":[],"urlList":[]}}