{"title":"[ExploitedCollegeGirls] Crissy (10.03.2013)","uid":9001355,"size":662185896,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:906ba5c4c83e285330da76883a1de33df9705d9f&amp;dn=%5BExploitedCollegeGirls%5D+Crissy+%2810.03.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1380946008,"description":"[ExploitedCollegeGirls] Crissy (10.03.2013)\n\nAfter several weeks of skinny little spinners, I'm doing my best to please everybody by shooting a curvier girl this time. Crissy is what I would call 'thick' in the best possible sense. She's got ass for days, which explains why I spend so much time behind her pounding away.\n\nWe meet Crissy in the bathroom as she applies her subtle, elegant make-up (jokes) and try to get to know her, but she's a shy one. She doesn't really open up much, so when she says she's a talented, enthusiastic cocksucker I cut the Q and A short and have her drop down and demonstrate. Turns out she was telling the truth, this girl does indeed love to suck cock and definitely has the talent.\n\nAfter her nice long oral demonstration, I get Crissy situated on the bed and try to get a little more out of her, but she's still pretty shy. Not a huge deal, how interesting could a shy 18 year old POSSIBLY be? Once she gets naked she might open up more. I get started with my fingers and after trying a few tricks I'm not sure if it's working or not, she's being very quiet. So I upgrade to a decent sized vibrator, which she seems to like, but still isn't making a lot of noise.\n\nThere's only one more weapon in my arsenal today, so I saddle up and fuck her. We start off on her back, but I'm dying to see that big booty bounce, so I turn her around and get her into doggy for some nice solid, rough pounding. She finally starts to respond a little after I get more aggressive and I figure pinning her down and pounding her into the bed might be what she needs to get off, so I go for it.\n\nIf there is one thing that Crissy is missing by now, it's a face full of jizz. So after pounding her phat ass into the bed as soon as I feel that nut coming, I get her to her knees and blast her face with a huge load. She ends up swallowing about half of it, which is always a good quality in a young lady.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=483jn6h300qtcyg39bet.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=483jn6h300qtcyg39bet.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=n35zv0cgra912f99qca4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=n35zv0cgra912f99qca4.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:906ba5c4c83e285330da76883a1de33df9705d9f","amp;dn":"%5BExploitedCollegeGirls%5D+Crissy+%2810.03.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"906ba5c4c83e285330da76883a1de33df9705d9f","infoHashBuffer":{"type":"Buffer","data":[144,107,165,196,200,62,40,83,48,218,118,136,58,29,227,61,249,112,93,159]},"announce":[],"urlList":[]}}