{"title":"ODDREE's MiniMiner (for mining XPM in a VMware environment)","uid":8797451,"size":185691801,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9112c69b41471c13a9e1bcdbc14d3aba271ed823&amp;dn=ODDREE%27s+MiniMiner+%28for+mining+XPM+in+a+VMware+environment%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rayhaque","files":2,"time":1376108246,"description":"\nThese are instructions to build your own &quot;mini miner&quot; ISO.  Many people are aware that there are Linux distributions that provide a small environment for troubleshooting, moving files, etc (such as BartPE).  Microsoft also has such a thing called WinPE.  It was built with the idea in mind to help you image a workstation with a new operating system - or perform testing.\n\nBut you can also use it as a mini-Windows OS to do your bidding.\n\nIMPORTANT NOTE: I built this to mine on VMware servers.  As such, I embedded VMware network drivers.  If you are going to use thiswith your home PC - or random PC's in your office / home office, you need to figure out what network card you have, and get the drivers for it so that you can embed them!\n\nAnother note: This will build a 64 bit mini-OS for a 64 bit miner. That said, you cannot use 32 bit drivers or add 32 bit programs to this WinPE image!!!\n\nFINAL NOTE: This is a lot of work.  If you don't want to go through all of this bullshit (I don't blame you) you can download\nmy image which works great.  Why go through all of this then?  Because if you are running this on anything other than VMware, you will need to embed your own network drivers to this image/ISO.  Read on ...\n\n1) You will need the WAIK Supplement.  You can get this from Microsoft: http://www.microsoft.com/en-us/download/details.aspx?id=5188\n\n2) Extract waik_supplement_en-us.iso to C:waik_supplement_en-us\n(I used WinRar to extract it, but any ISO management tool will work).\n\n3) Open a command prompt and RUN: cd C:waik_supplement_en-ustools\n\n4) RUN: copype amd64 D:winpe-amd64\n\nYou need a couple of tools that do NOT come with that massive ISO.  The easiest way to get them is to use a download tool that this\nguy has on his website: http://www.rmprepusb.com/tutorials/getwaiktools\n\n5) Downloaded and run the tool from above.  Check the boxes in ths program to get Waik Tools for Windows 7 AND Cism for Windows 7.\nSave the files to d:waik_supplement_en-ustools.\n\n6) RUN the following commands:\ncd c:winpe-amd64\nc:waik_supplement_en-ustoolsimagex.exe /mountrw winpe.wim 1 mount (this mounts your image so you can start copying things to it).\n\nAt this point, you can use Windows Explorer to copy files around (if you are not comfortable with the command prompt).\n\nRunning VMware?  You need to steal network drivers from a host.  So find a 64 bit Windows OS in your environment, and copy\nthe drivers out of the VMWare ToolsDrivers directory as I do in step 7 below.  Otherwise, replace this with drivers for your\nRealTek, Linksys, Via, or whatever other shit network card you have.  You can have drivers for multiple network cards.  But do NOT\ninstall multiple different drivers for the SAME network card!  And only add the 64 bit ones - leave the 32 bit ones out of this.\n\n7) Copy your network drivers to a directory:\nCopy \\MYSERVERc$Program FilesVMwareVMware ToolsDrivers to C:waik_supplement_en-usvmwaredrivers\n\n8) Embed these drivers to your image:\nc:waik_supplement_en-ustoolsDism.exe /image:c:winpe-amd64mount /Add-Driver /driver:c:waik_supplement_en-usvmwaredrivers /recurse\n\n9) Optionally add HTA components (you can skip this, but these are useful if you plan to add a web browser or other Internet\nrelated stuff).  I like to add these components every time, whether I need them or not (these are small packages).\nc:waik_supplement_en-ustoolsDism.exe /image:c:winpe-amd64mount /Add-Package /PackagePath:&quot;c:waik_supplement_en-usAMD64WINPE_FPSWINPE-HTA.CAB&quot;\nc:waik_supplement_en-ustoolsDism.exe /image:c:winpe-amd64mount /Add-Package /PackagePath:&quot;c:waik_supplement_en-usAMD64WINPE_FPSen-uswinpe-hta_en-us.cab&quot;\n\n10) Make a directory for your miner(s) and copy them over.\nmkdir c:winpe-amd64mountjhprimeminer\nmkdir c:winpe-amd64mountjhprimeminerv4\nmkdir c:winpe-amd64mountjhprimeminerv5\nmkdir c:winpe-amd64mountjhprimeminerv6\n\nNOTE: I could not make v4 work (found shares fine, but all were invalidated).  But v6 works VERY well!  Again, your milage may vary.\n\n11) Unmount your image and commit your changes (this fucking takes forever - go make a sandwich and wait).\nc:waik_supplement_en-ustoolsimagex.exe /unmount c:winpe-amd64mount /commit\n\n12) Turn your image into a bootable ISO (it's magic).\ncopy c:winpe-amd64winpe.wim c:winpe-amd64ISOsourcesboot.wim /y\nc:waik_supplement_en-ustoolsoscdimg.exe -n -h -bc:winpe-amd64etfsboot.com c:winpe-amd64iso c:winpe-amd64winpe-amd64.iso\n\n13) Use your ISO\nYou can now burn c:winpe-amd64winpe-amd64.iso using a CD Burning utility.  I suggest CDBurnerXP (it's free).  If you are going\nto use this in a VMware environment ...\na) Copy the ISO to the VMWare server (I used WinSCP) - note you will need to have ssh enabled on the VMware server.\nb) Create a new VMware machine with NO hard drive, as many CPU cores as you can muster, and mount this ISO as your CD-ROM.  Note\nthat you also need to check the box for &quot;connect at power on&quot; (not sure why that is not a default).\n\n14) Boot up your ISO or your VMware server.\n\n15) At the prompt, RUN: startnet.  The machine will start up your network driver (we hope) and obtain an IP address.  You can\nuse IPconfig to see if it was successful.\n\n16) Now you can CD to your miner directory and start this shit up!\ncd jhprimeminerv6\njhPrimeminer -o http://ypool.net:10034 -u &lt;username&gt;.&lt;workerID&gt; -p &lt;password&gt;\n\n17) PROFIT - and DONATE!\n\nIf you found this useful - why not donate some XPM to me?\nSend donations to: AbVsFdsKcnynJmNenXit3gS3ZMTgXEzxsB\n\nYou can also find me on the Ypool community forum and chat as 'oddree'.\n\nHappy Hacking!\n-Ray Dios Haque","torrent":{"xt":"urn:btih:9112c69b41471c13a9e1bcdbc14d3aba271ed823","amp;dn":"ODDREE%27s+MiniMiner+%28for+mining+XPM+in+a+VMware+environment%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9112c69b41471c13a9e1bcdbc14d3aba271ed823","infoHashBuffer":{"type":"Buffer","data":[145,18,198,155,65,71,28,19,169,225,188,219,193,77,58,186,39,30,216,35]},"announce":[],"urlList":[]}}