{"title":"Neil Innes / The Innes Book of Records / Series 3 Disc 1","uid":8943692,"size":3542103665,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:915e5b45eeb5dbcaeb0c19faa700cca86e93919e&amp;dn=Neil+Innes+%2F+The+Innes+Book+of+Records+%2F+Series+3+Disc+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":null,"files":63,"time":1379723886,"description":"&quot;Songs and pictures about people and things&quot;\n\nNeil Innes is a semi-legendary British singer/songwriter known for his work with \nMonty Python, The Rutles, The Bonzo Dog (Doo Dah) Band, and on Rutland Weekend \nTelevision. He appears with the Bonzo Dog Band in the Beatles film Magical Mystery \nTour, and in various Monty Python films, albums and projects. He composed and \nperformed new songs in the style of the Beatles for Eric Idle's film &quot;The Rutles: \nAll You Need is Cash,&quot; and played Ron Nasty. The Rutles reunited in 1997 for the \n&quot;Archaeology&quot; album.\n\nThe Innes Book of Records was Neil Innes' BBC2 TV series from 1979 to 1981, lasting \neighteen episodes over three series. It was originally shown in the UK and \nAustralia and then rerun occasionally over the next 20 years on UK Gold (with \nseveral songs always cut out and episode contents in the wrong order.)\n\nNeil Innes' music is comedic and serious, wistful and nostalgic, old-fashioned yet \nspanning many different musical genres. Neil has a particular gift for pastiche, \nmimicking the style of another musical artist, which served him well on Eric Idle's \npost-Monty Python comedy series, Rutland Weekend Television. &quot;Concrete Jungle Boy&quot; \nwas written in the style of The Who, and &quot;Godfrey Daniel&quot; in the style of Elton \nJohn. His own style of music is equally fascinating, and his lyrics consistently \nwitty and original.\n\nHis own television series is a work of art, quite unlike anything you'd normally \nsee on television.\n\n&quot;The Innes Book of Records is not intended to be up-front comedy. It's not anarchic \nin any way, nor is it particularly satirical. It's literally trying to compose \npictures with sound, taking both elements and making them work together.&quot;\n- Neil Innes, 1979\n\n&quot;The trend at the time was to have two tall stools and a guest and thousands of \nlight bulbs and you'd sing a duet or something. Horrible. And I said what I really \nmiss is the interlude. They used to have an interlude on BBC Television where you'd \nwatch swans going up and down for about ten minutes. Because they had no \nprogramming. Or the potter's wheel; the potter would throw a pot, you know, and it \nwould just be some music. We're missing that, I said. Let's have a program that \ndoes that, and we'll make it a show about, um ... songs and pictures about people \nand things.&quot; - Neil Innes, 2011.\n\n\nThis DVD contains three episodes from the third series of The Innes Book of \nRecords.\n\nAdditional clips from Youtube are included in the DVD_ROM folder.\n\nThese episodes are presented in full DVD quality.\n\nA further disc of Innes Book of Records clips can be purchased as part of a CD box \nset at Neil Innes' website.\n\n\n\n\n--\n\n\nEpisode 13  \n\nOriginal air date: 28 September, 1981\n\nImagination, Protest Song, Drama on a Saturday Night, I'm the Urban Spaceman, \nMichael Palin (cop monologue), Next Week, I Give Myself to You\n\nPerformed, Written and Composed by: Neil Innes\n\nProducer/Director: Ian Keill\n\nMusical Director &amp; Arrangements: John Altman\n\nGuests: Michael Palin, The Bristol Synchronised Swimmers, Samantha Jay, David Shaw, \nMagda Sumray, Claire Saunderson, Catherine Owen, Imogen Woodford, Jackie Munro, \nAndrea Evans, and the voice of Kenny Everett\n\n--\n\nEpisode 15  \nOriginal air date: 12 October, 1981\n\nBlue Suede Schubert, Knicker Elastic King, Ivor Cutler (Grats For Tea), City of the \nAngels, Happy Ending, La Vie En Rose\n\nPerformed, Written and Composed by: Neil Innes\n\nDirected by Andrew Gosling\n\nProducer: Ian Keill\n\nMusical Director &amp; Arrangements: John Altman\n\nGuests: Ivor Cutler, Judith Bickley, Peter Glidewell, Carolyn Evans, John Sanders, \nCaroline White, Edward Burns, Robert Chadwick, John Dixon\n\n\n--\n\nEpisode 17  \nOriginal air date: 2 November, 1981\n\nVivian Stanshall (The Sea), Rock of Ages, Them (Animation by Bill Mather and Andy \nWalker), Humanoid Boogie, Prologue/Momma Bee (With Daniel Illsley), Michael Banks \n(Jellyfish), Feel No Shame\n\nPerformed, Written and Composed by: Neil Innes\n\nProducer/Director: Ian Keill\n\nMusical Director &amp; Arrangements: John Altman\n\nGuests: Vivian Stanshall, Michael Banks, Pauline Sheppard, Judith Bickley, Kathy \nVinnicombe, Daniel Illsley, Sally Pickering, Julia Trathen, and Children From The \nHumphry Davy School, Penzance, Cornwall\n\n","torrent":{"xt":"urn:btih:915e5b45eeb5dbcaeb0c19faa700cca86e93919e","amp;dn":"Neil+Innes+%2F+The+Innes+Book+of+Records+%2F+Series+3+Disc+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915e5b45eeb5dbcaeb0c19faa700cca86e93919e","infoHashBuffer":{"type":"Buffer","data":[145,94,91,69,238,181,219,202,235,12,25,250,167,0,204,168,110,147,145,158]},"announce":[],"urlList":[]}}