{"title":"Chronological Guardians of the Galaxy V1 Original Team","uid":8927064,"size":1086675110,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:923232ab776a5afecaf187585e466dcadf906bdc&amp;dn=Chronological+Guardians+of+the+Galaxy+V1+Original+Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"travsimp","files":118,"time":1379385779,"description":"The Guardians are active in the 31st century in an alternative time-line of the Marvel Universe Earth-691. The original members of the team include Major Vance Astro, an astronaut from the 20th century Earth who spends a thousand years travelling to Alpha Centauri in suspended animation. He is also the future alternative universe counterpart of Vance Astrovik, the hero known as Justice.\n\nOther original team members are Martinex T'Naga, a crystalline being from Pluto; Captain Charlie-27, a soldier from Jupiter; and Yondu Udonta, a blue-skinned &quot;noble savage&quot; from Centauri-IV (the fourth planet orbiting the star Alpha Centauri B). Each is apparently the last of their kind and they are forced to unite as a team against the actions of the Badoon, an alien race which attempts to conquer Earth's solar system.\n\nDuring the course of the war against the Badoon, the team recruit two more members - Starhawk and Nikki (created by writer Steve Gerber and artist Sal Buscema) - and travel back in time, where they encounter several of the heroes of 20th century Earth, including Captain America and the Thing.[3]\n\nThe Guardians eventually defeat the Badoon, but soon find themselves facing a new foe called Korvac, who was in fact a creation of the Badoon. After teaming with the Thunder God Thor to defeat Korvac in the 31st century,[4] the Guardians then follow Korvac to 20th century Earth, where together with the Avengers they fight a final battle.[5]\n\nThe Guardians reappear years later and have a series of adventures in their future,[6] with several others eventually joining the Guardians, such as the Inhuman Talon, Replica the Skrull, and the second version of Yellowjacket, Rita DeMara. - WIKI\n\n100% credit to original scanners!!!!\nEnjoy and please seed!!!!\n","torrent":{"xt":"urn:btih:923232ab776a5afecaf187585e466dcadf906bdc","amp;dn":"Chronological+Guardians+of+the+Galaxy+V1+Original+Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"923232ab776a5afecaf187585e466dcadf906bdc","infoHashBuffer":{"type":"Buffer","data":[146,50,50,171,119,106,90,254,202,241,135,88,94,70,109,202,223,144,107,220]},"announce":[],"urlList":[]}}