{"title":"Nijisseiki shônen dokuhon aka Circus Boys (1989)","uid":8795865,"size":1198921238,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:92dd3edc122def1d2675bd08babe4d31a57d6df0&amp;dn=Nijisseiki+sh%26ocirc%3Bnen+dokuhon+aka+Circus+Boys+%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZGNN","files":-1,"time":1376077387,"description":"Just as the road has become a potent metaphor in cinema for journeys through life, the circus occupies a similar position in representing the security of togetherness. There are not so many examples of the circus movie but when the big top is pitched it is usually a protection from a hostile world outside for those within. In Kazan's &quot;Man on a Tightrope&quot; for instance there is the solidarity in fleeing from a repressive regime. The characters in possibly the greatest circus film of all, Bergman's &quot;Sawdust and Tinsel&quot;, may not always act kindly towards one another, but they are often protected by the camaraderie of those they share the tent with. An interesting circus curio from Japan is &quot;Circus Boys&quot; which tells the story of two brothers brought up in the ring who reach a point in their early adulthood where their developmental paths diverge. The younger has retained the emotional protection that the circus provides and stays on to help rebuild it after an appalling accident with a geriatric elephant all but wrecks the show. The older brother, even before this event, has had to get away and in developing his skills as a dishonest showman, falls in with a group of gangsters. After several misadventures he rediscovers the bright lights of the circus tent which presumably beckon him back to stability. Although it all sounds a shade simplistic, this interesting little film is saved from being a little too pat by monochrome visuals that are beautifully composed from first shot to last. Possibly the most memorable character in the film is the elephant, a mass of animated rubber from which eyes stare grotesquely. The demise of this creature is both pathetic and noble.\n\nPLEASE SEED AT LEAST AS MUCH AS YOU DOWNLOAD SO THIS TORRENT WILL NEVER DIE, THANK YOU! :)","torrent":{"xt":"urn:btih:92dd3edc122def1d2675bd08babe4d31a57d6df0","amp;dn":"Nijisseiki+sh%26ocirc%3Bnen+dokuhon+aka+Circus+Boys+%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92dd3edc122def1d2675bd08babe4d31a57d6df0","infoHashBuffer":{"type":"Buffer","data":[146,221,62,220,18,45,239,29,38,117,189,8,186,190,77,49,165,125,109,240]},"announce":[],"urlList":[]}}