{"title":"Sexually Broken--Booming E cup MILF Shelia Marie tied up, has ea","uid":9027650,"size":904222623,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9308dee8d7c160cb7d35cc0a65c43b1ca7c0e9ce&amp;dn=Sexually+Broken--Booming+E+cup+MILF+Shelia+Marie+tied+up%2C+has+ea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1381391775,"description":"Booming E cup MILF Shelia Marie tied up, has earth shattering orgasms, 2 cocks own her throat hole! | Shelia Marie | Matt Williams\n\nOctober 9, 2013 \n\n\nMP4 only.\n\n \n \nLush and curvy Shelia Marie brings her massive E cups breasts and big mouth hole to the Sexuallybroken stage to see if she can take what we dish out. Can this porn star survive a multiple cock throat training session? Or will she end up broken? We start out with her booming body staked out and lashed down onto a metal frame with a leather hood over her face pussy.\n\nShe can't move or even wiggle. Leather straps hold her firmly in place and the hood makes her aware of every gasp of air. To remind her that she is just a toy for our use, we tease her a little with the vibrator. The intense simulation makes her moan helplessly. Moaning mouths need to be filled with cock, and we rip off the hood and fill her to the brim with 10 inches of giant black cock.\n\nThe BBC warms her up and we join the party. Shelia looks up with pleading eyes as we own the back of her throat and drool flows out of her well-used mouth, spilling down over her massive breasts. Pleading is a good look on her and we reward it with dick. The cock overloads her senses and she comes undone. She simply can't stay on top of it and spirals glassy-eyed down the sexual rabbit hole. More vibrator seals the deal and she is out, locked deep in sexual subspace.\n\nWhen we have had our fill we just leave her slumped limply in her bonds, her mouth open and eyes vacant, covered in her own drool and girl juices. We are not even going to bother letting her out. Maybe she will come in handy later on today if we want to have some more fun. \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_09smarie/SexuallyBroken-Shelia-Marie-Matt-Williams-Booming-E-cup-MILF-Shelia-Marie-tied-up-has-earth-shattering-orgasms-2-cocks-own-her-throat-hole.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_09smarie/SexuallyBroken-Shelia-Marie-Matt-Williams-Booming-E-cup-MILF-Shelia-Marie-tied-up-has-earth-shattering-orgasms-2-cocks-own-her-throat-hole.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:9308dee8d7c160cb7d35cc0a65c43b1ca7c0e9ce","amp;dn":"Sexually+Broken--Booming+E+cup+MILF+Shelia+Marie+tied+up%2C+has+ea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9308dee8d7c160cb7d35cc0a65c43b1ca7c0e9ce","infoHashBuffer":{"type":"Buffer","data":[147,8,222,232,215,193,96,203,125,53,204,10,101,196,59,28,167,192,233,206]},"announce":[],"urlList":[]}}