{"title":"Xslimmer 1.9.3 [K'ed]","uid":8902901,"size":2144492,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:945b4ad6d86e2a05e7889a02940e1e4ee4b84019&amp;dn=Xslimmer+1.9.3+%5BK%27ed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"weebey7","files":1,"time":1378845442,"description":"Name: Xslimmer\nVersion: - 1.9.3\n\nMac Platform: UB\nIncludes: K - no registration needed\n\nOS version: Mac OS X 10.4 or later\n\nLink for more information: http://www.xslimmer.com/\n\n\nPre-cracked courtesy of Deevious\n\n\nXslimmer removes wasted space on your Mac's hard drive by removing the binary from either its PowerPC or Intel code (depending on the system architecture used). The result users report is that you can save 47% of your disk space.\n\nFor example, when running Xslimmer on Google Earth 4, it shrinks the size from 101MB to 52.8MB, which is a 47% reduction.\n\nAs the developer states, the driving goal of Xslimmer is to achieve size reduction without compromising functionality. As of version 1.2, the option to strip applications from unwanted language files and localizations is added. Version 1.2.7 improves Leopard support by automatically excluding Time Machine paths from the analysis process.\n\nAdditional features for safe use include a &quot;blacklist&quot; and a custom folder list (which is by default populated with key system locations). This prevents problems with applications (or the system itself) that will no longer work after size reduction.\n\nWith the &quot;App Finder Genie&quot;, a user can list all size reducible applications on the hard disk and choose to slim them and save a considerable amount of hard disk space.\n\nWhat's New\n\nVersion 1.9.3:\n\nXslimmer 1.9.3 fixes a crasher introduced in 1.9.2 that affected some users. Our apologies for the trouble.\n\nXslimmer 1.9.2 adds compatibility with Mac OS X 10.9, Mavericks.\n\nImportant: As of version 1.9.2, Xslimmer is no longer compatible with Tiger (10.4) or Leopard (10.5). If you are running any of those versions of Mac OS X, please keep using Xslimmer 1.9.1. ","torrent":{"xt":"urn:btih:945b4ad6d86e2a05e7889a02940e1e4ee4b84019","amp;dn":"Xslimmer+1.9.3+%5BK%27ed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"945b4ad6d86e2a05e7889a02940e1e4ee4b84019","infoHashBuffer":{"type":"Buffer","data":[148,91,74,214,216,110,42,5,231,136,154,2,148,14,30,78,228,184,64,25]},"announce":[],"urlList":[]}}