{"title":"Ignacio Larranaga - Sensing Your Hidden Presence (pdf)","uid":8538696,"size":2777776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9529b80c3571d2c5e900de8d6c763597bb49adec&amp;dn=Ignacio+Larranaga+-+Sensing+Your+Hidden+Presence+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmakate","files":-1,"time":1370334699,"description":"Ignacio Larranaga - Sensing Your Hidden Presence: Toward Intimacy with God (Mediaspaul, 1992). 334 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nThis is my favorite book on prayer. But it does have some negatives:\n\n1. That cover. Ugh.\n\n2. The translation (from Spanish) reads like a translation, not like something a native English-speaker would write.\n\n3. The structure of the book is unclear from the table of contents; you pretty much just have to read it to see how it's organized.\n\nDespite all that, this is a truly wonderful book, despite being almost completely unknown.\n\n\nreviews:\n\nAn electrifying book from the first line. No one interested in Christian spirituality and its relation to contemporary problems can afford to miss this witness to the power of living faith in Christ founded on an intense life of prayer.\n\n--Benedict Groeschel\n\nOriginally published in Spanish in 1979, this exciting book by the Franciscan founder of the &quot;Encounters with God&quot; workshops appears now in English for the first time. Integrating a sophisticated modern sensibility with profound spiritual discernment, Larranaga invites readers to approach secularization as a &quot;dark night of the senses&quot; and to embrace an &quot;adult&quot; faith, surrendering all religious props and risking deep encounter with God through prayer. A stunning achievement.\n\n--Library Journal\n\n\n--------\n\nThe same author's book on St. Francis can be found here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8305196&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8305196&lt;/a&gt;","torrent":{"xt":"urn:btih:9529b80c3571d2c5e900de8d6c763597bb49adec","amp;dn":"Ignacio+Larranaga+-+Sensing+Your+Hidden+Presence+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9529b80c3571d2c5e900de8d6c763597bb49adec","infoHashBuffer":{"type":"Buffer","data":[149,41,184,12,53,113,210,197,233,0,222,141,108,118,53,151,187,73,173,236]},"announce":[],"urlList":[]}}