{"title":"Stossel.2013.08.01.[Summer Myths].Fox Business.CF.avi","uid":8777723,"size":341161114,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9703e0cca78be58175d1979c34f14abaf9f0471e&amp;dn=Stossel.2013.08.01.%5BSummer+Myths%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1375600227,"description":"----------\n\nSTOSSEL - [Summer Myths] - Fox Business Network\n2013, August 1, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nOften... what we think we know... is not so.\n\nWEATHER MYTHS:\n\nIt's hurricane season and I'm told that because of global warming there are more hurricanes and that hurricanes are stronger, but that's just not true:\n\nMeteorologist Maria Molina debunks more weather myths.\n\nThen, Oceanographer John Englander, author of &quot;High Tide on Main Street: Rising Sea Level and the Coming Coastal Crisis,&quot; and CATO Institute climatologist Pat Michaels debate global warming and the effect of rising sea levels.\n\nSHARK MYTH:\n\nMovies like Jaws taught me that when I swim, I should worry about sharks. Andy Dehart, from the Ripley's Aquarium in Toronto, says you are more likely to die driving to the beach.\n\nBEE MYTHS:\n\nIf the sharks don't get you, the bees might. The media warns that killer bees are invading America. Bee removal specialist Mike Mollica says killer bees are very aggressive and more dangerous but they only kill 1 or 2 people a year.\n\nWhen the media isn't worried about bees killing us, they worry about bees vanishing. Wally Thurman from the Property and Environment Research Center says market forces have led beekeepers to simply breed more bees.\n\nFIRE MYTH:\n\nMyth: Firefighting must be done by government.\n\nTruth: More than 11,000 private firefighters under contract to the federal government in 2012 to fight wildfires. In some parts of America if your house catches fire, it's a private business that will come to put it out. Hugh Futrell is Assistant Chief of a privately run fire department in Georgia.\n\nDRIVING MYTHS:\n\nIn summer, people drive more. The more you drive, the more you want to get the best possible mileage. Race car driver Lauren Fix debunks driving myths.\n\nHEALTH MYTHS:\n\nMyth: Peeing on jellyfish sting relieves the pain.\n\nTruth: It doesn't. Dr. Keri Peterson has talks about summer health myths.\n\nThe world is full of crazy myths... In my book &quot;Myths, Lies and Downright Stupidity,&quot; I debunk more. For example:\n\nMyth: Cracking your knuckles causes arthritis.\n\nTruth: Nope. Crack away.\n\nMyth: You shouldn't marry your cousin.\n\nTruth: Marry away.\n\nMyth: More people do crazy things on the night of a full moon.\n\nTruth: They don't.","torrent":{"xt":"urn:btih:9703e0cca78be58175d1979c34f14abaf9f0471e","amp;dn":"Stossel.2013.08.01.%5BSummer+Myths%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9703e0cca78be58175d1979c34f14abaf9f0471e","infoHashBuffer":{"type":"Buffer","data":[151,3,224,204,167,139,229,129,117,209,151,156,52,241,74,186,249,240,71,30]},"announce":[],"urlList":[]}}