{"title":"Inked.Angels.DiSC1.XXX.DVDRip","uid":8870446,"size":1673135720,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:974fa3d071bad57dcd079f6cc382b8c1d7f70351&amp;dn=Inked.Angels.DiSC1.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":-1,"time":1378048920,"description":"Category All Sex, Alt Porn \n  \nDirector Kevin Moore \nStarring Juelz Ventura, Mr Pete, Bill Bailey, Michael Vegas, Angelina Valentine, Christy Mack, Kevin Moore, Bonnie Rotten, Romi Rain, Lolly Ink \n\nTatooed 'It Girl' Bonnie Rotten Takes It Ever Which Way In Her Mouth, Pussy And Ass!\n\nBeauties Lolly Ink And Romi Rain Get Down And Dirty In This Tag Team!\n\nChristy Mack Couldn't Look Much Hotter Until You See Her With A Dick Deep In Her Pussy!\n\nJuelz Ventura Has It All - Gorgeous Looks And A Love Of Cock Deep In Her Asshole!\n\nAngelina Valentine Shows Why She's One Of The Filthiest Girls You'll Ever See!\n\nWhen Evil Angel director Kevin Moore sees a modern slut covered in skin art, he suspects she's ready for the big time. Something about a tattooed girl makes certain dicks stand up and salute... maybe it's that these wild party girls and punk-porn sweethearts literally wear their lewd intentions on their sleeves! In 'Inked Angels,' Kevin's new two-disc collection of hard-core gonzo action, six gorgeous and striking sexual outlaws get down and dirty for your pleasure. First, slutty cutie Juelz Ventura gags on a slab of hard meat and gets all her holes stuffed!\n\nNext, two super-busty bitches - blonde bombshell Lolly Ink and curvaceous, black-haired Romi Rain - enjoy a pussy-pounding threesome with Mr. Pete that climaxes in an explosion of cum. Radically illustrated beauty Bonnie Rotten loves having hard cock buried up her ass. Bill Bailey gives her what she needs, invading Bonnie's bunghole with massive dildos, butt-fucking her and showering her pretty face with sperm. Dressed in a tight corset, cartoonishly proportioned Christy Mack services lucky stud Michael Vegas with her talented mouth and well-toned cunt muscles. Christy takes a load of ball juice that drips into the cleavage of her enormous knockers. Finally, outrageous whore Angelina Valentine smokes a cigarette before riding the director's stiff dick as he shoots POV-style. The DVD includes 19 minutes of behind-the-scenes interviews and a bonus blow job from Lolly. Kevin Moore's 'Inked Angels' are true exhibitionists with artistic streaks. \n\n\n &lt;a href=&quot;\nhttp://bayimg.com/FAPbcaAeF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/FAPbcaAeF&lt;/a&gt;","torrent":{"xt":"urn:btih:974fa3d071bad57dcd079f6cc382b8c1d7f70351","amp;dn":"Inked.Angels.DiSC1.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"974fa3d071bad57dcd079f6cc382b8c1d7f70351","infoHashBuffer":{"type":"Buffer","data":[151,79,163,208,113,186,213,125,205,7,159,108,195,130,184,193,215,247,3,81]},"announce":[],"urlList":[]}}