{"title":"Finding Amy - Poppen, Sharon.epub","uid":8874132,"size":92511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98237c036094837e8e9d227b90cff04205e78d00&amp;dn=Finding+Amy+-+Poppen%2C+Sharon.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":1,"time":1378147169,"description":"Recently discharged Viet Nam veteran Danny Lawrence had made it back to Sparta, Texas after serving two years in the Army. Drafted shortly after high school, he was now ready to take his place in the family ranching business, find a wife and start a family.\n\nIt was June 1971 and it seemed everyone had come home for summer. Most of the local girls were already married, but several had gone away to colleges. At a 4th of July dance at the local armory, a former classmate and much sought after high school cheerleader spotted Danny and asked him to dance. She had just finished her junior year at an Ivy League university back east and had brought some friends home for a taste of Texas hospitality. She insisted Danny meet them.\n\nOne look at Amy Harrington swept Danny off his feet. His heart took control. Her three-day visit extended into a week. Danny monopolized her time. The night before she left, he asked her to marry him. Surprisingly, she said yes. All Danny could see ahead was love, happiness and foreverness.\n\nReality had something else in store for Danny and it came in the form of a cold, interfering mother-in-law, a wife who mentally and socially was still a child, and a misguided heart that believed that patience and understanding could make everything all right.\n\nGenre: Romance","torrent":{"xt":"urn:btih:98237c036094837e8e9d227b90cff04205e78d00","amp;dn":"Finding+Amy+-+Poppen%2C+Sharon.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98237c036094837e8e9d227b90cff04205e78d00","infoHashBuffer":{"type":"Buffer","data":[152,35,124,3,96,148,131,126,142,157,34,123,144,207,240,66,5,231,141,0]},"announce":[],"urlList":[]}}