{"title":"A Rising Fall (2nd Edition) for Generic Tablet by C. Sean McGee","uid":8823916,"size":1417642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99297ecdb5f7d01043860a81c2ede32413c716fb&amp;dn=A+Rising+Fall+%282nd+Edition%29+for+Generic+Tablet+by+C.+Sean+McGee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hypercenter666","files":-1,"time":1376779934,"description":"The Re-release of A RISING FALL (CITY b00k 001)\n\nThis has been 8 months in the making, this reworking of the novel. I meant to do it sooner but i got distracting writing 8 more novels. It happens. Now I am in the process of re-editing the novels.\n\nIn this case, a lot of changes were made creating more a more fluent reading experience. A lot of grammar fix ups, some things added and some tings removed. And all new artwork.\n\nThe same will be done for b00k 011; UTOPIAN CIRCUS, which I will start editing next week.\n\n\nA Rising Fall is the first book in a dystopian trilogy entitled City:aliteraryconcerto. \n\nThe story starts ten years after the blackout as a group of humans struggling to fight off a conscious famine, try to re-learn empathy to save humanity in an old industrial assembly plant. \n\nIn 3 days; feigned affection, deception and a black heart will take them further into the repression of their own fears in search of unconditional love. \n\nThe City Concerto through literary prose; answers one question: To what lengths would a father go and what horrible wrongs would he do, to teach a god how to love again?\n\nFollowing the theme of a concerto, City is divided into three parts; A Rising Fall, Utopian Circus and I, Cannibal. Each book is then divided into three pieces and with A Rising Fall, each piece refers to a day; the three days leading to the fall of their city. \n\nThe trilogy illustrates the human emancipation from three states of love; Eros, Philos and Agape as each is torn apart under the guise of well intention as humanity; now void of identity in the wake of a century of dehumanising dependence and necessity upon industry and digital technology; has separated itself from the labour of its existence, aborting empathy and setting in place the death of mother nature. Yet, on the verge of extinction; mankind presses on; towards salvation; towards the city of light and sound; towards New Utopia.\n\nTake Risk and Take Care,\n\nC. Sean McGee\n","torrent":{"xt":"urn:btih:99297ecdb5f7d01043860a81c2ede32413c716fb","amp;dn":"A+Rising+Fall+%282nd+Edition%29+for+Generic+Tablet+by+C.+Sean+McGee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99297ecdb5f7d01043860a81c2ede32413c716fb","infoHashBuffer":{"type":"Buffer","data":[153,41,126,205,181,247,208,16,67,134,10,129,194,237,227,36,19,199,22,251]},"announce":[],"urlList":[]}}