{"title":"How to train your Dragon [1080p]","uid":8974602,"size":1500966897,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9a45da4ce4a0af1c7daffcfcb4568981aae237d1&amp;dn=How+to+train+your+Dragon+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SuberCracker1123","files":-1,"time":1380406052,"description":"The island of Berk is a Viking village that is plagued by attacks from dragons. Hiccup, the awkward son of the village chieftain, Stoick the Vast, shoots down a dragon he thinks may be a Night Fury, a rare dragon nobody has ever actually seen. Hiccup locates the dragon in the forest, but finds he is unable to kill the helpless animal. Hiccup instead cuts it free. Meanwhile, Stoick assembles a fleet to seek out the dragons' nest, but before he leaves, he places Hiccup in dragon-fighting classes taught by Gobber, the village blacksmith.\nSearching the forest, Hiccup finds the dragon trapped in a shallow glade; the dragon's tail was injured, preventing it from flying normally. Hiccup discovers a way to earn the dragon's trust and begins to care for it. He names the Night Fury &quot;Toothless&quot;, for its retractable teeth. Later, Hiccup fashions a makeshift harness and prosthetic tail that allows him to guide the dragon in free flight. Hiccup is able to transfer his knowledge of dragons to the other species of dragons at dragon-fighting class, appearing to conquer each one in battle and becoming the star pupil, much to the dismay of Astrid, a girl in dragon training on whom Hiccup has a crush. Eventually Hiccup completes the class and gets the chance to kill a dragon in front of the entire village. Meanwhile, the battered Viking fleet arrives home.\nLater, Astrid follows Hiccup, and is shocked to discover Toothless. She attempts to escape to tell the rest of the village, but Hiccup takes her for a ride on Toothless. At first, Astrid is terrified, but then begins to enjoy the excursion. However, Toothless unexpectedly joins a flock of dragons and takes the pair straight into the dragon's nest, where they discover the presence of a gigantic dragon named the Red Death.[note 1] The Red Death depends on the food the other dragons bring back, and if the other dragons fail to capture anything, the Red Death feeds on the dragons themselves, which is the reason why the dragons have been looting Hiccup's village. Astrid wants to tell the village of the nest, but Hiccup wants to keep it a secret to protect Toothless, and Astrid reluctantly agrees. Before she heads back, she punches his arm for kidnapping her, and then kisses him on the cheek for &quot;everything else&quot;.\nHiccup is put to his final exam the next day by fighting a Monstrous Nightmare, but when he tries to show the village the dragon's true nature, Stoick stops the fight, inadvertently angering the dragon and endangering Hiccup. Toothless hears Hiccup's scream and flies in to save him, but is captured himself. Hiccup, attempting to explain his actions, reveals how to find the dragons' nest. He tries to warn his father of the danger, but Stoick refuses to listen to his son, demotes Hiccup from being a Viking, disowns him, and leaves with another fleet, using a restrained Toothless as their guide. As Stoick leaves he is shown to be visibly shaken by what he has done. After a heart-to-heart talk with Astrid, Hiccup then concocts a plan to save the Vikings.\nHiccup and his friends arrive on dragons, when the Viking fleet has already discovered the Red Death. Hiccup's classmates distract it while Hiccup attempts to free Toothless. Hiccup and Toothless almost drown, but both are saved by Stoick. Hiccup and Toothless succeed in luring the Red Death into flight, ultimately damaging its wings and then forcing it into an inescapable dive back to earth, killing it in a massive explosion. While attempting to flee from the crashing dragon, Hiccup falls and Toothless dives into the flames after him.\nStoick finds Toothless, who reveals an unconscious Hiccup safely wrapped in his wings. Hiccup wakes up back on Berk. As he leaves his bed, he discovers that his left foot has been amputated and replaced with a prosthesis made by Gobber. His grief is turned to joy, however, as he steps outside to find the Vikings and dragons working together to rebuild their village. He is greeted by everyone, and Astrid rushes to kiss him. The film ends with the war between Vikings and Dragons finally over with Hiccup and his friends racing their dragons.\n\n\nBy SuberCracker1","torrent":{"xt":"urn:btih:9a45da4ce4a0af1c7daffcfcb4568981aae237d1","amp;dn":"How+to+train+your+Dragon+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a45da4ce4a0af1c7daffcfcb4568981aae237d1","infoHashBuffer":{"type":"Buffer","data":[154,69,218,76,228,160,175,28,125,175,252,252,180,86,137,129,170,226,55,209]},"announce":[],"urlList":[]}}