{"title":"Alex Jones Show - 2013 Aug 18 SU [sebaygo1]","uid":8827596,"size":40637139,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9a9746e591259e8a97ac47ac94d11edbce73d29c&amp;dn=Alex+Jones+Show+-+2013+Aug+18+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":9,"time":1376886128,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 18 August 2013\n\n\n[sebaygo1]\n\nShow description from theweb site :: On this Sunday edition of The Alex Jones Show, Alex breaks down the rapidly escalating trend of society and cultural norms melting down and how this disastrous shift in civility will get worse over the short term. Along with dissolving civility and the dissolution of cultural norms, Alex looks at the alarming prospect of imploding birth rates and exploding death rates. \n\nHe also covers the quickly moving situation in Egypt as that strategic North African country erupts in violent anarchy and civil war. \n\nOther subjects on today's broadcast include the mass drugging of our troops by the government, new and expanding attacks on free speech by the politically correct regime in the government and its corporate media propaganda machine, and the scary prospect of a larger and far more deadly and portentous Fukushima disaster.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:9a9746e591259e8a97ac47ac94d11edbce73d29c","amp;dn":"Alex+Jones+Show+-+2013+Aug+18+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a9746e591259e8a97ac47ac94d11edbce73d29c","infoHashBuffer":{"type":"Buffer","data":[154,151,70,229,145,37,158,138,151,172,71,172,148,209,30,219,206,115,210,156]},"announce":[],"urlList":[]}}