{"title":"[AssParade] - Ass Of the Sea","uid":8968353,"size":439062868,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9b4c4589790ca713950bed5ec079c5f69bd9c797&amp;dn=%5BAssParade%5D+-+Ass+Of+the+Sea+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pornmafia","files":-1,"time":1380242468,"description":"Title: [AssParade] - Ass Of the Sea \nSize: 419 MB\nDuration: 00:55:36\nVideo Type: WMV\nResolution: 640 x 480\n\nScreenshots: &lt;a href=&quot;\nhttp://imshare.biz/?pm=M7JY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imshare.biz/?pm=M7JY&lt;/a&gt;\n\nYou ain't gonna believe what we got for you this week on assparade!! So check it, this weeks episode has a tremendous back story, and I'm about to drop it for you all cause it's well worth the ass, uh I mean the wait. this story goes a little like this, a few days back I took some girls and JMac out on my homies yacht, for some hardcore partying, everything was going as usual until I blacked out. So a few hours later, these two hot lifeguards woke me up on an desserted island. Just my luck these girls were hot as fuck. Once I knew I was fine I had them go look for JMac, and damn as soon as the walked away I got a good look as those two gorgeous asses, damn these life guard have the bomb booty. So the girls went off on their boat, and I'm sure they did some serious as worshiping on the boat, their tiny thongs made their asses look huge. Britney and Lexi are some serious lifeguard, they found Jmac in the Ocean and they hooked him up with a sloppy double blowjob on the deck of their boat. The girls finally got back to the island and we did some assworhiping all over the island. Then they found Jmac, he got some more head and he then fucked the shit out of these big booty chicks, I love big bubble butts!! This shoot was crazy, and I know you all gonna love it!! Enjoy! ","torrent":{"xt":"urn:btih:9b4c4589790ca713950bed5ec079c5f69bd9c797","amp;dn":"%5BAssParade%5D+-+Ass+Of+the+Sea+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4c4589790ca713950bed5ec079c5f69bd9c797","infoHashBuffer":{"type":"Buffer","data":[155,76,69,137,121,12,167,19,149,11,237,94,192,121,197,246,155,217,199,151]},"announce":[],"urlList":[]}}