{"title":"Becoming a Faster Swimmer","uid":8888924,"size":5599261155,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9c3ffd2c4b5f47c50035d5689dc84e56d5b72f59&amp;dn=Becoming+a+Faster+Swimmer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tz2000","files":-1,"time":1378535541,"description":"Becoming A Faster Swimmer: Vol. 1 - Freestyle DVD   1h44m\n\n  Races are often decided by fractions of seconds, so attention to detail is imperative. In this DVD, Five-Time Olympic Gold Medalist and former 50 meter World Record holder Tom Jager teaches a young swim team the essential details of the freestyle stroke. He shares several important training tips and drills that will help swimmers of all levels. The topics covered in this program include: sculling, streamlining, kicking, head position, body position, arm position, breathing, and more. 100 minutes. 2004. The Special Features section provides additional tips and advice for swimmers, parents, and coaches.\n\nBecoming A Faster Swimmer: Vol. 2 - Backstroke DVD   39m\n\n  In this informative DVD, five-time Olympic Gold Medalist Tom Jager teaches a young swim team how to become successful competitive backstroke swimmers. Jager presents a progressive system of techniques, training methods, and drills designed to develop the most efficient backstroke possible. The topics covered in this program include: streamlining, body-positioning, kicking techniques, head position, arm and hand positions, developmental drills, common errors and corrections, and more. 40 minutes. 2005. The Special Features section provides additional tips and advice for swimmers, parents, and coaches.\n\nBecoming A Faster Swimmer: Vol. 3 - Breaststroke DVD   35m\n\n  In this DVD, five-time Olympic Gold Medalist Tom Jager details the essential aspects of the breaststroke technique. Jager teaches a young swim team the techniques, training methods, and drills needed to become a faster competitive swimmer. The topics covered in this program include: streamlining, body-positioning, kicking techniques, head position, recovery technique, developmental drills, common errors and corrections, and more. 35 minutes. 2005. The Special Features section provides additional tips and advice for swimmers, parents, and coaches.\n\nBecoming A Faster Swimmer: Vol. 4 - Butterfly DVD  35m\n\n  In this DVD, five-time Olympic Gold Medalist Tom Jager teaches a young swim team training tips and drills designed to develop a faster competitive butterfly stroke. The topics covered in this program include: undulation and developmental drills; streamlining, body and head positioning; kicking, recovery and breathing techniques; common errors and corrections, and more. 35 minutes. 2005. The Special Features section provides additional tips and advice for swimmers, parents, and coaches.\n\nBecoming A Faster Swimmer: Vol. 5 - Starts, Turns, and Finishes for All Strokes DVD  1h12m\n\n  The starts, turns and finish are about 40% of competitive swimming. These important aspects of swimming are often the difference between or losing a race. In this comprehensive DVD, Tom Jager covers the essential details of starts, turns, and finishes for the freestyle, breaststroke, butterfly, and backstroke. This informative program will benefit swimming coaches and swimmers at all developmental levels. It will also help to make practices more productive and competitions more successful. 72 minutes. 2005.\n\nExtras\n\n * Tips for Coaches\n * Tips for Parents\n * Tips for Swimmers\n\nAbout the Instructor: For nearly a decade, Tom Jager was the world record holder in the 50 Meter Freestyle. Tom competed in the 1984, 1988, and 1992 Olympic games, and earned five Gold Medals, one Silver Medal, and one Bronze Medal. Currently, Tom is the head coach for the women's swimming team at the University of Idaho. ","torrent":{"xt":"urn:btih:9c3ffd2c4b5f47c50035d5689dc84e56d5b72f59","amp;dn":"Becoming+a+Faster+Swimmer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c3ffd2c4b5f47c50035d5689dc84e56d5b72f59","infoHashBuffer":{"type":"Buffer","data":[156,63,253,44,75,95,71,197,0,53,213,104,157,200,78,86,213,183,47,89]},"announce":[],"urlList":[]}}