{"title":"-&gt; Recommended Reading Roundup for 2013.08 &lt;-","uid":8896780,"size":294453588,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9cf67856cd408fad680eada3b5199380d5261803&amp;dn=-%26gt%3B+Recommended+Reading+Roundup+for+2013.08+%26lt%3B-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TPB-RRR","files":7,"time":1378720017,"description":"This is the inaugural issue of what may or may not become a regular feature of TPB's Comics section: The &quot;Recommended Reading Roundup&quot;.\n\nSimply put, the torrent rounds up comics which the contributing uploaders consider particularly worthwhile reads, and worth recommending to others (see what I did there). Those may be comics which were first released during the given month, or comics which were re-released or scanned or ripped then, or just comics which the contributors happened to read then. What matters is that they stood out from the crowd, for one reason or another.\n\nAdditional information, particularly on how to participate in next month's roundup, will be posted in the comments section below in due course. For now, without further ado, here are our recommendations for August 2013, accompanied by a brief, hopefully interest-piquing overview/review if the uploader felt so inclined:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/gesserit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/gesserit&lt;/a&gt;  -  Ballistic #1 (2013)\n&quot;First issue of a new creator-owned series written by Adam Egypt Mortimer and illustrated by Darick Robertson. Mortimer is a newcomer, Robertson a veteran (though I can't claim to have been familiar with the name before).\nGenre-wise, I'd call this sci-fi/neo-noir (think 'Blade Runner'). Or perhaps 'neon-noir' might be a better term here, as the artwork relies on intense colors throughout, as opposed to the subdued or monochromatic palette conventionally used to evoke the familiar noir atmosphere.\nThe same contrast exists between the plot, which is on the grimy, violent, in-your-face side of things, and the backdrop against which it is set, which has a quite remarkable degree of depth and intricacy - to the point that the writer felt the need to elaborate on a range of minutiae in a several-page-long appendix. I tried to think of a collaboration of writers from who one might expect something in this vein, and the result was 'Mark Millar meets Carla Speed McNeil' - for whatever that's worth!&quot;\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/id4keeper&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/id4keeper&lt;/a&gt;  -  The Walking Dead #1 (2003)\n&quot;The comic i want to recommend will seem a bit of odd choice you may think, that choice is The Walking Dead Issue 1, of which hit TV show the walking dead is based on. I was lucky to pick up Image Firsts of which they reprinted the first issue and for only $1.00 its worth having a look.\nSo what is the walking dead if you not since either the Comic or the TV series. Issue one follows Office Rick Grimes who wakes up on a hospital bed after being shot in chest while on duty and what follows is a &quot;28 days later&quot; as Rick looks for anyone in the hospital only to walk into a room full of zombies........\nWhat is striking about this series is that is the none use of colour, maybe that's to mask the red blood needed which would up the rating of the comic. Yet while its in black and white it just seems right and looks lovely if you have a hard copy reading it on the tablet or PC doesn't do it justice.&quot;\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/RubrumPopulus&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RubrumPopulus&lt;/a&gt;  -  Trillium #1 (2013)\n&quot;First issue of the new Jeff Lemire Vertigo series.&quot;\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/STFmaryville&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/STFmaryville&lt;/a&gt;  -  Fantastic Four #5 (1962)\n&quot;#5 of the classic Lee-Kirby series is awesome not only for the intro of Dr. Doom, but also for the wtf moment of the Thing as Blackbeard.&quot;\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Wanderer/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Wanderer/&lt;/a&gt;  - The Incredible Hulk #300 (October, 1984)\nThe start of an amazing adventure of the Hulk in Crossroads,  a mystical dimension whose only purpose is to lead its inhabitants to other dimensions. Endless paths lead to a multitude of dimensional portals, each portal being a reflection of the world beyond (i.e. the portal to an ocean world may appear as a shimmering pool of water, or the portal to a world of fire may be flanked with flames). Certain scientific constants such as spacial relationships, time, and gravity hold no absolutes in the Crossroads. Beyond the paths and the portals is a seemingly infinite void, but if one should venture into this void, they will eventually find themselves right back amidst the myriad of paths and gateways.\nIn the center of the Crossroads is a signpost. Arms are sculpted into the post, each one presumably representing the different races of each world accessible via the Crossroads. The Signpost, if destroyed, will always regenerate itself. ","torrent":{"xt":"urn:btih:9cf67856cd408fad680eada3b5199380d5261803","amp;dn":"-%26gt%3B+Recommended+Reading+Roundup+for+2013.08+%26lt%3B-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cf67856cd408fad680eada3b5199380d5261803","infoHashBuffer":{"type":"Buffer","data":[156,246,120,86,205,64,143,173,104,14,173,163,181,25,147,128,213,38,24,3]},"announce":[],"urlList":[]}}