{"title":"Slutty.And.Sluttier.19.XXX.DVDRip.x264-XCiTE","uid":8615607,"size":1934118500,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9dbcabb8e5b753ca7026eeb63b6d00e896633b75&amp;dn=Slutty.And.Sluttier.19.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":5,"time":1372244172,"description":"Some guys are drawn to girls with a special quality of uninhibited sexuality, a shameless animal magnetism that screams, 'Fuck me!' In a word: Sluttiness. Slutty &amp; Sluttier # 19 DVD video Evil Angel director Manuel Ferrara is compelled to capture these exceptional ladies at their most debauched and cock-crazed, and in his 'Slutty and Sluttier 19,' the legendary French stud has hit the nympho jackpot. Slutty &amp; Sluttier # 19 movie The four gorgeous starlets in his amazing cast are insatiably nasty and eager for all kinds of filthy porn action. Bikini-clad blonde bombshell Anikka Albrite is hosing off her car - and her phat, juicy booty - on a hot afternoon. She joins Manuel for some heavy petting, intense deep-throat cocksucking and passionate fucking!\n\n Erik Everhard is infatuated with busty, tattooed Christy Mack, a reserved lady at the office with a bad-girl aura about her. Later, he books a hooker from an outcall service; when Christy shows up, she uses her professional skills to service his giant dick... and gets paid in creamy sperm. Kiara Mia, a thick, tanned and curvy brunette MILF, gets her shaved pussy pounded by the director and takes a creamy load on her plump melons. And slender, pale, young beauty Nikita Bellucci enjoys some anal attention and a fierce, interracial double-penetration via the enormous cocks of Karlo Karrera and Lexington Steele. After having all her holes stuffed with throbbing pricks, Nikita is rewarded with a shower of cum. The exquisite girls of 'Slutty and Sluttier 19' never let social convention or political correctness interfere with their naked lust!\n\n\n\n Anikka Albrite, Christy Mack, Kiara Mia, Manuel Ferrara, Erik Everhard, Lexington Steele, Karlo Karrera, Nikita Bellucci\n\n\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=sluttyands.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=sluttyands.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=sluttyvxv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=sluttyvxv.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:9dbcabb8e5b753ca7026eeb63b6d00e896633b75","amp;dn":"Slutty.And.Sluttier.19.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dbcabb8e5b753ca7026eeb63b6d00e896633b75","infoHashBuffer":{"type":"Buffer","data":[157,188,171,184,229,183,83,202,112,38,238,182,59,109,0,232,150,99,59,117]},"announce":[],"urlList":[]}}