{"title":"This Day Burns mp3","uid":8871092,"size":258536544,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9e38c25447c63d2f7c12b5df9383ff3c8e944bb0&amp;dn=This+Day+Burns+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Fisthat","files":7,"time":1378065852,"description":"This Day Burns is a band with a unique approach to song writing and performance. They have found a way to unconventionally express music from many perspectives. Each member switches and plays an array of instruments through out the writing and performing process, giving them the ability to collaborate music on a different level. Their sound can only be described as diverse, unpredictable and energetic.\n\nThis Day burns was formed in summer of 2010 in the wake of Victoria based hard-rock band Saul. Band members Chris Heretic and Jon Sinclair found bassist Matt Williams (Funk Vigilante) during their search for a new member to begin the project.\n\nThe three members found vocalist Jasmine Wietzke (Before the Storm) through a craigslist ad she posted. A few jams later, they solidified the line-up and decided it was time to move forward.\n\nSince the band formed they have released a 6 song self-titled record and played numerous Vancouver Island shows. They have shared the stage with bands such as Death By Stereo and Vancouver based Ninjaspy. This Day Burns was also featured in Live n' Unsigned's Victoria Top 3 Bands for May 2013. \n\nThis Day Burns singer/bassist/drummer/guitarist Matt Williams decided to leave the band to pursue other goals in May of 2013. It was not long before Skye McLean (Robot Metropolis, Archon Legion) was approached by the band and added to the ranks. \n\nThe band hopes to continue to write and record music in smaller batches, releasing music more frequently to stay fresh and exciting in a fast-moving and ever changing industry. \n\nThis Day Burns work ethic, variety of sound and adaptable live show will make them a band to watch as they grow and progress. One day, they want to play music for a living and reach out to new fans every where.\nDescription","torrent":{"xt":"urn:btih:9e38c25447c63d2f7c12b5df9383ff3c8e944bb0","amp;dn":"This+Day+Burns+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e38c25447c63d2f7c12b5df9383ff3c8e944bb0","infoHashBuffer":{"type":"Buffer","data":[158,56,194,84,71,198,61,47,124,18,181,223,147,131,255,60,142,148,75,176]},"announce":[],"urlList":[]}}