{"title":"Haunted Tails","uid":8940448,"size":764221481,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9fa8e8e78623a76d4c498afdf638b54d0c9d72b8&amp;dn=Haunted+Tails&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DDD82","files":3,"time":1379647883,"description":"Starring: Domonique Simone, Candy Apples, Jewel Valmont, Dolly Golden, Nancy Vee, Champagne, Dave Hardman, Herschel Savage, T.T. Michaels, Mark Barrow, Roy Shaft.\nRated: XXX\nFetish: Satanic Erotica\nShips: Check Inventory\nRun Time: 90 min.\nReleased: 4/16/2002\nBy: Heatwave Video\n\nHaunted Tails Description: &quot;A totally silly, but kind of fun, tangled web of ghost stories. The first tale is of a grief-striken bride who never had her wedding consummated. In the middle of the night a gravedigger (Dave Hardman) is at work. Up walks the ghost bride. She falls to her knees and shoves Dave's dick down her throat. Dave fucks her on a headstone and streams cum on her face as she disappears in a puff of smoke. Next a buxom blond tells Mark a tale of a brothel. The townsfolks killed its two black ho's and to this day they still haunt the place, which is the house Mark now lives in. They fall asleep. Champagne and Dominique Simone, two of black porn's biggest stars, are the postitutes. Lying on a white bed in a darkened room they call Mark to them from his dream. Mark takes a turn in each pussy. One of Mark's friends shows up at the house, a demon bitch confronts him, he fucks her up the ass as she screams her approval. A puff of smoke and Dominique is on a couch with a white stud sexing him up. Another puff of smoke and Dave joins in. Dominique licks some asshole then takes both dicks in a hot d.p. scene. The story ends with the houseguest's dick in the big tit blond ghost's mouth, pussy and asshole.&quot; ","torrent":{"xt":"urn:btih:9fa8e8e78623a76d4c498afdf638b54d0c9d72b8","amp;dn":"Haunted+Tails","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fa8e8e78623a76d4c498afdf638b54d0c9d72b8","infoHashBuffer":{"type":"Buffer","data":[159,168,232,231,134,35,167,109,76,73,138,253,246,56,181,77,12,157,114,184]},"announce":[],"urlList":[]}}