{"title":"Attack On Titan (Shingeki no Kyojin)","uid":8968204,"size":13971269366,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a0ed756932d5dc21c36798cbd83cb0ed77a8fe8f&amp;dn=Attack+On+Titan+%28Shingeki+no+Kyojin%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Marto101","files":24,"time":1380281269,"description":"All Files in Japanese Language and English Subbed.\nAll Files are In VLC Format.\nAll Files are (720p - 1080p) in Size.\n\nThis is the first time I have ever Uploaded to UTorrent, So Please don't be dissapointed if I did something wrong, Just tell me and I will try to Fix it.\nI have compiled a List of the First 24 Episode's that I Downloaded from several Different Hosts, So Text in Subs Will Be Different Style's\n\nThe series follows the story of Eren Yeager, his adopted sister Mikasa Ackerman, and their friend Armin Arlert. After the outermost Wall is breached by Titans, including the 60-meter tall skinless Colossus Titan and the abnormally intelligent Armored Titan, and his mother dying in the resulting destruction, Eren vows revenge against the Titans and later enlists in the military, accompanied by Mikasa and Armin. Years later during his first battle against the Titans, Eren discovers that he has the ability to transform into a Titan at will. Seen as a threat to mankind by some, and as a ray of hope by others, Eren joins his companions in a desperate fight to protect what remains of their society while looking for answers to the mysteries surrounding the Titans, the Walls, and his own existence as well.","torrent":{"xt":"urn:btih:a0ed756932d5dc21c36798cbd83cb0ed77a8fe8f","amp;dn":"Attack+On+Titan+%28Shingeki+no+Kyojin%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0ed756932d5dc21c36798cbd83cb0ed77a8fe8f","infoHashBuffer":{"type":"Buffer","data":[160,237,117,105,50,213,220,33,195,103,152,203,216,60,176,237,119,168,254,143]},"announce":[],"urlList":[]}}