{"title":"Fallout.1999.DVDRip.720x480.Xvid.Avi","uid":8957974,"size":919719751,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a2aa4a1f8580f170de434888bfcef3f8148c9917&amp;dn=Fallout.1999.DVDRip.720x480.Xvid.Avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ollies112","files":2,"time":1380041108,"description":"NASA and its Soviet-Russian counterpart prepare another mission to the permanent space station. Highly experienced J.J. 'Jim' Hendricks, headstrong at simulator tests, has all qualifications for his bid to became the captain, but after refusing to justify his crash piloting a private airplane is refused command till he carries out his threat to resign altogether. The Russians are preoccupied with an internal problem, a military operation against Tadjikistan, also the home of Captain Previ Federov, who says only his gratitude to America, where he studied too, for making his boyhood dream of space travel come true outweighs his patriotic and personal concerns. Once in position, Federov, who was in league with two other crew members, manages to seize to station, even brought nuclear arms to blackmail the US with a horrendous ultimatum: get Russia to leave Tadzikistan or major US cities will be obliterated, explode the station isn't healthy either. Now the only way to get on board is an experimental craft, and only one man might be able to pilot such a mission","torrent":{"xt":"urn:btih:a2aa4a1f8580f170de434888bfcef3f8148c9917","amp;dn":"Fallout.1999.DVDRip.720x480.Xvid.Avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2aa4a1f8580f170de434888bfcef3f8148c9917","infoHashBuffer":{"type":"Buffer","data":[162,170,74,31,133,128,241,112,222,67,72,136,191,206,243,248,20,140,153,23]},"announce":[],"urlList":[]}}