{"title":"Elvis Presley- The Gospel Music Of Elvis Presley","uid":8956570,"size":140104616,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a42a9fd8ce747b142c2f09272582826e12fa06ad&amp;dn=Elvis+Presley-+The+Gospel+Music+Of+Elvis+Presley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"theclonedmonkey","files":20,"time":1380009523,"description":"Featuring more than forty of Elvis' gospel songs, He Touched Me: The Gospel Music Of Elvis Presley explores his faith and the prominent role that gospel music played throughout his life as witnessed by those who knew him well. Anecdotes, by Gospel greats Ed Enoch (The Stamps), the late J. D. Sumner (The Stamps), Jake Hess (The Imperials), Myrna Smith (The Sweet Inspirations), Ray Walker (The Jordanaires) and many more, trace Elvis' Gospel roots and are skillfully interwoven with performances of Elvis singing Gospel music. Disc One includes: Crying In The Chapel, His Hand In Mine, Joshua Fit The Battle, So High, If We Never Meet Again, Milky White Way, Stand By Me, Somebody Bigger Than You And I, I Believe In The Man In The Sky, In The Garden, Mansion Over The Hilltop, Farther Along, Where No One Stands Alone, I'm Gonna Walk Dem Golden Stairs, Without Him, Working On The Building, You'll Never Walk Alone, Swing Down Sweet Chariot, Where Could I Go But To The Lord, In The Ghetto Disc Two includes: (There'll Be) Peace In The Valley (For Me), I Believe,Take My Hand, Precious Lord, It Is No Secret (What God Can Do), I, John, Bosom Of Abraham, You Better Run, Lead Me, Guide Me, Turn Your Eyes Upon Jesus / Nearer My God To Thee, He Touched Me, I've Got Confidence, Amazing Grace, A Thing Called Love, Put Your Hand In The Hand, Reach Out To Jesus, If That Isn't Love, Bridge Over Troubled Water, An American Trilogy, Why Me Lord, How Great Thou Art\n\n\n***PLEASE SEED***","torrent":{"xt":"urn:btih:a42a9fd8ce747b142c2f09272582826e12fa06ad","amp;dn":"Elvis+Presley-+The+Gospel+Music+Of+Elvis+Presley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a42a9fd8ce747b142c2f09272582826e12fa06ad","infoHashBuffer":{"type":"Buffer","data":[164,42,159,216,206,116,123,20,44,47,9,39,37,130,130,110,18,250,6,173]},"announce":[],"urlList":[]}}