{"title":"Paul Allih - Lost Cries From The Emerald Triangle","uid":8985238,"size":1803188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a49c5affffab32fa51a1eddf2b14e20f0091dcd6&amp;dn=Paul+Allih+-+Lost+Cries+From+The+Emerald+Triangle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Blort1219","files":4,"time":1380655161,"description":"This torrent includes a PDF, word, Epub, and Mobi files.\n\nThank you... enjoy and Seed!\n\n\n\nSynopsis:\n\nIn 1996 the Willis' and their friends were harvesting the good life. Secluded in the mountains of Northern California, they lived like simple farmers and ignored the rat race. They existed like many in working hard and paying their taxes. Unlike the majority, they were making their livelihood growing medicinal marijuana.\n\nIn the blink of an eye, their harmony becomes shattered when Thomas Willis mistakenly shoots a federal agent. Barricading themselves in their home out of fear, the events quickly spiral out of control into a grueling thirteen day standoff. Armed with simple rifles and homemade weapons, they bide their time in a house with no electricity. Tormented by their would-be captors outside, Thomas decides to keep a journal, and page by page he documents the daily struggle of being imprisoned in his own home.\n\nAs the farming colony faces an uncertain fate, Thomas comes to the conclusion that he must get his son to safety before it is too late. ","torrent":{"xt":"urn:btih:a49c5affffab32fa51a1eddf2b14e20f0091dcd6","amp;dn":"Paul+Allih+-+Lost+Cries+From+The+Emerald+Triangle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a49c5affffab32fa51a1eddf2b14e20f0091dcd6","infoHashBuffer":{"type":"Buffer","data":[164,156,90,255,255,171,50,250,81,161,237,223,43,20,226,15,0,145,220,214]},"announce":[],"urlList":[]}}