{"title":"Alex Jones Show - 2013 Aug 22 TH [sebaygo1]","uid":8839846,"size":62116677,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a8ea7f7a15c229cd3bfb7fbb09ba3e6a00fdbd43&amp;dn=Alex+Jones+Show+-+2013+Aug+22+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1377213947,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 22 August 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: Alex covers the move toward war against Syria following a questionable chemical attack on this Thursday, August 22 edition of The Alex Jones Show. Alex talks about the suspicious character of the alleged attack in Damascus, including telltale signs a video of victims may be staged, and Russia's contention the entire event is an orchestrated provocation and a false flag event. \n\nAlex also covers news that Michael Hastings, the assassinated journalist who went after the Pentagon and the CIA, feared his Mercedes was tampered with prior to the &quot;accident&quot; that claimed his life. \n\nOn today's show, Alex welcomes back in-studio San Antonio attorney Jamie Balagia, co-author of Texas DWI Survival Guide: A Citizen's Protection Manual, a book designed to help protect the average citizen from over zealous DWI enforcement.\n\nNot mentioned in the official show description, dentist Corey Gold is Alex's third hour guest. Gold is affiliated with Youngevity, manufacturer of many of the products sold at InfowarsHealth.com.\n\nAudio problems in the second hour were native to the GCN podcast file.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:a8ea7f7a15c229cd3bfb7fbb09ba3e6a00fdbd43","amp;dn":"Alex+Jones+Show+-+2013+Aug+22+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8ea7f7a15c229cd3bfb7fbb09ba3e6a00fdbd43","infoHashBuffer":{"type":"Buffer","data":[168,234,127,122,21,194,41,205,59,251,127,187,9,186,62,106,0,253,189,67]},"announce":[],"urlList":[]}}