{"title":"Beth Nielsen Chapman - Look [2005] [FLAC]","uid":8866428,"size":265283363,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a989d22908a14fa53b5f155ad0009dce4adeea90&amp;dn=Beth+Nielsen+Chapman+-+Look+%5B2005%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":13,"time":1377921500,"description":"Artist:Beth Nielsen Chapman\nRelease:Look\nReleased: 2005\nLabel: Compass Records\nCatalog#: 7 4404 2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:country\n\nTrying to Love You\nRight Back Into the Feeling\nLook\nFree\nTouch My Heart\nTime Won't Tell\nWill and Liz\nWho We Are\nYour Love Stays\nThe Reason\nI Find Your Love\n\nLook is the album Beth Nielsen Chapman was working on when she released Hymns (part of her long-term project documenting the world's religious music). One of her finest qualities as an artist is that you can see exactly where she's at in each album. Unlike most songwriters, she makes no attempt to mask or detach herself from her own life in her work. Look is a collection of solidly constructed, emotionally taut love songs that examines a relationship from its initial attraction to its full fruition to its dissolution and back again. And while these are deeply romantic tunes, they are far from giddy or sentimental. Chapman co-produced Look with Peter Collins, and Annie Roboff. She collaborated with a group of fine songwriters, too, including Harlan Howard, Eric Kaz, Roboff, Patrick Doyle, Bill Lloyd, David Wilcox, and even Andy Bey. It's a big, wide-open record that rings even in its quietest moments. It sounds more like Franklin, Tennessee than Nashville. These 11 songs run the gamut from the spare pop balladry of the opener &quot;Trying to Love You&quot; -- an awesome testament to the graininess of love's stages in the everyday life of a committed couple -- to the finger-popping R&amp;B of &quot;Right Back Into the Feeling&quot; that celebrates the fun in passion. It's one of two tracks on which Michael McDonald contributes backing vocals. &quot;Free,&quot; written with Roboff, is a rhythm-driven rocker as testament to personal liberation with an African backbeat. &quot;Time Won't Tell,&quot; written with Howard, is an honest to goodness country song, and it's one of the collection's stellar tracks. A broken love song, Chapman's water-like vocal is backed by a lilting pedal steel, and open, reedy acoustic guitars, John Catchings' cello and McDonald's backing vocal. They help crack open the emotion from the song's core and bring it to the fore, letting it fall freely. Look is another leap forward in aesthetic excellence for a diverse, savvy songwriter who never flinches in exposing the vulnerable, the dark, and the difficult while never giving into them, instead surrounding them with streams of light and a wonderful ability to share these things with consummate craft and accessibility. Look is full of grace and mystery.","torrent":{"xt":"urn:btih:a989d22908a14fa53b5f155ad0009dce4adeea90","amp;dn":"Beth+Nielsen+Chapman+-+Look+%5B2005%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a989d22908a14fa53b5f155ad0009dce4adeea90","infoHashBuffer":{"type":"Buffer","data":[169,137,210,41,8,161,79,165,59,95,21,90,208,0,157,206,74,222,234,144]},"announce":[],"urlList":[]}}