{"title":"Turnaround-Turning_Fear_into_Freedom-David_Russ,_Chris_McCarthy","uid":8783913,"size":627756686,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:aaea7a13e574d54b174bcc4a6a07197c4c1e9587&amp;dn=Turnaround-Turning_Fear_into_Freedom-David_Russ%2C_Chris_McCarthy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rehcasir","files":121,"time":1375778558,"description":"Turnaround: Turning Fear Into Freedom\n14 CDs (as MP3) &amp; 71pp Workbook (as PDF)\nDavid Russ, Ph.D &amp; Christopher McCarthy, M.Ed\nPub April 1, 2010\nISBN-10: 0982238002 | ISBN-13: 978-0982238004\n\nTurnaround is a complete step-by-step audio program which provides you and your child life-changing help for anxiety including panic attacks, obsessive compulsive disorder, social anxiety, separation anxiety, generalized anxiety, phobias and other childhood worries. Turnaround is unique because it communicates directly to children without sacrificing psychological substance. The result is an ingenious blend of proven clinical treatment with an adventurous tale bristling with curious characters, inspirational stories and the know-how needed to overcome anxiety. Your child is being treated for anxiety as they listen to a fun story! More importantly, it works!\n\nTurnaround is a do-it-yourself program that your child can complete with minimal help. Parents are encouraged to listen along, but the program is crafted directly for a child. This program is also a natural compliment to existing counseling or medical treatment.\n\nTen audio CDs parallel each day of the adventure and form the foundation of the program. A 74 page companion journal full of creative games, tasks and questions will help your child soak in and personalize what they hear. Turnaround invites your child to join 6 other anxious children on an imaginary 10-day hiking trip with two Docs and a mentor teen named Emily. These children struggle with anxiety disorders such as generalized anxiety disorder (GAD), panic attacks, perfectionism, obsessive-compulsive disorder (OCD), separation and social anxiety. The children learn from Dr. David, Dr. Chris and Emily. They also meet imaginary characters and hear stories from many other children who learned to conquer their fears.\n\nEvery element of the program is artistically and scientifically designed to appeal to and positively influence your child. A new and imaginative child-friendly vocabulary will give you and your child a shared language. Cognitive Behavioral Therapy (CBT) is the treatment of choice for anxiety no matter what age. The program is solidly based on CBT and clinical experience. There are great explanations of CBT available in many books. However, what has never been done is presenting this treatment to children directly, by other children, and from the point of view of a child. You can have the finest treatment in the world but it won t help if a child does not understand or connect to it. Turnaround solves this long-standing problem.\n\nThe authors, Psychologist Dr. David Russ and Licensed Professional Counselor Christopher McCarthy, have over 30 years of combined experience treating anxiety. They brought to Turnaround professional actors and director, a top-tier audio producer, nationally known designer and illustrator, skilled editor and a published musician. In other words, Turnaround is on par with the entertainment your kids are used to hearing. Set aside your assumptions, you have never heard anything like this program. It is a complete paradigm shift in treating childhood anxiety. Turnaround is recommended for children ages 6 to 12. The Turnaround Audio Program includes: 10 CD Audio Program, 74 page Companion Journal, Chill Kit CD (relaxation and breathing guide), 2 CD Parent Information and Guide and a Bonus CD with a comprehensive interview about medication and health related issues with James Lee, MD (Neuropsychiatrist).\n","torrent":{"xt":"urn:btih:aaea7a13e574d54b174bcc4a6a07197c4c1e9587","amp;dn":"Turnaround-Turning_Fear_into_Freedom-David_Russ%2C_Chris_McCarthy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaea7a13e574d54b174bcc4a6a07197c4c1e9587","infoHashBuffer":{"type":"Buffer","data":[170,234,122,19,229,116,213,75,23,75,204,74,106,7,25,124,76,30,149,135]},"announce":[],"urlList":[]}}