{"title":"Alfred Hitchcock Hour Season 1 (Disc 8 of 8)","uid":9034404,"size":8327213393,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aafa19197a00eb3e6b822dfa9fc46ebef075ec1a&amp;dn=Alfred+Hitchcock+Hour+Season+1+%28Disc+8+of+8%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"BoogieMan57","files":-1,"time":1381480595,"description":"* imdb rating: 8.1/10\n* Full DVD quality\n* PAL (720p x 576p)\n* 4:3 Aspect Ratio\n* 25 frames per second\n* VIDEO: 9800 Kbps\n* AUDIO: AC3 224 Kbps, 48 kHz, Stereo\n* ENGLISH AUDIO only, no sub-titles\n* UNTOUCHED except for making Region-Free\n\n~~~~~~~~~~~~~~~~~~~\n\nA continuation of the dramatic anthology series hosted by the master of suspense and mystery. When the series Alfred Hitchcock Presents was revived in 1962, the name was changed, but the format stayed fairly true to the original. In each episode, viewers would be strung along with the story, never knowing which way the final twist would turn.\n\nLegendary director and story-teller Alfred Hitchcock set the benchmark for all TV mystery series to come with his groundbreaking classic television series ALFRED HITCHCOCK PRESENTS, remaining an indelible part of popular culture. No one equaled his talent for presenting viewers with stories of murder, mystery and the macabre that had an unforeseen kick in the 'tale'.\n\nWith the format being limited to short story-telling, rather than progress to an Eighth Season of the half-hour series, Hitchcock returned with an expanded format titled THE ALFRED HITCHCOCK HOUR. Stories were given more scope, but all the hallmarks viewers had come to love remained faithful and the series went from strength to strength running a further three years.\n\nNow, for the first time anywhere, the entire deliciously murderous First Season of THE ALFRED HITCHCOCK HOUR is available on DVD, all 32 stories presented by the master of suspense himself. Join an incredible who's who of guest stars including James Mason, Robert Redford, Vera Miles, Peter Falk, Jayne Mansfield, Angie Dickinson, Tony Randall, John Forsythe, Peter Graves, Gene Barry, William Conrad, Bob Crane, Dean Stockwell, Diana Dors, Dabney Coleman, Gig Young and many more as they become the puppets in Hitch's theatre.\n\nVoted as one of &quot;The 100 Best TV Shows of All-Time&quot; by Time magazine, tune in once more to the master storyteller with some of the most deliciously wicked and chilling television ever aired and discover why THE ALFRED HITCHCOCK HOUR remains one of the most beloved series ever made. \n\nDISC 8:\n-------)\n29 &quot;The Dark Pool&quot; (Lois Nettleton, Anthony George\n30 &quot;Dear Uncle George&quot; (Gene Barry, John Larkin, Dabney Coleman)\n31 &quot;Run for Doom&quot; (John Gavin, Diana Dors, Scott Brady)\n32 &quot;Death Of A Cop&quot; (Victor Jory, Peter Brown, Richard Jaeckel)\n\n\nWill seed all discs in this set until approx. 2:1 ratio and then drop off seeding to be able to upload more of the Alfred Hitchcock Hour.\n\n\n===\n** This torrent also includes 600 dpi scans of the 5 disc labels, the booklet included with the box set, the box insert and the case.","torrent":{"xt":"urn:btih:aafa19197a00eb3e6b822dfa9fc46ebef075ec1a","amp;dn":"Alfred+Hitchcock+Hour+Season+1+%28Disc+8+of+8%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aafa19197a00eb3e6b822dfa9fc46ebef075ec1a","infoHashBuffer":{"type":"Buffer","data":[170,250,25,25,122,0,235,62,107,130,45,250,159,196,110,190,240,117,236,26]},"announce":[],"urlList":[]}}