{"title":"Fifty Shades Effed - Phil Torcivia","uid":8847886,"size":129555,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab203182534c0c0389b2f36cf80eccd1ac7b622f&amp;dn=Fifty+Shades+Effed+-+Phil+Torcivia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"ZamKhan","files":-1,"time":1377449093,"description":"When silver-chinned blogger, Mormon Silver, first met the horny and hungry young entrepreneur, Beatrice Plastique, it ignited a boff-fest that left mattress stains and sore hineys. Frightened, curious, and still hardened by Bea's twisted erotic tastes, Mormon struggles to keep up. Determined to match her raging sexual desire, he turns to ED medicine and adult toys. \n\nNow, Bea and Mormon have it all: syrup, toe-curling orgasms, and a world of freaky kinkery ahead. But, Mormon knows that peeling her away from her evil grandmother and douchie ex, Chris, will pose challenges he could never expect. Mormon must somehow learn to participate in Bea's fetishes without serious injury. And, Bea must overcome her desire to hip-check Mormon into the third row of an skating rink and screw him senseless. \n\nJust when it seems all is well, their murmuring together will cause bystanders to point and say ew, banks will threaten foreclosure, and a single blog post will determine their fate. \n\nAbout the Author Phil Torcivia is a bestselling author of humorous books and parodies. He lives in San Diego and is admittedly one relationship disaster away from a third cat.","torrent":{"xt":"urn:btih:ab203182534c0c0389b2f36cf80eccd1ac7b622f","amp;dn":"Fifty+Shades+Effed+-+Phil+Torcivia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab203182534c0c0389b2f36cf80eccd1ac7b622f","infoHashBuffer":{"type":"Buffer","data":[171,32,49,130,83,76,12,3,137,178,243,108,248,14,204,209,172,123,98,47]},"announce":[],"urlList":[]}}