{"title":"Infinite Stratos Disc 2 NTSC ISO DVD5","uid":8848275,"size":4693097982,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:abf2d9cc596ff8327fa29659e76938c5dd371061&amp;dn=Infinite+Stratos+Disc+2+NTSC+ISO+DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"themouser","files":-1,"time":1377456482,"description":"In the near future, an eccentric Japanese scientist engineered a powered exoskeleton called the Infinite Stratos (abbreviation: IS). Possessing technology and combat capabilities far more avanced than any other weapon system, the IS threatened to destabilize the world. Faced with such an overpowering weapon, the nations of the world enact the &quot;Alaska Treaty&quot;, which states that IS will never be used for military combat and that existing IS technology must be equally distributed to all nations, to prevent any one nation from dominating the others. The introduction of the IS, however, caused a major effect on society. As IS can only be operated by women, there is a shift in the power balance between men and women, where women now dominate society over men.\n\nTen years after the IS was initially introduced, the world has entered a new age of peace. The peace is shattered, however, by Ichika Orimura, a 15-year-old Japanese boy who is inexplicably able to operate an IS. Realizing the potential, the Japanese government forces the bewildered young man to attend the prestigious IS Academy, an international academy where IS pilots from all over the world are trained. Thus, Ichika's busy high school life surrounded by nothing but girls and IS battles begins\n\n\nIMDb Link...:  &lt;a href=&quot; http://www.imdb.com/title/tt1929675/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1929675/?ref_=fn_al_tt_1&lt;/a&gt;\n\nSource......:   Retail\n\nDVD Format..:   NTSC\n\nDVD Size....:   DVD5 (A single-sided, single layer DVD that can hold up to 4.7GB.)\n\nMain movie..:   Compressed up to but not exceeding 70% original size. (VE used to maintain org quality.) \n\nMenu........:   Compressed up to but not exceeding 40% original size. (VE used to increase quality.)\n\nAudio.......: \tEnglish ONLY (All other AC3 have been removed to maintain main movie quality.)\n\nSubtitles...: \tEnglish\n\nExtras......: \tCompressed up to but not exceeding 40% original size. (VE used to increase quality.)\n\nRegion free.: \tYes\n\nFile Format.:\tISO \n\n\nEverything has already been done for you :)  Simply burn the ISO with http://www.imgburn.com or similar ISO specific burning software.  \n\nEnjoy and share.","torrent":{"xt":"urn:btih:abf2d9cc596ff8327fa29659e76938c5dd371061","amp;dn":"Infinite+Stratos+Disc+2+NTSC+ISO+DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf2d9cc596ff8327fa29659e76938c5dd371061","infoHashBuffer":{"type":"Buffer","data":[171,242,217,204,89,111,248,50,127,162,150,89,231,105,56,197,221,55,16,97]},"announce":[],"urlList":[]}}