{"title":"Salgood Sam: Revolver","uid":8796056,"size":85379965,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ac1a62a56159118cff954ba1dde525b575ab38cc&amp;dn=Salgood+Sam%3A+Revolver&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fudoh101","files":1,"time":1376081128,"description":"Revolver One: Salgood Sam's comics quaterly\nSalgood Sam\nCreateSpace Independent Publishing Platform 2002\n52 pages\n\nBook one of Revolver is a collection of seven short stories, and assorted words &amp; pictures. Exploring themes of mortality, belonging, identity and place. Some are parts of larger ongoing works but all can be read and enjoyed as stand alone tales.\n\nSalgood Sam is max douglas backwards. Start early and often. At 6 rather than lemonade, Max sold drawings from a box beside the curb. In grade 7 he sold art for the cover pages of his fellow students class presentations. He drew often and early. His first role models were his mother--a working artist--and father--a photographer and trouble maker. Despite these seemingly obvious hints, he fancied a career as a rocket scientist. But that didn't work out. So he kept drawing. For a time he thought, &quot;maybe a forger! How fun!&quot; But then he got sucked into drawing comics, and in the end they won. He started publishing zines in the '80s, by the early '90s was working professionally as a comic artist at Marvel drawing Night Breed, Saint Sinner, and assorted 2099 titles. In the 20 years since then he's drawn both commercial, and creator owned or underground comix. Along the way working as a designer for animation, and as an illustrator. He's received considerable recognition for his Sequential Art. Among those Nominated &quot;Best Emerging Talent&quot; for the inaugural 2005 Doug Wright Awards for the first iteration of Revolver, his personal comics anthology. in 2007 co-creating the best seller Therefore Repent! with collaborator Jim Monroe. He has work in the Eisner winning anthologies Comic Book Tattoo, Popgun 4, and in Awesome 2: Awesomer. His new graphic novel, Dream Life; a late coming of age: book one, is due to be released May 2013, and has a Dracula comic in the works with Mark Sable. In his spare moments he founded and publishes the comics newsblog Sequential.","torrent":{"xt":"urn:btih:ac1a62a56159118cff954ba1dde525b575ab38cc","amp;dn":"Salgood+Sam%3A+Revolver","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac1a62a56159118cff954ba1dde525b575ab38cc","infoHashBuffer":{"type":"Buffer","data":[172,26,98,165,97,89,17,140,255,149,75,161,221,229,37,181,117,171,56,204]},"announce":[],"urlList":[]}}