{"title":"LUTHER- THE CALLING.Neil Cross.mb4","uid":8846575,"size":302041323,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:aca88100e98eb4a8a67376794be1e3fc28cdc96c&amp;dn=LUTHER-+THE+CALLING.Neil+Cross.mb4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"whnstn","files":1,"time":1377409966,"description":"A brilliant crime novel and prequel to the acclaimed BBC series by the show's creator and sole writer\nMeet Detective Chief Inspector John Luther. He's a murder detective with an extraordinary case-clearance rate.\nHe's obsessive, instinctive, and intense. Nobody who ever stood at his side has a bad word to say about him.\nAnd yet there are rumors that Luther is bad - not corrupt, not on the take, but tormented.\n\nAfter years of chasing the most depraved criminals in London's gritty underworld, he seethes with a hidden fury that at times he can barely control. Sometimes it sends him to the brink of madness, making him do things any other detective wouldn't and shouldn't do. Luther: The Calling, the first in a new series of novels featuring DCI John Luther, takes us into Luther's past and into his mind. It is the story of the serial killer case that tore his personal and professional relationships apart and propelled him over the precipice - beyond fury, beyond vengeance, all the way to the other side of the law.\n Is Luther a force for good or a man hell-bent on self-destruction?\n Edgar Award - winning writer Neil Cross has created one of the most compelling characters in modern crime fiction. ","torrent":{"xt":"urn:btih:aca88100e98eb4a8a67376794be1e3fc28cdc96c","amp;dn":"LUTHER-+THE+CALLING.Neil+Cross.mb4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca88100e98eb4a8a67376794be1e3fc28cdc96c","infoHashBuffer":{"type":"Buffer","data":[172,168,129,0,233,142,180,168,166,115,118,121,75,225,227,252,40,205,201,108]},"announce":[],"urlList":[]}}