{"title":"Wu-Tang Clan - Enter the Wu-Tang (36 Chambers)","uid":9037541,"size":321848386,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:accc549097a977dcdc438e9217bd6b7cb7f29699&amp;dn=Wu-Tang+Clan+-+Enter+the+Wu-Tang+%2836+Chambers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"ArtianX","files":-1,"time":1381542475,"description":"Enter the Wu-Tang (36 Chambers) is the debut album of American hip hop group Wu-Tang Clan, released November 9, 1993, on Loud Records and distributed through RCA Records. Recording sessions for the album took place during 1992 to 1993 at Firehouse Studio in New York City, and it was mastered at The Hit Factory. The album's title originates from the martial arts film The 36th Chamber of Shaolin (1978). The group's de facto leader RZA, also known as Prince Rakeem, produced the album entirely, utilizing heavy, eerie beats and a sound largely based on martial-arts movie clips and soul music samples.\n\nThe distinctive sound of Enter the Wu-Tang (36 Chambers) created a blueprint for hardcore hip hop during the 1990s and helped return New York City hip hop to national prominence. Its sound also became hugely influential in modern hip hop production, while the group members' explicit, humorous, and free-associative lyrics have served as a template for many subsequent hip hop records. Serving as a landmark record in the era of hip hop known as the East Coast Renaissance, its influence helped lead the way for several other East Coast hip hop artists, including Nas, The Notorious B.I.G., Mobb Deep, and Jay-Z.\n\nDespite its raw, underground sound, the album had surprising chart success, peaking at number 41 on the US Billboard 200 chart. By 1995, it was certified platinum by the Recording Industry Association of America for shipments of one million copies in the United States. Initially receiving positive reviews from most music critics, Enter the Wu-Tang (36 Chambers) has been regarded by music writers as one of the most significant albums of the 1990s, as well as one of the greatest hip hop albums of all-time. In 2003, the album was ranked number 386 on Rolling Stone magazine's list of the 500 greatest albums of all time.","torrent":{"xt":"urn:btih:accc549097a977dcdc438e9217bd6b7cb7f29699","amp;dn":"Wu-Tang+Clan+-+Enter+the+Wu-Tang+%2836+Chambers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"accc549097a977dcdc438e9217bd6b7cb7f29699","infoHashBuffer":{"type":"Buffer","data":[172,204,84,144,151,169,119,220,220,67,142,146,23,189,107,124,183,242,150,153]},"announce":[],"urlList":[]}}