{"title":"Light of the World","uid":8777428,"size":5782715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae331183d9e86a7301bb10562595468568931bcd&amp;dn=Light+of+the+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"livhre","files":-1,"time":1375592557,"description":"Format: ePub\n\nDRM stripped in Calibre.\n\nWhen Detective Dave Robicheaux's daughter, Alafair, declares her intention to interview a convicted serial killer called Asa Surette in his Kansas prison cell, he does all he can to dissuade her. Dave has always encouraged her ambitions as a writer, but as a father he doesn't want her to be exposed to a man so nakedly evil. And his fears seem well founded when Alafair is visibly shocked by the encounter.\n\nTwo years later, the horror Surette evoked is all but forgotten, as Dave, his wife Molly and Alafair are vacationing amidst the natural beauty of Montana. But evil, it seems, has followed them into this wild paradise. Someone is stalking Alafair, and Dave begins to suspect that it's Surette - even though he officially died when the prison truck he was being transported in collided with an oil tanker. Is Alafair now the target of one of the most depraved serial killers ever to have been caught, or has she unwittingly crossed paths with a murderous psychopath closer to home? \n\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload. Go to kobobooks.com and choose books that you want uploaded and request them in the comments.\nNote: Comics on that site are in some weird ass format that only works on iOS and Android. To get those I have to go through the tired process of screen shots of each page, then create a word file, then convert to epub. Its a pain because even then the images may not show up right on some devices/apps.","torrent":{"xt":"urn:btih:ae331183d9e86a7301bb10562595468568931bcd","amp;dn":"Light+of+the+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae331183d9e86a7301bb10562595468568931bcd","infoHashBuffer":{"type":"Buffer","data":[174,51,17,131,217,232,106,115,1,187,16,86,37,149,70,133,104,147,27,205]},"announce":[],"urlList":[]}}