{"title":"Marie Leone Busting in the New Babe.wmv","uid":9035810,"size":613786980,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:affc0a002212669f5446479822292b5b784de603&amp;dn=Marie+Leone+Busting+in+the+New+Babe.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1381503244,"description":" &lt;a href=&quot;http://bayimg.com/maAddAAfn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/maAddAAfn&lt;/a&gt;\n\n\n\nMeet Marie Leone! Marie is a newcomer to SCORE and only 19-years-old. But what an ultra-voluptuous body! Unbelievable! SCORE has been photographing busty girls since 1992 and while we take no girl for granted, seeing Marie Leone for the first time kicked off an adrenaline rush in the staff. Marie is spectacularly built and is blessed with a pretty face. She wears a tank top and denim shorts here, clothes that she should wear all of the time.\n\nMarie first answers the SCORE cameraman's probing questions about her life back home in LA, where she was born. Marie's voice is also as distinctive as her body. It'll stick in your head, like her fantastic tits. She's adorable. Like a doll. A living doll. But she's real! Incredibly real!&quot;I started to develop when I was 14 but before then, I was extremely flat-chested and skinny. By the time I got to 8th grade, I was even bigger than the teacher,&quot; says Marie, so matter-of-fact about her gorgeous body and her incredible tits. It's true that guys are more excited about big boobs than the girls who actually have them. It's like they're thinking, &quot;What's the fuss?&quot; What's the fuss? We'll tell ya what the fuss is! Marie works in an auto shop back home. Yes, an auto shop. She got into cars growing up, influenced by her sister. Not dolls or music or the teen idol of the year. The auto customers must go fucking crazy when they see her. This is how a business is built up. You hire girls stacked like Marie, if you can find them! However, Marie says she doesn't dress like she's dressed in this scene. Maybe it's better that way.\n\nWhen Marie's date comes on to the set to greet her, he takes both of her 34J-cup whoppers and shakes them instead of shaking her hand. That's what all of us would do in his place. His eyes fucking pop out as she shows him her naked tits. As soon as Marie takes her huge tits out of her bra, he makes his move and helps Marie undress. Without skipping a beat, she's on her knees sucking pole and massaging it between her massive melons. She is the perfect fuck doll. Their first position is reverse cowgirl. Lubricated by her saliva, his pipe slips right in and fills her 19-year-old taco. Marie isn't a dirty talker when she fucks but you'll see right away that this chick really likes to get fucked hard. Marie loves 69 and getting talked dirty to but she says 'I don't talk dirty because I do not curse. Funny, huh? Look at me doing porn and I can't say fuck worth a damn!&quot; This girl is 19? Welcome, Marie Leone, new SCORE heavy-hootered hottie!\n\nSize: 613786980 bytes (585.35 MiB), duration: 00:36:01, avg.bitrate: 2272 kb/s\nAudio: wmav2, 44100 Hz, 2 channels, s16, 128 kb/s\nVideo: wmv3, yuv420p, 1280x720, 29.97 fps(r)","torrent":{"xt":"urn:btih:affc0a002212669f5446479822292b5b784de603","amp;dn":"Marie+Leone+Busting+in+the+New+Babe.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"affc0a002212669f5446479822292b5b784de603","infoHashBuffer":{"type":"Buffer","data":[175,252,10,0,34,18,102,159,84,70,71,152,34,41,43,91,120,77,230,3]},"announce":[],"urlList":[]}}