{"title":"UMN Sarwat Foursquare Dataset (September 2013)","uid":9027196,"size":160746527,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b24c73949308b3f6bdd8fea1a485534392eef338&amp;dn=UMN+Sarwat+Foursquare+Dataset+%28September+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":3,"time":1381382540,"description":"This data set contains 2,153,471 users, 1,143,092 venues, 1,021,970 check-ins, 27,098,490 social connections, and 2,809,581 ratings that users assigned to venues; all extracted from the Foursquare application through the public API. All users information have been anonymized, i.e., users geolocations are also anonymized. Each user is represented by an id, and GeoSpatial location. The same for venues. The data are contained in five files, users.dat, venues.dat, checkins.dat, socialgraph.dat, and ratings.dat. More details about the contents and use of all these files follows.\n\nContent of Files\n* users.dat: consists of a set of users such that each user has a unique id and a geospatial location (latitude and longitude) that represents the user home town location.\n* venues.dat: consists of a set of venues (e.g., restaurants) such that each venue has a unique id and a geospatial location (lattude and longitude).\n* checkins.dat: marks the checkins (visits) of users at venues. Each check-in has a unique id as well as the user id and the venue id.\n* socialgraph.dat: contains the social graph edges (connections) that exist between users. Each social connection consits of two users (friends) represented by two unique ids (first_user_id and second_user_id).\n* ratings.dat: consists of implicit ratings that quantifies how much a user likes a specific venue.\n\nCredits\n\nThe user must acknowledge the use of the data set in publications resulting from the use of the data set by citing the following papers:\n\n* Mohamed Sarwat, Justin J. Levandoski, Ahmed Eldawy, and Mohamed F. Mokbel. LARS*: A Scalable and Efficient Location-Aware Recommender System. in IEEE Transactions on Knowledge and Data Engineering TKDE\n* Justin J. Levandoski, Mohamed Sarwat, Ahmed Eldawy, and Mohamed F. Mokbel. LARS: A Location-Aware Recommender System. in ICDE 2012\n\nOriginal data source http://www-users.cs.umn.edu/~sarwat/foursquaredata/\nTorrent mirrored from","torrent":{"xt":"urn:btih:b24c73949308b3f6bdd8fea1a485534392eef338","amp;dn":"UMN+Sarwat+Foursquare+Dataset+%28September+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b24c73949308b3f6bdd8fea1a485534392eef338","infoHashBuffer":{"type":"Buffer","data":[178,76,115,148,147,8,179,246,189,216,254,161,164,133,83,67,146,238,243,56]},"announce":[],"urlList":[]}}