{"title":"wb-df180","uid":8954111,"size":3338763732,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b28d870d393dec2af52cd32c8f9ff2beace360c3&amp;dn=wb-df180&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shae2005","files":2,"time":1379964779,"description":"WB-DF180(SD)-Medium\nDouble Feature\nWB-DF180-1\nInfo:\nDeck The Balls With Girls Real NaughtyJessica, Alanah, and Kortney sure love cock, and want nothing else for Christmas than a giant dick. Lucky for them, Santa is a little naughty himself, and he doesn`t mind showing them a little Christmas spirit.Nightmare Before XXX-MasThe three delicious whores of Halloween have fucked every big dick in Halloween Town. They decide to venture out and get magically transported to Christmas Town. Now they have brand new dick to suck and fuck.Holiday CheerJames is a depressed shopping mall Santa who hates kids, but Christmas will come early this year, as Jayla and Teagan have been very naughty girls. They`re about to teach Santa that being good is lame because being bad is so much better!Merry Christm-Ass To AllKatie loves to visit her friend the toy maker, especially around the holidays. He always has such naughty things for her to play with, and this time will be no different. The toy maker has saved one last special surprise for her to enjoy!MILF And CookiesAriella Ferrara decides to bake some cookies for Santa before heading to bed, but every time she looks the cookies are gone! Santa comes down the chimney, and he is starving! Since there are no more cookies left, Santa and James will have to share Ariella`s tight little holes.Stuff My StockingWhen Kieran discovers what Lezley secretly craves for Christmas, he quickly makes it a point to get her into the festive spirit by whipping out his candy cane and stuffing Lezley`s stocking.\nCast:\nAlanah Rae, Alexis Texas, Ariella Ferrara, \nJayla Diamond, Jessica Jaymes, \nKatie St Ives, Kirsten Price, Lezley Zen, \nMonique Alexander, Teagan Summers\nMP4\n3:42:28\n720x400\n2.31gbs\nVideo Specs\nInput Type : AVC1(GVC)\nInput Size : 720 x 400\nOutput Type : YUY2\nOutput Size : 720 x 400\nFrameRate(Frame/sec) : 0.00 (29.97)\nAudio Specs\nSampleRate(Sample/sec) : 48000\nBitRate(Bit/sample) : 16\nChannels : 2\nKBitRate(KBit/sec) : 1536\nWB-DF180-2\nInfo:\nWhile on a hike, Selena Rose seeks shelter from a nice guy Erik Everhard, who lets this beautiful babe crash at his place. Unfortunately his jealous girlfriend Kelly (Alexis Monroe) doesn`t like the idea of a scantily clad sex kitten hanging around half naked. Erik hopes that a hot banging will cool Kelly off. Erik`s roommate Manuel and his girlfriend (Gia Steel) are none too thrilled by Selena either. Even though the couple enjoy a furious fucking, Selena is still able to seduce Manuel. Third roommate James Deen is able to avoid Selena`s temptation by hooking up with hotties Anikka Albrite. Selena heats things up in this sizzling sexcapade.\nCast:\nAlexis Monroe, Anikka Albrite, Gia Steel, Selena Rose\nMP4\n1:53:15\n704x386\n812mbs\nVideo Specs\nInput Type : AVC1(GVC)\nInput Size : 704 x 386\nOutput Type : YUY2\nOutput Size : 704 x 386\nFrameRate(Frame/sec) : 0.00 (23.98)\nAudio Specs\nSampleRate(Sample/sec) : 48000\nBitRate(Bit/sample) : 16\nChannels : 6\nKBitRate(KBit/sec) : 1536\nPreview &lt;a href=&quot;\nhttp://bayimg.com/fAMBNAaeN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/fAMBNAaeN&lt;/a&gt;","torrent":{"xt":"urn:btih:b28d870d393dec2af52cd32c8f9ff2beace360c3","amp;dn":"wb-df180","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28d870d393dec2af52cd32c8f9ff2beace360c3","infoHashBuffer":{"type":"Buffer","data":[178,141,135,13,57,61,236,42,245,44,211,44,143,159,242,190,172,227,96,195]},"announce":[],"urlList":[]}}