{"title":"10ninASM.BIG.mp4","uid":8625253,"size":809159958,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b2f3d5b23e3ea8bc7a9867aa0f1272a777541b08&amp;dn=10ninASM.BIG.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sarah.jensen","files":-1,"time":1372487754,"description":"So I did not hear from Sharon for a month after she knocked at my door. Did not see her in the hallway any morning, and thought that she has given up college. Never saw her in her neat ironed white blouse. One month nothing. Then there was another knock at my door one afternoon, very quiet, I was almost not sure I had heard anything. I opened the door, and there was Sharon, standing back from the doorway, modestly dressed as ever, except for the pair of grey leopard skin high heeled shoes she was balancing on. She held the mobile phone that I had bought her limply but obviously in her right hand. 'How do you like your phone,' I asked and smirked at her. She half smiled and replied, 'I have not got money for the phone bill.' I knew what she wanted, even if she was not bold enough to ask. 'So you want me to pay it,' I said, 'I bet your asshole smells good, and I am sure it would look good with my cock up it.' I know how to speak to a respectable well brought up girl. 'I can pay your bill, but you have got to do another video with me and take it up your bum.' Sharon did not say anything, she just glared at me with her sweet almond eyes. She stayed where she was, just out of reach in the hallway outside my door. 'Up your bum girl, you have to take it up deep your ass,' I told her. 'Oh,' she said, 'you want to make love to me anal?' How prim and fucking proper even when she speaks, 'Okay I will let you make love anal but you do not have to make a video.' 'What,' I said back to her, 'what is all this love bollocks, and of course I want to make a video. What do you want, love, or do you want me to pay your fucking phone bill?' She looked at the floor, took half a step closer to me, peered up and said quietly, 'phone bill please.' Dial the video and get my hallway neighbor slutified and asshole sod botty fucked. ","torrent":{"xt":"urn:btih:b2f3d5b23e3ea8bc7a9867aa0f1272a777541b08","amp;dn":"10ninASM.BIG.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2f3d5b23e3ea8bc7a9867aa0f1272a777541b08","infoHashBuffer":{"type":"Buffer","data":[178,243,213,178,62,62,168,188,122,152,103,170,15,18,114,167,119,84,27,8]},"announce":[],"urlList":[]}}