{"title":"[FemaleAgent] Zara Jay (1153 / 10.08.2013)","uid":9027273,"size":1215945059,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b39022fe53bc4a9ba88629f08502bd42242346ad&amp;dn=%5BFemaleAgent%5D+Zara+Jay+%281153+%2F+10.08.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1381384640,"description":"[FemaleAgent] Zara Jay (1153 / 10.08.2013)\nres:1080p\n\nThe second girl named Zara I've had in the last few castings, and just like the last one she was an absolute vision of beauty. She looked so glamorous when she entered my office that I immediately knew that whatever it would take, I had to have this thing of beauty dripping wet on my couch. Zara had sent me some soft pictures of her doing a solo shoot and said she was now prepared to move onto doing girl/girl video and photo shoots. This was my way into her pussy. After a few more questions I asked if I could see her naked which she agreed to. She said her tits were very sensitive so I had to go and give them a nibble just to make sure she was telling the truth. She moaned seductively as I flicked my tongue across her already rigid nipple. I told her that I would have to test her to see how she performs on camera due to her lack of girl/girl experience and she was more then willing to sink back onto the couch as I tasted her peachy pussy. She got incredibly wet and it wasn't long before she was squirming and climaxing on the end of my amazingly talented tongue. I wasn't finished with her yet tho and I got out my favorite massage toy and got her on all fours. The vision of her kneeling with that amazing ass pointing into the air sent me into a sexual frenzy and I ran the vibrator all over her clit and pussy, bringing her to another amazing orgasm. Her pussy was soaking wet after her two orgasms, I delved my fingers into her and pinched the gooey goodness between my fingers. So wet and stringy. An amazing casting with a beautiful woman, who I would sign to my agency books if they existed without a moments hesitation.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=ac316xkapw72eaw17yu2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=ac316xkapw72eaw17yu2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5orbsqhpstmkqqqymgkh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5orbsqhpstmkqqqymgkh.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b39022fe53bc4a9ba88629f08502bd42242346ad","amp;dn":"%5BFemaleAgent%5D+Zara+Jay+%281153+%2F+10.08.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39022fe53bc4a9ba88629f08502bd42242346ad","infoHashBuffer":{"type":"Buffer","data":[179,144,34,254,83,188,74,155,168,134,41,240,133,2,189,66,36,35,70,173]},"announce":[],"urlList":[]}}