{"title":"Cypher 3.1 - The Online Multiplayer Hacking Platform Game","uid":8911947,"size":32078848,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b40261001d50b152391afe6a0cfd8e6126c80338&amp;dn=Cypher+3.1+-+The+Online+Multiplayer+Hacking+Platform+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Soenneker","files":-1,"time":1379048017,"description":"            ,,,,                               \n         ########'+                            \n         ######'#+#                            \n         ######;#+#                            \n          ######+'                             \n         #########       #                     \n     ## ############   ###       ;:;:`         \n     ###### #############       `...``:        \n     #####   ##########+###    :.``````::      \n     ###########################'``````````:;; \n      ####+#############+###   :.`````````:;   \n      ####+##### ########       ```````..:;    \n       ####+####       #+:       :.,,`,:       \n        #########       #+#           ;        \n        ##########      ##                     \n          #########                            \n           ### #####  #                        \n           ###  ##### '                        \n           ###    #####                        \n         #####    ###+#                        \n     ######;#    ####+                         \n  ############   ####+                         \n##############   #####                         \n###########     ######                         \n #########      ######                         \n #######        ######                         \n  ######        ######+                        \n  ###+;:'#      ######'+#                      \n  ######+#      #######+::                     \n  ######        ###########                \n\n=======================================================\n   _____  __     __  _____    _    _   ____    _____  \n  / ____|     / / |  __   | |  | | |___   |  __  \n | |        _/ /  | |__) | | |__| |   __) | | |__) |\n | |           /   |  ___/  |  __  |  |__ &lt;  |  _  / \n | |____     | |    | |      | |  | |  ___) | | |   \n  _____|    |_|    |_|      |_|  |_| |____/  |_|  _\n                                                      \n=======================================================                                                     \nThe Online Multiplayer Hacking Platform Game, Cypher.\n &lt;a href=&quot;\nhttp://www.CypherGame.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.CypherGame.net&lt;/a&gt;\n\nWelcome to Cypher. A corrupt government controls Mars as corporations sell oxygen at a premium. You are an agent with an incredible skill set determined to eliminate the system.\n\nThe plot of Cypher is the overthrow of the tyrannical Martian government. In the not-too-distant future, colonization of Mars has been completed and the new government is being influenced by evil corporations. Taking information is how you will do it; unfortunately, other organizations are seeking what you are. They will stop at nothing to steal the valuable data you hack...\n\nThese organizations are rife with corruption and greed. The populace seems to not notice or care, lulled into a false sense of complacency by the media as their freedoms are stripped from them. From the darkness, a collection of underground computer hackers emerges to find valuable secret information which can lead to the downfall of the destructive forces that have taken over the planet. YOU are one such hacker, bent on revenge and justice, trying to bring about that change.\n\nThroughout the civilian world are public-access terminals. Using a special device, you are able to hack into secured networks and steal secrets from the government. They will try to stop you at every turn, killing anyone they track down carrying their secrets with their murderous orbital satellites. Competing agents, out to make a name for themselves or representing different agencies, will also attempt to kill you to slow you down or profit off your hard work. Working alone, or in covert teams, with a host of technology on your side, you are able to overcome these challenges, collecting data you will be able to one day use and open the eyes of all civilians and expose the lies of those in power.\n\nOnce the game starts, you will be warped to a random spot in the level. Once you or your team place the base door, you should begin hacking. Your base is where you will find the store, and where you can go to fully heal and charge your shield. Use the minimap to locate green terminals that you can hack. You will begin to fill the secret progress meter on the left side of the screen. When it is filled, a secret will begin to beam into the level at one of the large terminals. You will see which one on your minimap. Be warned, your enemies may try to set traps or ambush you and steal the secret once you pick it up. Once you are carrying a secret, everyone will hear an alert and be able to track you on the minimap. Get back to your base quickly, as the government is also tracking you. Drop the secret off in the right-most terminal in your base. If you are killed, an enemy agent can take the secret back to his base for the credit. The first team to collect 3 secrets wins the match\n\nCypher Beta 3 was released September 2013, and features an updater system to keep players up to date with the latest version. There are dedicated servers, as well as an integrated chat and game network.\n\nHack the Planet!\n\nCypher Team\n &lt;a href=&quot;\nhttp://www.CypherGame.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.CypherGame.net&lt;/a&gt;\n\nTwitter: @CypherGame\nFacebook:\nYoutube:","torrent":{"xt":"urn:btih:b40261001d50b152391afe6a0cfd8e6126c80338","amp;dn":"Cypher+3.1+-+The+Online+Multiplayer+Hacking+Platform+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b40261001d50b152391afe6a0cfd8e6126c80338","infoHashBuffer":{"type":"Buffer","data":[180,2,97,0,29,80,177,82,57,26,254,106,12,253,142,97,38,200,3,56]},"announce":[],"urlList":[]}}