{"title":"Society Girl Pleased To Slum It In With Tourist","uid":8979176,"size":840139218,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b45d493695287514be8099774428f8910bc195c3&amp;dn=Society+Girl+Pleased+To+Slum+It+In+With+Tourist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":-1,"time":1380515634,"description":"Alice got married to the son of the family running the papaya cartel. There is good money in fruit. She is well spoken light skinned and educated, exactly what is in demand by the rich playboy elite, who live on their parents hard work and scams. Her own parents were happy, they got a big pay off, a new pickup truck, and it made them feel good to think of themselves as new society. The in laws were happy with a beautiful well spoken girl to keep their son out of trouble. Her new husband was overjoyed at his great prize. Alice herself was a bit indifferent. She was pleased that she could finally lose her virginity, instead of rubbing her clitoris while watching porn on her tablet. But she and him did not particularly like each other. They did have sex a few times, but only because they were bored. He had plenty of other girlfriends that he would go out to fuck, and Alice had plenty of spending money to go to the shopping malls. But sex for her seemed rather vanilla when compared to the sex she had seen on the dirty web sites. I met Alice at the fruit growers cartel annual fund raising carnival. They raise huge sums of cash for good causes and keep it all themselves. Alice was floating around in a smart dress suit, smiling and flirting with the guests, her pocket book in one hand and her tablet in the other. I could see she had a smashing figure. I had snuck in uninvited to get a free buffet. Not a bad buffet, but too much fruit. Alice and I got talking, and it did not take long till we both agreed that she should make and star in her own dirty movie. Now she can watch herself on her tablet whenever she likes. And so can you. Squeeze some lime on the papaya and suck it off the video. ","torrent":{"xt":"urn:btih:b45d493695287514be8099774428f8910bc195c3","amp;dn":"Society+Girl+Pleased+To+Slum+It+In+With+Tourist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b45d493695287514be8099774428f8910bc195c3","infoHashBuffer":{"type":"Buffer","data":[180,93,73,54,149,40,117,20,190,128,153,119,68,40,248,145,11,193,149,195]},"announce":[],"urlList":[]}}