{"title":"Alex Jones Show - 2013 Aug 06 TU [sebaygo1]","uid":8786067,"size":63278945,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b71f26ea39ed6fe12b920048d6263ea614ed9ac2&amp;dn=Alex+Jones+Show+-+2013+Aug+06+TU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":11,"time":1375832882,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nMonday, 05 August 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Tuesday, August 6 edition of The Alex Jones Show, Alex breaks down Time Magazine's push for couples to lead &quot;childless lifestyles,&quot; the CPS abduction of a Texas girl that led to her death and FEMA's startling preparations for disaster - involving unexplained demands for emergency bulk food deliveries. \n\nOn today's show, Alex welcomes former Congressman, three-time presidential contender and bestselling author Ron Paul to discuss the military's drone strikes in Yemen and America's visibly apparent compliance to the all-encompassing NSA spy grid. \n\nWe'll also speak with former Secret Service agent and New York police officer Daniel Bongino about the revolving White House scandals, including the recent overseas terror threat alerts and fallout from the bungled Benghazi coverup of weapons transfers to Al-Qaeda. Bongino is also running for election in Maryland's 6th Congressional District. \n\nStaff Sergeant Joseph Biggs also joins us to respond to new revelations in the Michael Hastings saga as the late journalist's wife makes an appearance on CNN's Piers Morgan.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:b71f26ea39ed6fe12b920048d6263ea614ed9ac2","amp;dn":"Alex+Jones+Show+-+2013+Aug+06+TU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b71f26ea39ed6fe12b920048d6263ea614ed9ac2","infoHashBuffer":{"type":"Buffer","data":[183,31,38,234,57,237,111,225,43,146,0,72,214,38,62,166,20,237,154,194]},"announce":[],"urlList":[]}}