{"title":"Twenty Eight and a Half Wishes - Denise Grover Swank.epub","uid":8992864,"size":365535,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8b7ef7167556d8fbeef6a6f578dc79e22cf3c29&amp;dn=Twenty+Eight+and+a+Half+Wishes+-+Denise+Grover+Swank.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1380832687,"description":"For Rose Gardner, working at the DMV on a Friday afternoon is bad even before she sees a vision of herself dead. She's had plenty of visions, usually boring ones like someone's toilet's overflowed, but she's never seen one of herself before. When her overbearing momma winds up murdered on her sofa instead, two things are certain: There isn't enough hydrogen peroxide in the state of Arkansas to get that stain out, and Rose is the prime suspect.\n\nRose realizes she's wasted twenty-four years of living and makes a list on the back of a Wal-Mart receipt: twenty-eight things she wants to accomplish before her vision comes true. She's well on her way with the help of her next door neighbor Joe, who has no trouble teaching Rose the rules of drinking, but won't help with number fifteen-- do more with a man. Joe's new to town, but it doesn't take a vision for Rose to realize he's got plenty secrets of his own.\n\nSomebody thinks Rose has something they want and they'll do anything to get it. Her house is broken into, someone else she knows is murdered, and suddenly, dying a virgin in the Fenton County jail isn't her biggest worry after all.\n\nWinner of The Beacon 2010 Unpublished Division, Mainstream Category.","torrent":{"xt":"urn:btih:b8b7ef7167556d8fbeef6a6f578dc79e22cf3c29","amp;dn":"Twenty+Eight+and+a+Half+Wishes+-+Denise+Grover+Swank.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8b7ef7167556d8fbeef6a6f578dc79e22cf3c29","infoHashBuffer":{"type":"Buffer","data":[184,183,239,113,103,85,109,143,190,239,106,111,87,141,199,158,34,207,60,41]},"announce":[],"urlList":[]}}