{"title":"Hogtied------HT-30759 Allie James MP4","uid":8550261,"size":2103197957,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b8fd0aa63ffd5ba706b50b7f45431c63937fcfa2&amp;dn=Hogtied------HT-30759+Allie+James+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1370627904,"description":"HOT girl next door tomboy gets bent in unforgiving bondage.\n\nJun 6, 2013 - Performers: Allie James\n         \n        \nMP4 + Pics.\n          \n\nAllie James is the daughter of a farmer in a rural town. She left the country side to explore her sexual fantasies in the most extreme way possible... porn.\n\nScene one is a three way tie. First Allie is bound on her back in her feet tied to her calves, opening her hips and ankles and neck bound to the wall, discouraging movement. A tight crotch rope digs into the tender flesh of her pussy mound over cotton panties. Nipple clamps and a thorough cunt flogging are administered. The crotch rope stays on as a vibe is introduced to her tender clit. In the same position, she is turned on her side to show off that tomboy body honed from farm work. Her cunt is easily accessible and a nice thick cock is immediately inserted into it. Cum hungry, she wants to get off badly... so much stimulation.\n\nNext, Allie mentions she was a former gymnast. Her father made her go to bulk her up, saying she was too tiny for farm work... so a gymnast's position this bitch will get, on the beam - just like home. One leg is strenuously tied with her foot pulled towards her head. Her hands can't help her. Her other leg is bound tight against the beam for balance. Allie gets introduced to the cane. A sensation she doesn't seem to like to much, but she understands its the price of pleasure. After enduring the torment as the thin stingy rod strikes her flesh, she is rewarded with intense orgasms. Again and again.\n\nFinally since Allie seemed to like the crotch rope so much in the first position, it comes back to keep her in an extreme arch pose. Standing with arms in a crucifixion pose a crotch rope pulls her forward, and her head harness pulls her back. Unable to see the torment that awaits her, the tazapper comes out the antagonize this young helpless blonde. With breasts tied tight, oil is added to slick them up and the bitch is bent forward on her knees. Claire's fist immediately slides in easily to Allie's more than willing and virgin to fisting cunt hole. We both lose count of the amount of orgasms squeezed out of her. Eager and hungry this bitch leaves satisfied and exhausted.\n\nScreens &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=30759&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=30759&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:b8fd0aa63ffd5ba706b50b7f45431c63937fcfa2","amp;dn":"Hogtied------HT-30759+Allie+James+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8fd0aa63ffd5ba706b50b7f45431c63937fcfa2","infoHashBuffer":{"type":"Buffer","data":[184,253,10,166,63,253,91,167,6,181,11,127,69,67,28,99,147,127,207,162]},"announce":[],"urlList":[]}}