{"title":"Daniel Howard Snyder - The Evidential Argument from Evil .pdf","uid":8890387,"size":2063875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd541fc0947bd294a181673f25c6dde9f8a6ece9&amp;dn=Daniel+Howard+Snyder+-+The+Evidential+Argument+from+Evil+.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1378568607,"description":"Is evil evidence against the existence of God? Even if God and evil are compatible, it remains hotly contested whether evil renders belief in God unreasonable. The Evidential Argument from Evil presents five classic statements on this issue by eminent philosophers and theologians and places them in dialogue with eleven original essays reflecting new thinking by these and other scholars. The volume focuses on two versions of the argument. The first affirms that there is no reason for God to permit either certain specific horrors or the variety and profusion of undeserved suffering. The second asserts that pleasure and pain, given their biological role, are better explained by hypotheses other than theism.\n\nContributors include William P. Alston, Paul Draper, Richard M. Gale, Daniel Howard-Snyder, Alvin Plantinga, William L. Rowe, Bruce Russell, Eleonore Stump, Richard G. Swinburne, Peter van Inwagen, and Stephen John Wykstra.\n\nReview\n&quot;Recommended for use in an undergraduate or graduate course in the philosophy of religion.&quot; - Religious Studies Review&quot;... all of the essays here are of excellent quality and are generally representative of the best recent arguments on the topic... Although several of the essays are very challenging and not for the beginner, the book as a whole provides an outstanding introduction to the problem of evil.&quot; - International Philosophy Quarterly&quot;The dialogue between the essays is well orchestrated... While nominally about evil, many different advancements in epistemology and Bayesian analysis add to its net worth, achieving an even greater good from its already engaging treatment of evil.&quot; - International Journal for Philosophy of Religion&quot;For putting such a resource at our fingertips, we are all indebted to the authors whose work is collected here and especially the 'collector' himself: Daniel Howard-Snyder.&quot; - Faith &amp; Philosophy\nAbout the Author\nDANIEL HOWARD-SNYDER is Assistant Professor of Philosophy at Seattle Pacific University.","torrent":{"xt":"urn:btih:bd541fc0947bd294a181673f25c6dde9f8a6ece9","amp;dn":"Daniel+Howard+Snyder+-+The+Evidential+Argument+from+Evil+.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd541fc0947bd294a181673f25c6dde9f8a6ece9","infoHashBuffer":{"type":"Buffer","data":[189,84,31,192,148,123,210,148,161,129,103,63,37,198,221,233,248,166,236,233]},"announce":[],"urlList":[]}}