{"title":"Anthony Swofford - Hotels, Hospitals, and Jails","uid":8931806,"size":362272208,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:be9e9f184096bdad043cfc488a27c3df6407e653&amp;dn=Anthony+Swofford+-+Hotels%2C+Hospitals%2C+and+Jails&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1379476391,"description":"eview\n&quot;Intense.... As 'Jarhead' (2003), his harrowing account of serving with the Marines during the first gulf war, so eloquently attests, Mr. Swofford can write like he drives: fast and furious and profane, a poet's touch control channeling all the testosterone and adrenaline into a high-test, high-wire performance. His new memoir... reminds us of the power of Mr. Swofford's prose - his ability to conjure a mood, a time, a place with a flick of his pen.&quot; (Michiko Kakutani, The New York Times)\n\n&quot;A gritty, intense and wrenching account...&quot; (USA Today)\n\nThe publication of Jarhead launched a new career for Anthony Swofford, earning him accolades for its gritty and unexpected portraits of the soldiers who fought in the Gulf War. It spawned a Hollywood movie. It made Swofford famous and wealthy. It also nearly killed him.\n\nNow with the same unremitting intensity he brought to his first memoir, Swofford describes his search for identity, meaning, and a reconciliation with his dying father in the years after he returned from serving as a sniper in the Marines. Adjusting to life after war, he watched his older brother succumb to cancer and his first marriage disintegrate, leading him to pursue a lifestyle in Manhattan that brought him to the brink of collapse. Consumed by drugs, drinking, expensive cars, and women, Swofford lost almost everything and everyone that mattered to him. \n\nREVIEWS\n&quot;Join Anthony Swofford on his journey toward true manhood....HOTELS, HOSPITALS, AND JAILS is a powerful and sometimes painful book to read. The writing is short, staccato and rhythmic. More importantly, it's honest.&quot; (Bookpage.com)\n\n&quot;Anthony Swofford has ruined me. His latest book is a memoir, Hotels, Hospitals, and Jails. And it's all guts. I laughed. I cried. I sat in somber silence. I could not put this book down. As deadlines escalate around me, other books need to be read, blurb requests are stacking up, it doesn't matter, it's the Anthony Swofford show...He splays it out. He's unrelenting. This is a book many authors have to wait until their fathers die or until someone dies to be this honest at portraying their families.&quot; (San Francisco Chronicle)\n\n&quot;Swofford shares brutally honest stories about his family, random sex, hard drinking and his difficult relationship with his father, as he tries to cope with life and post-traumatic stress...Swofford is an often-gripping narrator, at his best both angry and charismatic without apology...The chapter about visiting a veterans' hospital has rightly been singled out as a remarkable piece of writing.&quot; (The Huffington Post)\n\n&quot;[S]earing...Swofford's prose remains as strong as ever. And his insights into his own past and present strike an honest chord.&quot; (Associated Press)\n\n&quot;Fiery follow-up memoir by the bestselling author of Jarhead . . . Swofford's writing, like many of his stories, is explosive . . . the author's voice and energy are compelling . . . sure to be a bestseller.&quot; (Kirkus Reviews)\n\n&quot;Swofford's brisk storytelling, deadpan humor, and appealing swagger.&quot; (The New Yorker)\n","torrent":{"xt":"urn:btih:be9e9f184096bdad043cfc488a27c3df6407e653","amp;dn":"Anthony+Swofford+-+Hotels%2C+Hospitals%2C+and+Jails","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be9e9f184096bdad043cfc488a27c3df6407e653","infoHashBuffer":{"type":"Buffer","data":[190,158,159,24,64,150,189,173,4,60,252,72,138,39,195,223,100,7,230,83]},"announce":[],"urlList":[]}}