{"title":"StreetBlowJobs - Logan (Man handler / Reality Kings / 09.08.2013","uid":8892795,"size":363744314,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bfcb80d6bff8e0984ab254e8ae06cc38910b2e67&amp;dn=StreetBlowJobs+-+Logan+%28Man+handler+%2F+Reality+Kings+%2F+09.08.2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"codho","files":-1,"time":1378626471,"description":"I came across this damsel in distress that just got fired from her job. On top of it, I found out Logan was evicted from her place. She hasn't been down in sunny Florida for too long, so she didn't have many options. Logan needed a place to chill for a little while because she couldn't continue on the path she was going. I offered her to chill at my spot, and we could sort things out. I just wanted to sort my cock into her pussy, but I was going to make sure she was cool with it. We got back to my humble home, and then popped the money question. Logan needed loot and a place the stay. I gave her the place for the time being, but she needed to earn the loot. I started off light with an offer for some cash for a little dance. She shyly accepted, but everything changed when she felt how hard my dick was. I added a few hundreds for her to suck it. Logan was turned on, so it didn't take much convincing. Once she had a taste of my balls, she was ready to hop on my dick. Logan didn't care about money anymore. She just wanted to fuck and forget. I railed her good and could really feel her tight pussy. Logan hasn't had the dick in some time. I let loose in her mouth and on her face, and she didn't even hesitate. Logan smiled as I handed her the cash. She felt better after being fuck.\n\n\nScreenshot :\n &lt;a href=&quot;\nhttp://bayimg.com/DaPOkaAeG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DaPOkaAeG&lt;/a&gt;","torrent":{"xt":"urn:btih:bfcb80d6bff8e0984ab254e8ae06cc38910b2e67","amp;dn":"StreetBlowJobs+-+Logan+%28Man+handler+%2F+Reality+Kings+%2F+09.08.2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfcb80d6bff8e0984ab254e8ae06cc38910b2e67","infoHashBuffer":{"type":"Buffer","data":[191,203,128,214,191,248,224,152,74,178,84,232,174,6,204,56,145,11,46,103]},"announce":[],"urlList":[]}}