{"title":"Battle Kid 2 - Mountain of Torment (NES)","uid":9028167,"size":42870959,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:c395f7c2a8b7e9314850d889ba19944f4766962b&amp;dn=Battle+Kid+2+-+Mountain+of+Torment+%28NES%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1381363448,"description":"This is the sequel to Battle Kid that has been ongoing since July of 2010. I had always hoped to do a followup game and I was able to complete it after about 2 years. Taking what I had learned from the first game, I was able to do a lot of things more efficiently. The amount of feedback I received along with watching let's plays really gave me insight on how to improve aspects that the first game may have been lacking. The end result is a much bigger game and I'm pleased with the end result. Release date to be announced.\n\nInspired from &quot;I Wanna Be The Guy&quot; and other classic platformers, this game follows the same format of having a large map in Metroidvania style where one has a large map to freely explore and must venture to various parts of it. You always die in one hit (3 hits for easy difficulty), but there are unlimited lives and a password system that allows you to continue where you left off. In total, there are over 650 rooms, 25 enemy types, 13 boss battles, 42 music tracks, and more bonus features this time around.\n\nThe adventure continues! Will the torment get to you?\n\n-------\n\nIf you like this game, please buy it, whenever it is in stock at Retrozone :)","torrent":{"xt":"urn:btih:c395f7c2a8b7e9314850d889ba19944f4766962b","amp;dn":"Battle+Kid+2+-+Mountain+of+Torment+%28NES%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c395f7c2a8b7e9314850d889ba19944f4766962b","infoHashBuffer":{"type":"Buffer","data":[195,149,247,194,168,183,233,49,72,80,216,137,186,25,148,79,71,102,150,43]},"announce":[],"urlList":[]}}