{"title":"Extreme Movie Manager 8.0.7.2 +KeyGen_Crude","uid":8837001,"size":84319278,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c4834b6094cadf972f11c356b6dbf034bdf4a178&amp;dn=Extreme+Movie+Manager+8.0.7.2+%2BKeyGen_Crude&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KiwiPirate","files":6,"time":1377145830,"description":"RE-UPLOAD ... \ntorrent is the same as my previous upload which was incorrectly named\n\n\n\nManage all your Movies / TVShow in your Hard Disk, USB Devices, Original DVD, Blu-Ray Discs, VHS and more!\n\n\tAll New Design, XMM has been rewritten from scratch.\nNow you have More Skin to choose and a new clean and simple Interface\n  \t \nCatalog your Ripped Movies by Simply Scanning your Devices...\n\nDevice scanner is new, now is more smart and can automatically catalog all your collection (Ripped Movies, DVD, Blu-Ray, NAS, Networked Media Tanks ecc...) \t\n  \t \n\tWe love TV Shows, We have made the new Device Scanner able to catalog automatically all your collection.\n\nCollecting TV Series is now just a click away. With the built-in functions to extract automatically TV Shows Title, Season, Episode number and Episode Titles will really extremely easy add everything to your database.\n  \t \nNew MagicScript Engine!\nImport all information from internet like cast, crew, pictures, fanart, trailers is now more easy.\n\nXMM will work in background, will import all movies info from your favourite website automatically. You have just to add Movies, the other things will be managed by XMM. It will prompt you only in case there are more sources for a movie \t\n  \t \n\tBrowse you collection ONLINE, anywhere and share with your friends!\nWith the &quot;My Website&quot; function you can create your collection in one click.\n\nWith the built in FTP Manager XMM will take care of uploading everything in your server, automatically\n  \t \nBrowse your collection in Popcornhour Products! (Work also with other NMT)!\n\nWith the built in My NTM Device Function XMM will create webpages and will sincronize with your NTM. \t\n  \t \n\tBrowse your collection in MediaPortal (with MyFilms plugin)\nExport your collection in XML, My Films will read it and show your collection!\n\n\n  &lt;a href=&quot;\nhttp://www.binaryworks.it/extrememoviemanager/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.binaryworks.it/extrememoviemanager/&lt;/a&gt;\n\n\nInstall Program with extrememm8.0.7.2.exe\nRun program after install ... \nTHIS MUST BE DONE or keygen will not work\nRun kg.exe as Administrator, right click - run as administrator\nClick &quot;Generate&quot; and wait for notification of registration\nclose Keygen\n\nRun extreme movie manager\n\n!!! IMPORTANT !!! DO NOT ALLOW INTERNET ACCESS !!! IMPORTANT !!!\n\nRIGHT CLICK on &quot;Database&quot; on the left\nSelect &quot;Options&quot;\nSelect &quot;General&quot; tab\nUNTICK &quot;Automatically check for updates&quot;\n\n\nYou can now allow internet access to retrieve web data for you index\n\n\nenjoy\n\n//KiwiPirate \n\n\ni do not upload nothing i haven't installed\neverything installed and working on Win7 x86\npossibly also Win7 x64\nUNLESS it is an x64 only program, then it is installed and working on Win7 x64\n\nALL files are scanned with Latest definitions of ESET Smart Security\n\nUnless specifically specified &quot;No Reseed&quot; post reseed requests to my latest torrent, otherwise i may not see it\n","torrent":{"xt":"urn:btih:c4834b6094cadf972f11c356b6dbf034bdf4a178","amp;dn":"Extreme+Movie+Manager+8.0.7.2+%2BKeyGen_Crude","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4834b6094cadf972f11c356b6dbf034bdf4a178","infoHashBuffer":{"type":"Buffer","data":[196,131,75,96,148,202,223,151,47,17,195,86,182,219,240,52,189,244,161,120]},"announce":[],"urlList":[]}}