{"title":"Sword of the Stars The Pit &amp; Mindgames DLC 1.1.7","uid":8851762,"size":950700756,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c53a9126504ca8c7d061c86610a738e244c3f750&amp;dn=Sword+of+the+Stars+The+Pit+%26amp%3B+Mindgames+DLC+1.1.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"prototype.06","files":-1,"time":1377546471,"description":"This is: Sword of the Stars The Pit &amp; Mindgames DLC 1.1.7\n\nThe update was just released not even yesterday, so check it out. Lotta good stuff added, lotta fixes, and NEW MONSTERS AND WEAPONS! EEeeither way, basically... GET IT!!!\n--------------------------------------\n\nCHANGELOG v1.1.7\n\nCrashes:\n-Game crashed if player opened the Stats screen to level up after they had\ndied. Player can no longer open stat screen after death.\n\nFixes:\n-Psionics can no longer be activated while using Meditation Chamber.\n-Metabolic control now reduces hunger.\n-BioSlug now destroys the BioMod it removes.\n-Successfully disabled traps can now be reused.\n-Items in Tesseract well can no longer be added to player's shortcut bar.\n-Psi Shield effect not playing while activated.\n-Multiple traps can no longer be deployed on the same tile.\n\nAdditions and Changes:\n-Tarkan Field Surgery is now easier to use for Tarka characters.\n-Mecha and Cyborgs are no longer fooled by Glamour.\n-Auto Launcher now requires 3 rocket rounds to fully reload.\n-Added green expiration counter to abilities in Psionics screen. (Moved blue recharge counter to center of icon.)\n-Ingredients now list what recipes they are used in.\n-Various tweaks to NPC behaviour.\n-Can now add Tailswipe and Fists to shortcut bar by right-clicking on a shortcut slot in the inventory screen.\n-Improved animation for TK Fist.\n-NPC show &quot;Healed&quot; when health is increased.\n-Psionic effects are now drawn behind character while activated.\n-New monsters! New weapons!\n--------------------------------------\n\n\nDescription:\nHave you found the cure to the plague yet? Even if you have, there's more to The Pit than you at first thought, with lots of new areas to explore, items to find, and new dangers! The Pit: MindGames gives you even more old-school dungeon-diving in the Sword of the Stars sci-fi universe, letting your test your skill against The Pit using the mysterious and gifted Solforce Psion officer or the Tarkan Ranger... the first playable alien character!\nThe Pit will only give up its secrets if you survive and to survive you might need to explore the powerful and deadly potential of your mind!\nMens agitat monstra!\n-2 New playable characters; the Human Psion and Tarka Ranger.\n-10 New floors of ancient, evil science add to the challenge!\n-New room types, including wide, multi-level biospheres! \n-New traps, new weapons, new items, and new recipes! \n-New game mechanics, including 28 Psionic Powers! \n-New Psionic enemies to fight, drawn from the Sword of the Stars universe! \n-2 New Play Modes; &quot;Infinite Mode&quot; as well as &quot;Seriously? Mode&quot;.\n-Expanded meta-game aspects, including the ability to 'bank' XP and spare items from one session and start the next run of the game on a deeper level, using your 'banked' equipment.\n\nSystem Requirements:\nOperating system: Windows XP/Vista/7/8\nProcessor: Intel Pentium 1.6 GHz or equivalent\nMemory: 1 GB RAM\nHard disk space: 500 MB free space\nVideo: 512 MB\nSound: Any Windows compatible sound device, stereo speakers or head phones\nDirectX: DirectX 9.0c\nController support: 2-button mouse, keyboard and speakers\n\n\n--------------------------------------\n*Absolutely 100% clean and working!*\n*My upload ain't the best, but I'll seed this forever!*\n*BUY the games you reallllly dig!!!*\n","torrent":{"xt":"urn:btih:c53a9126504ca8c7d061c86610a738e244c3f750","amp;dn":"Sword+of+the+Stars+The+Pit+%26amp%3B+Mindgames+DLC+1.1.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c53a9126504ca8c7d061c86610a738e244c3f750","infoHashBuffer":{"type":"Buffer","data":[197,58,145,38,80,76,168,199,208,97,200,102,16,167,56,226,68,195,247,80]},"announce":[],"urlList":[]}}