{"title":"Nine Inch Nails 2013 Collected","uid":8935108,"size":20548469620,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c574102b4fc7273f74a2e04b0820e43ca06e617b&amp;dn=Nine+Inch+Nails+2013+Collected&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ethan829","files":-1,"time":1379544418,"description":"This is the complete collected works of the return of Nine Inch Nails in 2013. \n\nIt includes the excellent new album, Hesitation Marks, including all extras and bonuses (remixes, interview with demos, the audiophile mastered version, artwork and album booklet, the came back haunted video directed by David Lynch, etc.)\n\nIt also includes an official 4 track Live EP + fully captured audio and video of (7) unique streamed concerts from their recent summer festival leg (Fuji Rock, Lollapalooza, Outside Lands, Lowlands, Rock'N'Heim, Reading, and Made in America.) \n\nThere is also a behind the scenes tour video from Moment Factory, various promotional artwork and video, and a private audio recording of a tour rehearsal.\n\n\n\n\nIf you like the album, please be sure to purchase some form of the album from nin.com or the regular outlets such as Amazon, iTunes, etc. \n\nAlso the band (Trent Reznor, Robin Finck, Ilan Rubin, Alessandro Cortini, Josh Eustis) is going on tour across the US and Canada this fall, go catch them live if you can. Tension 2013 tour dates are listed at tour.nin.com\n\nThank you\n\n***Please note: some of the formats may be different for the concert video; I recommend VLC Media player for a one stop shop to be able to play them. It can be downloaded for free via a quick google search.***","torrent":{"xt":"urn:btih:c574102b4fc7273f74a2e04b0820e43ca06e617b","amp;dn":"Nine+Inch+Nails+2013+Collected","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c574102b4fc7273f74a2e04b0820e43ca06e617b","infoHashBuffer":{"type":"Buffer","data":[197,116,16,43,79,199,39,63,116,162,224,75,8,32,228,60,160,110,97,123]},"announce":[],"urlList":[]}}