{"title":"Speculative Grace","uid":8878529,"size":2382368,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c639c93d50e5f203ba8695d9bbf66a04cae94219&amp;dn=Speculative+Grace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"livhre","files":1,"time":1378269711,"description":"This book offers a novel account of grace, framed in terms of Bruno Latour's &quot;principle of irreduction.&quot; It thus models an object-oriented approach to grace, experimentally moving a traditional Christian understanding of grace out of a top-down, theistic ontology and into an agent-based, object-oriented ontology. In the process, it also provides a systematic and original account of Latour's overall project. The account of grace offered here redistributes the tasks assigned to science and religion. Where now the work of science is to bring into focus objects that are too distant, too resistant, and too transcendent to be visible, the business of religion is to bring into focus objects that are too near, too available, and too immanent to be visible. Where science reveals transcendent objects by correcting for our nearsightedness, religion reveals immanent objects by correcting for our farsightedness. Speculative Grace remaps the meaning of grace and examines the kinds of religious instruments and practices that, as a result, take center stage.\n\nI apologize for the lack of covers today, bayimg is down right now.","torrent":{"xt":"urn:btih:c639c93d50e5f203ba8695d9bbf66a04cae94219","amp;dn":"Speculative+Grace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c639c93d50e5f203ba8695d9bbf66a04cae94219","infoHashBuffer":{"type":"Buffer","data":[198,57,201,61,80,229,242,3,186,134,149,217,187,246,106,4,202,233,66,25]},"announce":[],"urlList":[]}}