{"title":"The Little Republic: Masculinity and Domestic Authority in Eight","uid":9036792,"size":3982269,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9dcb79da863949cc983e515226883b47b0f9091&amp;dn=The+Little+Republic%3A+Masculinity+and+Domestic+Authority+in+Eight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"K-Slender","files":3,"time":1381527231,"description":"Publication Date: June 18, 2012 | ISBN-10: 0199533849 | ISBN-13: 978-0199533848\n\nThe relationship between men and the domestic in eighteenth-century Britain has been obscured by two well-established historiographical narratives. The first charts changes in domestic patriarchy, founded on political patriarchalism in the early modern period and transformed during the eighteenth century by new types of family relationship rooted in contract theory. The second describes the emergence of a new kind of domestic interior during the long eighteenth century, a 'home' infused with a new culture of 'domesticity' primarily associated with women and femininity. Domesticating Patriarchy shifts the terms of these debates, rescuing the engagement of men with the house from obscurity, and better equipping historians to understand masculinity, the domestic environment, and domestic patriarchy.\n\nKaren Harvey explores how men represented and legitimized their domestic activities. She considers the relationship between discourses of masculinity and domesticity, and whether there was a particularly manly attitude to the domestic. In doing so, Harvey suggests that 'home' is too narrow a concept for an understanding of eighteenth-century domestic experience. Instead, focusing on the 'house' foregrounds a different domestic culture, one in which men and masculinity were central. Reconstructing men's experiences of the domestic as shaped by their own and others' beliefs, assumptions and expectations, Harvey argues for the continuation of a model of domestic patriarchy and also that effective domestic patriarchs remained important to late-eighteenth-century political theory. It was a discourse of 'oeconomy' - the practice of managing the economic and moral resources of the household for the maintenance of good order - that shaped men's attitudes towards and experiences in the house. Oeconomy combined day-to-day and global management of people and resources; it was a meaningful way of defining masculinity and established the house a key component of a manly identity that operated across the divide of 'inside' and 'outside' the house. Significantly for histories of the home which so often narrate a process of privatization and feminization, oeconomy brought together the home and the world, primarily through men's domestic management.","torrent":{"xt":"urn:btih:c9dcb79da863949cc983e515226883b47b0f9091","amp;dn":"The+Little+Republic%3A+Masculinity+and+Domestic+Authority+in+Eight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9dcb79da863949cc983e515226883b47b0f9091","infoHashBuffer":{"type":"Buffer","data":[201,220,183,157,168,99,148,156,201,131,229,21,34,104,131,180,123,15,144,145]},"announce":[],"urlList":[]}}