{"title":"Gravity Screen Off Pro v1.50 [Mr_Nicky]","uid":8556890,"size":284321,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ca19f5f141ba586122ab401b61bd9ae316af0f93&amp;dn=Gravity+Screen+Off+Pro+v1.50+%5BMr_Nicky%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mr_NiCky","files":-1,"time":1370786633,"description":"Using your phone often?\nTired of the On-Off switching?\nThis app turns automatically your screen off when you put your phone into your pocket or onto a table and turn the screen on when you take it out or up. No need to touch any button and you are ready to go.\n\nHOW IT WORKS:\n\nIt monitors the orientation of the device through the gravity sensor. When your phone is pointing downward by its top, in a certain angle, it's likely to be out of use. In this situation the proximity sensor is activated to determine if it is covered.\nIf yes, the screen turns off because probably you placed the phone into your pocket or onto a table.\nTo keep the battery usage low the program turns on the proximity sensor only when it's really necessary.\nMoreover, when it turns your screen off and the proximity sensor is covered it puts your phone into deep sleep state to save as much energy as possible.\n\nMAIN FEATURES:\n- Pocket Sensor:\nRecognizes if your phone is in your pocket. By turning your phone below the angle you set, it'll prepare to turn the screen off.\n- Table Sensor: Detects your phone is lying on a table and turns the screen off.\n- Turn Screen On by Motion: If the screen is off and it's facing up the device can be woken up by any movements, for example lift up by hand.\n- Keep Screen On by Motion: It's a Screebl like feature but it's relying on the small movements you are doing by your hand while holding the phone.\nIf small motions are detected while the screen is facing up the feature keeps the screen on because it can be suspected that the phone is held and probably you are reading something long. If the phone is steady the normal screen timeout will apply in any position you leave your device.\n\nBATTERY USAGE:\nIt should be not significant.\nI experienced about 6 per cent extra consumption on the test device.\nHowever it can be much higher by often using the Turn Screen On by Motion feature. Thus, keep your phone face down if you want to save energy.\n","torrent":{"xt":"urn:btih:ca19f5f141ba586122ab401b61bd9ae316af0f93","amp;dn":"Gravity+Screen+Off+Pro+v1.50+%5BMr_Nicky%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca19f5f141ba586122ab401b61bd9ae316af0f93","infoHashBuffer":{"type":"Buffer","data":[202,25,245,241,65,186,88,97,34,171,64,27,97,189,154,227,22,175,15,147]},"announce":[],"urlList":[]}}