{"title":"Blue Ridge 1-2 (Sophia Grey)","uid":8937953,"size":189287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca4b1ec553853615a062a5a6019bf76073e8d3fa&amp;dn=Blue+Ridge+1-2+%28Sophia+Grey%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":2,"time":1379613949,"description":"1. The New Boy: Nadia lives the most boring life imaginable in the foothills of the Blue Ridge Mountains. She's stuck in the rut of every day feeling exactly like the last. She can't even imagine a way out; that is, until she meets Foster. \n\nImpossibly handsome and extraordinarily kind, he appears out of nowhere and brings joy and excitement in Nadia's life right when she needs it the most. But not everything is as it seems...Foster is hiding a secret bigger than Nadia could ever imagine!\n\nFalling in love can be bittersweet; even more so when ancient forces are trying to keep two people apart, by any means necessary. \n\nJoin Nadia and Foster for the beginning of their whirlwind romance as they decide if true love is worth risking everything they've ever known...\n\nFans of Bella Andre, Rachel Gibson, and Kristan Higgins will love this quirky romance series with strong, independent woman and sexy alpha heroes.\n\n2. The Search: Nadia use to live the most boring life imaginable in the foothills of the Blue Ridge Mountains. She was stuck in the rut of every day feeling exactly like the last. Nothing was out of the ordinary; that is, until she met Foster.\n\nNadia's once boring life has turned completely chaotic. She fell in love and was kidnapped, all within a week! \n\nCan Foster get to her in time, before she is sacrificed in a war she didn't even know existed? \n\nJoin Nadia and Foster for the beginning of their whirlwind romance as they decide if true love is worth risking everything they've ever known...\n\nFans of Bella Andre, Rachel Gibson, and Kristan Higgins will love this quirky romance series with strong, independent woman and sexy alpha heroes.","torrent":{"xt":"urn:btih:ca4b1ec553853615a062a5a6019bf76073e8d3fa","amp;dn":"Blue+Ridge+1-2+%28Sophia+Grey%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca4b1ec553853615a062a5a6019bf76073e8d3fa","infoHashBuffer":{"type":"Buffer","data":[202,75,30,197,83,133,54,21,160,98,165,166,1,155,247,96,115,232,211,250]},"announce":[],"urlList":[]}}