{"title":"Venning_Timothy-If_Rome_Hadnt_Fallen.epub","uid":8978328,"size":640839,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc9a6321b7c3050783aacbce656baa91aacced65&amp;dn=Venning_Timothy-If_Rome_Hadnt_Fallen.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"420weedman","files":1,"time":1380494927,"description":"This is a fascinating exploration of how the history of Europe, and indeed the world, might have been different if the Western Roman Empire had survived the crises that pulled it apart in the 4th and 5th centuries. Dr Timothy Venning starts by showing how that survival and recovery might plausibly have happened if several relatively minor things had been different. He then moves on to discuss a series of scenarios which might have altered the course of subsequent history dramatically. Would the survival of a strong Western Empire have assisted the Eastern (Byzantine) Empire in halting the expansion of Islam in the Middle East and North Africa? How would the Western Roman Empire have handled the Viking threat? Could they even have exploited the Viking discovery of America and established successful colonies there? While necessarily speculative, all the scenarios are discussed within the framework of a deep understanding of the major driving forces, tensions and trends that shaped European history and help to shed light upon them. In so doing they help the reader to understand why things panned out as they did, as well as what might have been.","torrent":{"xt":"urn:btih:cc9a6321b7c3050783aacbce656baa91aacced65","amp;dn":"Venning_Timothy-If_Rome_Hadnt_Fallen.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc9a6321b7c3050783aacbce656baa91aacced65","infoHashBuffer":{"type":"Buffer","data":[204,154,99,33,183,195,5,7,131,170,203,206,101,107,170,145,170,204,237,101]},"announce":[],"urlList":[]}}