{"title":"PBS - Democracy on Deadline, The Global Struggle for an Independ","uid":8629252,"size":836579375,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce424b57e8d4e5052a8bfec3f6d72b698834dac7&amp;dn=PBS+-+Democracy+on+Deadline%2C+The+Global+Struggle+for+an+Independ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bleargh","files":2,"time":1372552662,"description":"Journalists inform; they warn; they analyze and interpret, all to help the public make sense of the world. At their best, courageous journalists share a common mission: bearing witness to the truth as they see it in order to serve their fellow citizens, providing them accurate information, acting as their watchdog over those who hold power and speaking out in behalf of those who have none.\n\nThis documentary profiles journalists throughout the world as they struggle with government censorship, commercial pressures, and dangerous conditions in covering international events, and sheds light on the pivotal role journalists must play around the globe.\n\n* In Mexico: A broadcast journalist tests Mexico's new-found democratic freedom by blasting open a culture of secrecy and corruption.\n* In Israel: Journalists hold up a mirror to show their people and their government hard truths neither wants to know.\n* In Russia: Journalists struggle to report the truth under a darkening cloud of fear, misinformation and increasing governmental control.\n* In Nigeria and Sierra Leone: Journalists give birth to a free press after having survived prison and exile.\n* In Afghanistan: An American correspondent stretches to cover both the U.S./NATO military operation and the struggles ordinary Afghans go through every day.\n* In the United States: American journalists struggle to get behind the curtain of &quot;spin&quot; woven by government officials and to expose some of the darker practices of the war on terror.\n\nThroughout, the film provides vivid reminders of how valuable serious journalism is, and how vigilantly it must be practiced to ensure the health of democracy. American viewers who see how valiantly journalists elsewhere must work to tell the truth may hold their own press corps responsible for a greater degree of truth-telling. Viewers get a comparative look at the state of the press around the world, and see that the walls of secrecy that stand in the way of press freedom can be toppled. Democracy on Deadline sheds light on the pivotal role journalists must play around the globe.\n\n\nContainer: AVI\nVideo: XviD 640x480 863 kbps 29.97 fps\nAudio: LAME 112 kbps ABR MP3\n\n\nNote: This is a standard-def rip from a 2006 analog cable TV broadcast of the film on the PBS series Independent Lens. A DVD is available for sale to institutions at the Icarus Films website. Your local library may be able to acquire and loan you a copy.\n\n\nOfficial websites:\nIcarus Films - http://icarusfilms.com/new2006/dem.html\nPBS - http://www.pbs.org/independentlens/democracyondeadline/\nITVS - http://www.itvs.org/films/democracy-on-deadline\n\nPreview clip:\n- Anna Politkovskaya (Russia), before she was killed\n\n\nReview from Educational Media Reviews Online:\n\nDemocracy on Deadline reaches deep within the souls of journalists around the globe, revealing why they sacrifice so much for the cause of freedom.\n\nMost inspiring are the film's intimate profiles of journalists who have made a tangible difference in the lives of ordinary citizens and in the operation of government. The story of two Sierra Leone journalists, for example, demonstrates how voter education and transparent free elections are vital to the success of foundling democracies. The film also shows the pivotal role war reporters in Afghanistan play in getting authorities to address serious social crises in the aftermath. Other accounts from Israel, Mexico, Russia, and the United States illustrate investigative reporting at its finest.\n\nGraphic and intense, Democracy on Deadline is a wake-up call for viewers who have grown complacent about democracy. The lengths to which these journalists have gone to create and preserve freedom is remarkable. Quite poignant are the personal consequences they have endured for being good journalists - threats, job loss, injury, and, in one case, death.\n\nAn outstanding resource for most high school or college curricula, Democracy on Deadline is a &quot;must see&quot; for students of journalism and the social sciences.","torrent":{"xt":"urn:btih:ce424b57e8d4e5052a8bfec3f6d72b698834dac7","amp;dn":"PBS+-+Democracy+on+Deadline%2C+The+Global+Struggle+for+an+Independ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce424b57e8d4e5052a8bfec3f6d72b698834dac7","infoHashBuffer":{"type":"Buffer","data":[206,66,75,87,232,212,229,5,42,139,254,195,246,215,43,105,136,52,218,199]},"announce":[],"urlList":[]}}