{"title":"Total Eclipse (Eclipse)","uid":8996244,"size":118604172,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cfc3e37d1e7ee71e5e0c0f98a60ea13ab3743757&amp;dn=Total+Eclipse+%28Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ichthypod_Crane","files":7,"time":1380869642,"description":"The ECUP boldly chats up the counter girl while purchasing pubic lice shampoo, with 'Total Eclipse'!\n\nPublished in 1988-89, Total Eclipse was a five-issue mini-series that teamed up most of Eclipse's recurring characters - Airboy, Valkyrie, Aztec Ace, Miracleman, New Wave, Mr. Monster, Liberty Project, Ms. Tree, etc. - in one storyline. The series was written by Marv Wolfman, with Bo Hampton handling the bulk of the pencils. A one-issue offshoot, entitled 'Total Eclipse: The Seraphim Objective', focused on the Liberty Project (falling between issues #2 and #3 of the main series). It was written by Kurt Busiek and illustrated by James W. Fry.\n\nAll six issues are included in this torrent. Heaps of thanks to the creative teams and the scanners! Purloin it, apportion it!\n\n\n\nMore Eclipse, you say? MORE??? Okay, how about 'Eclipse, the Magazine'? Running for seven issues from 1981 to 1983, Eclipse the Magazine debuted several successful characters (Coyote, Ms. Tree, Masked Man) and featured work from many, many talented people, including Jim Starlin, Marc Hempel, Rick Geary, Gene Colan and Charles Vess, to name just a few. The good LeonardTSpock uploaded this gem in January of this year and it is available for your intellectual enrichment at the link below:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8002452/Eclipse_Magazine&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8002452/Eclipse_Magazine&lt;/a&gt;\n\nNow get thee thither! And perhaps yon as well? Yes dammit, yon as well!","torrent":{"xt":"urn:btih:cfc3e37d1e7ee71e5e0c0f98a60ea13ab3743757","amp;dn":"Total+Eclipse+%28Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfc3e37d1e7ee71e5e0c0f98a60ea13ab3743757","infoHashBuffer":{"type":"Buffer","data":[207,195,227,125,30,126,231,30,94,12,15,152,166,14,161,58,179,116,55,87]},"announce":[],"urlList":[]}}