{"title":"Sexually Broken--Sexy Mid West girl Category 5 Cassandra Nix  Ma","uid":8798590,"size":932914961,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d060524ae132d58617d4e32467480e812a319536&amp;dn=Sexually+Broken--Sexy+Mid+West+girl+Category+5+Cassandra+Nix++Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1376096383,"description":"Sexy Mid Western girl Suffers Category 5 bondage, fucking, and deep throating! Huge puffy nipples! | Cassandra Nix | Matt Williams\n\nAugust 9, 2013 \n \n\nMP4 only. \n \n \nIt been over a year since we had Cassandra Nix on the pages of Sexually Broken. With long, sexy tan legs, an amazing ass, a throat made for fucking and huge puffy nipples, Cassandra is your typical Midwestern girl gone bad. She loves being sexually dominated, used and used hard.\n\nToday we have our 21yr old cutie bound tightly in an inescapable Box Tie. A neck rope and waist harness are added so we can toss our helpless slut around on the bed. Cassandra is about to get fucked into Subspace and have so many orgasms she won't remember her name.\n\nWe start with Cassandra on her back with her head hanging over the edge, while we slowly skull fuck her throat. Slow at first, but quickly we pick up the tempo and soon Cassandra struggles for air as we throat her with cock over and over. We make her flash and the gloss rolls over her eyes. She is completely sexually helpless as we manhandle her into several different fucking and deep throat positions. It is a gauntlet of cock, ramming her from every direction, owning her, making her come. She is fucked hard, deep and relentlessly! \n\nDeep spit covers her body, her pussy juice leaks all over everything as she is fucked from one orgasm to the next. While still completely bound, we fuck her mouth so deep and hard that we push Cassandra to the very line of panic, but she manages to hang on to her sanity. In the end we suspend Cassandra from the waste harness we used to fuck her deeper and deeper with. Her back arches beautifully over the bed as we tie her ankles to her neck. Her puffy nipples have grown huge, straining against the ropes. If she moves she chokes herself so she must be completely still. However the vibrator we plant directly on her sensitive clit makes it impossible for her to remain still. We make her come hanging upside down, and it is the strongest orgasm of the day, one that blasts her deep into subspace, completely cum drunk and dazed. All she can do is spin and leak liquid out of each of her holes, as she awaits our return... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_09cnix4/SexuallyBroken-Cassandra-Nix-Matt-Williams-Sexy-Mid-Western-girl-Suffers-Category-5-bondage-fucking-and-deep-throating--Huge-puffy-nipples.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_09cnix4/SexuallyBroken-Cassandra-Nix-Matt-Williams-Sexy-Mid-Western-girl-Suffers-Category-5-bondage-fucking-and-deep-throating--Huge-puffy-nipples.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:d060524ae132d58617d4e32467480e812a319536","amp;dn":"Sexually+Broken--Sexy+Mid+West+girl+Category+5+Cassandra+Nix++Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d060524ae132d58617d4e32467480e812a319536","infoHashBuffer":{"type":"Buffer","data":[208,96,82,74,225,50,213,134,23,212,227,36,103,72,14,129,42,49,149,54]},"announce":[],"urlList":[]}}