{"title":"Exploited College Girls - MOLLY - Pinned Down Fucked Hard","uid":8628151,"size":307166836,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:d3c18e1050d5b346bda69efdd6ec27f951b111b6&amp;dn=Exploited+College+Girls+-+MOLLY+-+Pinned+Down+Fucked+Hard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beta2008x","files":1,"time":1372564862,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=pwvf8_mly.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=pwvf8_mly.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=mxx2e_ecg_molly2013_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=mxx2e_ecg_molly2013_s.jpg&lt;/a&gt;\n\n\nMolly is a change from recent girls, she's super skinny and has the best spinner body I've seen in ages; that combined with her shy sexuality and multiple real orgasms make her the perfect ECG girl o' the week. Although she seems much more shy than a typical ECG girl, she opens up eventually (her legs mostly, not complaining) and the stuff she's into will probably blow your mind. The potential for this update climbs considerably when Molly admits that in addition to being choked and slapped she loves having her ass licked and licking ass in return. As kinky as Molly's interview is, no amount of jibba jabber is going to make me bust a nut, so I have her strip and show off what she's working with. For starters, perky little nips and A cups up top mean that she doesn't wear a lot of bras (still not complaining). When she eventually gets her pants off she reveals a tiny little bare puss and a really amazing little handful of ass. I get her positioned on her back, legs spread wide showing off her vag and I get to work with my fingers and whatever shyness she had coming into the shoot, is gone by the time she has her first O. Granted it's a little, quiet one, but an O is an O and Molly busts one out. I think she can do better, so I dig into the ECG toy box and pull out a vibrator and get back to it. Sure enough, it works and her second orgasm is a lot bigger. As always, to get ready for the fucking I have Molly drop to her knees and suck me off to get me hard. She starts off a little timidly, but then really gets into it. As I get more aggressive with her, she goes along every step of the way and even when I face fuck her and urge her to swallow as much of my cock as she can she doesn't hesitate for a second and before I know it she has my entire dick in her face. From there things get interesting, I lay Molly on her face, pin her to the bed and pound her to another orgasm. She really likes getting fucked and, turns out I really like fucking her. I put her on her back and fuck her really hard and then flip her into the trademark ECG pin down and bang her from behind until I'm about to bust a nut. As always, the big finish is on her face and I have Molly get to her knees so I can spray her. This turned out to be a great shoot and if you are a fan of slim spinners, Molly is your girl. Be sure to stay tuned after the pop shot as there are a few funny out takes. ","torrent":{"xt":"urn:btih:d3c18e1050d5b346bda69efdd6ec27f951b111b6","amp;dn":"Exploited+College+Girls+-+MOLLY+-+Pinned+Down+Fucked+Hard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3c18e1050d5b346bda69efdd6ec27f951b111b6","infoHashBuffer":{"type":"Buffer","data":[211,193,142,16,80,213,179,70,189,166,158,253,214,236,39,249,81,177,17,182]},"announce":[],"urlList":[]}}