{"title":"Love Lyrics (Odyssey Library #24) [static PDF]","uid":8882145,"size":13773895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5f1262d537f3fdb4ecbdf032b97ae70cfc91e79&amp;dn=Love+Lyrics+%28Odyssey+Library+%2324%29+%5Bstatic+PDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Greencuppa","files":-1,"time":1378356300,"description":"The Odyssey Library - Love Lyrics\n\n\nAuthor/Editor: Louis Untermeyer\nIllustrator: Antonio Frasconi\nYear: 1965\nSeries: Odyssey Library (#24)\nPublisher: Western Publishing / Odyssey Press\nLOC Cat#: 65-23284\n\nÂ A smallish hardcover booklet of The Odyssey Library series intended as an overview of the English love lyric, by presenting a selection of such works by famous poets, all custom set to graphical artwork.\nÂ \nÂ Poets through centuries have sung about love endlessly and deathlessly, but in form nowhere more memorably than in the lyric. Unlike the sonnet (the subject of Odyssey Library #06), the lyric has no definite shape, no restricted size or measure. As its name suggests, it was once sung to the accompaniment of a lyre, (and later) a lute or harp.\nÂ \nÂ Whatever the medium employed, the lyric was always a spontaneous (and usually brief) outburst of song. The love lyric is a confession, a passionate declaration, a cry from the heart. Yet inspite of its brevity, the power of the love lyric is inexhaustible. For as much as love is indefinable the love lyric is immeasurable.\nÂ \nÂ This book limits itself to a few of the countless such treasures from English-speaking poets. Yet within this limitation there is a remarkably diverse revelation of man's prevalent and sustaining passion, a passion which is both tender and self-torturing, timidly sensitive and outspokenly sensual.\nHere, in these few pages, the gamut includes* the persuasiveness of Shakespeare, the simple directness of Burns, the magic vision of Blake, and the repressed longing of Dickinson.\nÂ \nÂ Â *Full list of authors of selected poetry set to Frasconi's art: Beddoes, Blake, Browning, Burns, Byron, Dickinson, Gordon, Henley, Housman, Jonson, Rossetti (Christina &amp; Dante), Shakespeare, Shelley, Stevenson, Tennyson, Untermeyer.\n\nÂ \n-----\nScan (LXK X4650, color, 300dpi), static conversion (non-OCR), and bookmarking done by Greencuppa.\nÂ \nÂ \n==========\nPlease be advised that I have a very slow connection (c.30-60kB up), as well as sporadically connectable state... so things might take awhile to grab from me. \n~","torrent":{"xt":"urn:btih:d5f1262d537f3fdb4ecbdf032b97ae70cfc91e79","amp;dn":"Love+Lyrics+%28Odyssey+Library+%2324%29+%5Bstatic+PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5f1262d537f3fdb4ecbdf032b97ae70cfc91e79","infoHashBuffer":{"type":"Buffer","data":[213,241,38,45,83,127,63,219,78,203,223,3,43,151,174,112,207,201,30,121]},"announce":[],"urlList":[]}}