{"title":"The 8th Confession by James Patterson","uid":8790965,"size":338119,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9b32ba416fb6a1110c9265b0748b3e7ad0a1779&amp;dn=The+8th+Confession+by+James+Patterson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"OrajelJunkie","files":-1,"time":1375944314,"description":"As San Francisco's most glamorous millionaires mingle at the party of the year, someone is watching--waiting for a chance to take vengeance on Isa and Ethan Bailey, the city's most celebrated couple. Finally, the killer pinpoints the ideal moment, and it's the perfect murder. Not a trace of evidence is left behind in their glamorous home. \n\nAs Detective Lindsay Boxer investigates the high-profile murder, someone else is found brutally executed--a preacher with a message of hope for the homeless. His death nearly falls through the cracks, but when reporter Cindy Thomas hears about it, she knows the story could be huge. Probing deeper into the victim's history, she discovers he may not have been quite as saintly as everyone thought.\n\nAs the hunt for two criminals tests the limits of the Women's Murder Club, Lindsay sees sparks fly between Cindy and her partner, Detective Rich Conklin. The Women's Murder Club now faces its toughest challenge: will love destroy all that four friends have built? The exhilarating new chapter in the Women's Murder Club series, The 8th Confession serves up a double dose of speed-charged twists and shocking revelations as only James Patterson can. And remember, this is the only Murder Club episode of the year.","torrent":{"xt":"urn:btih:d9b32ba416fb6a1110c9265b0748b3e7ad0a1779","amp;dn":"The+8th+Confession+by+James+Patterson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9b32ba416fb6a1110c9265b0748b3e7ad0a1779","infoHashBuffer":{"type":"Buffer","data":[217,179,43,164,22,251,106,17,16,201,38,91,7,72,179,231,173,10,23,121]},"announce":[],"urlList":[]}}