{"title":"POtHS - Conspiracy - 029 - Above Top Secret","uid":8538442,"size":6378616218,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:da1f5e2c1a944b2616eaeac12ca070d0ea108959&amp;dn=POtHS+-+Conspiracy+-+029+-+Above+Top+Secret&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":71,"time":1370325157,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Conspiracy - 029 - Above Top Secret\n\n\nPOtHS Comment: They are doing this right before your very eyes...open your eyes, get free.  It is always The Banksters that did it.\n\n[font=comic sans ms]Description:\nDecade of Co-Intel-Pro:\nThis video highlights an interview with Darthard Perry, an FBI agent provocateur.\nHe explains some of his activity and talks about the knowledge of Black culture by the FBI. These efforts contiue today and pertain to all aspects of society. Although this film focuses on MLK and the black racist agenda, both the CIA, FBI and other government agencies are quite versitle in their techniques to subvert the mindset of the populace. Learn some of what's happening behind the scenes of the past to help the present become more visible.\n--------------------------------------------------------------------------------------------------------------------\n\nCOINTELPRO 101 - The Sabotage Of Legitimate Dissent:\nThe Sabotage Of Legitimate Dissent! Real examples from the pentagon, military, politicians and the media. The facts speak for themselves; it's hard for the nay-sayers to deny this evidence.\n--------------------------------------------------------------------------------------------------------------------\n\nAbove top Secret Earth stuff - Post Glacial Rebound Effect:\nHear it from an expert and learn more about the problems behind all our glabal environmental changes.\n---------------------------------------------------------------------------------------------------------------------\n\nEx-Public School Principal Warns Christian Parents:\n&quot;Karl Priest: Calling for a mass exodus out of public schools.&quot; CHARLESTON, W.Va. -- The latest news says it succinctly:  &quot;Startling numbers released today rank West Virginia one of the worst for education in the country&quot; and &quot;West Virginia received one of the worst education rankings in the country.&quot;  This demonstrates the extreme con job that has condemned government-schooled students to downright dumminess.  Perhaps the state, like Kanawha County, should institute more Yoga into the system.\n\nThe Nation's Report Card on science scores revealed that only about one-fourth of West Virginia students have a good understanding of science.   Only people engrossed with American Idol will fall for the farce, put out by school officials, that progress is being made.  Making sure that students are thoroughly indoctrinated in evolution has only escalated the serious problem.\n\nBut, lousy academic performance is not the main thing that should alarm West Virginia parents.  Since retiring from teaching, I have documented (using secular sources) the dangers that prevail in &quot;public&quot; schools.  (See http://www.insectman.us/exodus-mandate-wv/wv-news.htm.)  One can easily follow common threads of drugs, sex (including teachers with students and promotion of sexual perversion), lack of disciple, violence, poor academic standards, crime, anti-Christianity, and wanting more and more money.\n\nNative american Holocaust Exterminate Them! The California Story:\nFloyd Red Crow Westerman presents, Exterminate Them! The California Story!\n\nA documentary detailing the holocaust committed against the native people of California by the State and Federal Government. Exterminate and irradicate them. Upon failure,&quot;prepare to be assimulated.&quot; Per his writings, Hitler deveolped his holocaust (FEMA) camps under the United State's accomplished policies, racism and eugenics programs used against the American Indians.\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, to Bless all that Seed Long.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n","torrent":{"xt":"urn:btih:da1f5e2c1a944b2616eaeac12ca070d0ea108959","amp;dn":"POtHS+-+Conspiracy+-+029+-+Above+Top+Secret","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da1f5e2c1a944b2616eaeac12ca070d0ea108959","infoHashBuffer":{"type":"Buffer","data":[218,31,94,44,26,148,75,38,22,234,234,193,44,160,112,208,234,16,137,89]},"announce":[],"urlList":[]}}