{"title":"Dan Grimm - My Brand New Self","uid":8849037,"size":197777621,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db5483b1214bf545002e1a7fb7b6a54adbf88f64&amp;dn=Dan+Grimm+-+My+Brand+New+Self&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dg903","files":25,"time":1377473661,"description":"www.DanGrimmFanSite.com\n\nHey Everyone. My name is Dan Grimm and I Absolutely LOVE People. I also really appreciate this opportunity to make music and impact others in a positive way. I'm not going to lie I can be very silly acting ridiculous and having an excellent time because life shouldn't be too serious all the time. \n\nI really appreciate the ability to have a restored relationship with my Savior and my family. My family has been through some very deep struggles just like I'm sure everyone else does too. These struggles have made me realize that there is something more to live for than just myself. I really want to be able to impact people with postive good mood music that can help them relax and focus on positive things. \n\nJesus Christ will ALWAYS be there for you and when you experience hardships and struggles\nplus He is so capable of sharing Authentic love that hasn't been damaged by sin\nI believe he's the definition of Real LOVE and I just wanna SHINE with the brightness he shared with my heart when it was completely broken.\n\nLove is patient, love is kind. It does not envy, it does not boast, it is not proud. - I can't wait to LIVE in this type of Love for Eternity\n\nI Don't want to share in the cause of brokenness anymore, I'd rather celebrate the healing that can take place!\nI still have my worries, Doubts, and deep anxiety. But i'm here to walk out this life together for a purpose!\n\n10 Bible Verses About Anxiety\nPhilippians 4:6-8\nBe anxious for nothing, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. And the peace of God, which surpasses all comprehension, shall guard your hearts and your minds in Christ Jesus. Finally, brethren, whatever is true, whatever is honorable, whatever is right, whatever is pure, whatever is lovely, whatever is of good repute, if there is any excellence and if anything worthy of praise, let your mind dwell on these things.\n\nMatthew 6:31-34\n&quot;Do not be anxious then, saying, 'What shall we eat?' or 'What shall we drink?' or 'With what shall we clothe ourselves?' &quot;For all these things the Gentiles eagerly seek; for your heavenly Father knows that you need all these things. &quot;But seek first His kingdom and His righteousness; and all these things shall be added to you. &quot;Therefore do not be anxious for tomorrow; for tomorrow will care for itself. Each day has enough trouble of its own.\n\nPsalm 56:3\nWhen I am afraid, I will put my trust in Thee.\nMatthew 6:27\n&quot;And which of you by being anxious can add a single cubit to his life's span?\n\nMatthew 11:28-30\n&quot;Come to Me, all who are weary and heavy-laden, and I will give you rest. &quot;Take My yoke upon you, and learn from Me, for I am gentle and humble in heart; and you shall find rest for your souls. &quot;For My yoke is easy, and My load is light.&quot;\n\nPsalm 121:1-2\nI Will lift up my eyes to the mountains; From whence shall my help come? My help comes from the LORD, Who made heaven and earth.\n\nPsalm 23:4\nEven though I walk through the valley of the shadow of death, I fear no evil; for Thou art with me; Thy rod and Thy staff, they comfort me.\n\nProverbs 3:5-6\nTrust in the LORD with all your heart, And do not lean on your own understanding. In all your ways acknowledge Him, And He will make your paths straight.\n\n1 Peter 4:7\nThe end of all things is at hand; therefore, be of sound judgment and sober spirit for the purpose of prayer.\n\nPsalm 46:10\n&quot;Cease striving and know that I am God; I will be exalted among the nations, I will be exalted in the earth.&quot;","torrent":{"xt":"urn:btih:db5483b1214bf545002e1a7fb7b6a54adbf88f64","amp;dn":"Dan+Grimm+-+My+Brand+New+Self","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db5483b1214bf545002e1a7fb7b6a54adbf88f64","infoHashBuffer":{"type":"Buffer","data":[219,84,131,177,33,75,245,69,0,46,26,127,183,182,165,74,219,248,143,100]},"announce":[],"urlList":[]}}