{"title":"Amateur Lesbian Toni Freeland","uid":8627036,"size":3607522722,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:db74fda873f2fad0679363a0438e8bbc4b051cda&amp;dn=Amateur+Lesbian+Toni+Freeland+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wsnge","files":-1,"time":1372534489,"description":"Toni is a cute babe in Portland. She has a man. They go out together and he films her while she picks up other cute chicks and gets them back to her place for some hot lesbian fucking. That is Playing With Toni in a nutshell.\n\nWhat makes PlayingWithToni good, besides the lesbian fucking of course, is Toni herself. She is such a cutie. She isn't the most beautiful gal online, but she is a real babe-next-door type with a nice body and a great personality. The way she laughs and talks and flirts with other babes is very endearing. She is also great at licking pussy, which obviously doesn't hurt.\n\n===\n\nThis is a collection of all the videos I could find of Toni Freeland. She used to run an early amateur reality porn site called &quot;Playing With Toni&quot; and &quot;Toni Freeland.com&quot; now it just looks like there's 21 videos on the site. I was able to find 2 other ones on other sites (one is her with a cute black girl, the other in a threesome). \n\nToni is really adorable and sexy, reminds me of Carrie Brownstein. You can see thumbnails on the old site here: http://playingwithtoni.com/members/pics.php\nthe dates on her site are changed. I think the content stopped around 2004 (the copyright at the bottom of the site). I'd be interested in seeing any content that is lacking from this torrent. ","torrent":{"xt":"urn:btih:db74fda873f2fad0679363a0438e8bbc4b051cda","amp;dn":"Amateur+Lesbian+Toni+Freeland+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db74fda873f2fad0679363a0438e8bbc4b051cda","infoHashBuffer":{"type":"Buffer","data":[219,116,253,168,115,242,250,208,103,147,99,160,67,142,139,188,75,5,28,218]},"announce":[],"urlList":[]}}