{"title":"Time Team - Season 03 (1996) - 6 Episodes","uid":8652096,"size":1882563041,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dc2652dcd196d2b2997eb7cbb24b89799eb4719c&amp;dn=Time+Team+-+Season+03+%281996%29+-+6+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":null,"files":7,"time":1373133275,"description":"Time Team - Season 03 - 6 Episodes\n\nReturning for a third series, the Time Team embark on six new archaeological adventures. They go in search of the secrets of a Venetian ship-wreck, a mammoths' graveyard and the fighting monks of Christianity.\n\nWith just three days at each site, to help them battle against the clock the team have the most advanced technical equipment available to the modern archaeologist at their disposal - computerised reconstruction, ground radar, and geophysical and helicopter surveying equipment. And the most basic methods of archaeology, digging and field walking, still prove to be vital in their process of discovery.\n\n\nS03E01 - Prehistoric Fogou - Boleigh, Cornwall - Res=720x592 - fps=25 - bps=768 - Audio=mp3/96kbps\n\n        A 2000 year old Iron Age underground chamber - a fogou - takes the Time Team deep into the far west of Cornwall.\n\n       Using the maps of a Cornish antiquarian who ended his days in a local lunatic asylum, the latest high-tech survey equipment and Tony's newly acquired skill at dowsing, the Team have just three days to unlock the fogou's secrets. What was the chamber used for, is there another underground passage in the area and did an Iron Age Settlement exist on the site?\n\nS03E02 - Hunting for Mammoths - Stanton Harcourt, Oxfordshire - Res=640x480 - fps=25 - bps=768 - Audio=mp3/96kbps\n\n        The river valleys of Oxfordshire were home to mammoths 250,000 years ago and a gravel pit, soon to become a waste tip, holds vital clues to the landscape of the time.\n\n        Can the Time Team help local archaeologists get all the available evidence out before the waste starts being tipped, and will Phil Harding's reconstruction of an axe of the time prepare the meat for the team's barbecue?\n\nS03E03 - Village of the Templars - Templecombe, Somerset - Res=640x480 - fps=25 - bps=768 - Audio=mp3/96kbps\n\n        The Knights Templar were a major power in the 12th and 13th centuries protecting pilgrims on their way to the Holy Land. They gave their name to the village of Templecombe in Somerset. Time Team visits the village in search of evidence of the Templars.\n\n        Can the team find the preceptory which was their main base? And does the mysterious picture of the disembodied head of Christ hanging in the local church have anything to do with the order of fighting monks?\n\nS03E04 - A Wreck of the Spanish Armada - Teignmouth, Devon - Res=640x480 - fps=25 - bps=768 - Audio=mp3/96kbps\n\n        Over thirty years ago a teenage boy, scuba-diving off Teignmouth beach in Devon, found a bronze cannon on the seabed. He discovered that it was part of an ancient ship that was wrecked some 400 years ago. After all that time under water is there still enough of the ship left for Time Team to identify it? And where did it originally come from - could it in fact have been part of the Spanish Armada?\n\n        Tony Robinson and the team take to the sea for the first ever Time Team underwater excavation.\n\nS03E05 - Palace of the Irish Kings - Navan, County Armagh - Res=640x480 - fps=25 - bps=768 - Audio=mp3/96kbps\n\n        In the ancient literature of Ireland, the fort of Emain Macha was the home of the princes and kings of Ulster. According to the Celtic legends, it was built by King Conchobar who also built two other palaces - one for his treasure and the other for the spoils of war.\n\n        Tony Robinson and the Time Team go to Navan, the modern day site of Emain Macha. Can they find any evidence of the other palaces in just three days? And will they be able to find a connection between what may have been a sacrificial pool and an ancient hill called Haughey's Fort?\n\nS03E06 - Treasures of the Roman Field - Lavenham, Suffolk - Res=640x480 - fps=25 - bps=768 - Audio=mp3/96kbps\n\n        For years a Suffolk farmer has gathered hundreds of pieces of Roman pottery, jewellery and coins from one particular field on his land. Where did all this rich material come from and why is it so concentrated in one area? The Time Team head into the wide open spaces of Lavenham, Suffolk, to find out in the final challenge of this series.\n","torrent":{"xt":"urn:btih:dc2652dcd196d2b2997eb7cbb24b89799eb4719c","amp;dn":"Time+Team+-+Season+03+%281996%29+-+6+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc2652dcd196d2b2997eb7cbb24b89799eb4719c","infoHashBuffer":{"type":"Buffer","data":[220,38,82,220,209,150,210,178,153,126,183,203,178,75,137,121,158,180,113,156]},"announce":[],"urlList":[]}}