{"title":"Russian Painting - Peter Leek - [Non-Fiction] PDF_(K-Slender)","uid":8904303,"size":92141848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc2dbae7768d72478abdb1b9589ec3d3d463b8f5&amp;dn=Russian+Painting+-+Peter+Leek+-+%5BNon-Fiction%5D+PDF_%28K-Slender%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"K-Slender","files":3,"time":1378873433,"description":"ISBN10: 1859959393\nISBN13: 9781859959398\n\nRussia is often viewed as the outsider of the art world, with creative genius frequently being hidden behind the representation of icons such as Rublov. However, with the succession of Pierre Le Grand, it was Europe which brought light to this otherwise ostensibly uncivilized empire. Saint-Petersburg suddenly rose out of the darkness thanks to the brilliance of an Italian artist, and for more than a century afterwards, became a highly important cultural focus. The all powerful Tsar, and later Catherine the Great allowed exchanges between Russian and European artists which eventually gave birth to a new Russian form of painting. Although this was greatly inspired by Italy and its vibrant colours, it stayed true to its foundations in Russian culture. However, it was not until the 20th century that a true national style came into its own with the emergence of the Ambulants and the Blue Roses. This was then followed by the revolutionary period which led to the Russian Avant Garde and then modernism. In this book, we come to understand the author's viewpoint on Russian culture as a combination of western culture as well as eastern. These influences are demonstrated in the works and cover a vast pictorial scope. Artists such as Borovikovsky, Serov, Vrubel, Briullov, Fedotov, Repin, Shishkin and Levitan, among many others, bring their own fundamental contribution to the history of art. Peter Leek puts the evolution of the history of Russian art after the fall of communism into perspective. ","torrent":{"xt":"urn:btih:dc2dbae7768d72478abdb1b9589ec3d3d463b8f5","amp;dn":"Russian+Painting+-+Peter+Leek+-+%5BNon-Fiction%5D+PDF_%28K-Slender%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc2dbae7768d72478abdb1b9589ec3d3d463b8f5","infoHashBuffer":{"type":"Buffer","data":[220,45,186,231,118,141,114,71,138,189,177,185,88,158,195,211,212,99,184,245]},"announce":[],"urlList":[]}}