{"title":"Peeppafull.rar","uid":8918382,"size":13841427,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dd1955491227ec1463eee6b865ec63d613f1048d&amp;dn=Peeppafull.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BertieBooster","files":1,"time":1379196440,"description":"Peeppa - Personal email encryption privacy protection application.\n\nA simple application designed to keep your emails and numerous other forms of online communication private.\n\nWorks with Outlook, hotmail, Gmail facebook, IM software, online document storage providers etc. etc.\n\nUnlike most other encryption software you do not haveto be a Crypotgrapher to set this up or use this software.\n\n It has been designed to emulate a &quot;Chat window&quot;, just copy and paste text between Peeppa and your regular applications, chat sessions and social networks sites.....\n\nIdeal for sensitive business information . Send important information by email safe in the knowledge that only the person with the encryption key will be able to read it.\n\nEasily use the encrypted text in almost all email and chat applications just paste into outlook, hotmail, gmail facebook etc the app automatically copies encrypted and decrypted messages to your clipboard.\n\nPaste encrypted messages in and convert them back into readable text in a single click.\n\nWorks in a variety  of languages.\n\nChoice of encryption strength.\n\nChoose your encryption key or let the app generate one for you. Keys can be as long as 32 characters or as short and as easy to remember as you choose.\n\nUser friendly easily remembered passwords can be just as efffective as long difficult keys.\n\nA simple but very poweful piece of software.\n\n\n","torrent":{"xt":"urn:btih:dd1955491227ec1463eee6b865ec63d613f1048d","amp;dn":"Peeppafull.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1955491227ec1463eee6b865ec63d613f1048d","infoHashBuffer":{"type":"Buffer","data":[221,25,85,73,18,39,236,20,99,238,230,184,101,236,99,214,19,241,4,141]},"announce":[],"urlList":[]}}