{"title":"Phish - 1995/06/23: Waterloo Village  [AUD](FLAC)  **RETRY**","uid":8870804,"size":787955910,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dd660072f153546b6f3ebca9ce025bf0fcd9daa6&amp;dn=Phish+-+1995%2F06%2F23%3A+Waterloo+Village++%5BAUD%5D%28FLAC%29++%2A%2ARETRY%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mousebelt","files":-1,"time":1378057840,"description":"**I'm not sure what went wrong, but this was stuck at 99.9%.  I also shortened the file name length**\n\n\nThis was definitely the most fun I every had at a Phish show.  In the summer of 1995, Phish and the Grateful Dead were winding their way almost side-by-side down the East coast of the United States, southward bound.\n\nBasically, the massive influx of people without tickets into this show (a very LARGE fairground area) caused by an &quot;off-night&quot; for the Dead (e.e. they didn't play that night).  It caused a very large traffic jam on Interstate Route 80, and there were only about 10 state troopers in a crowd of about 30,000 who did not have places to park, and so the traffic jam got worse and worse.\n\nLuckily, I was a local boy, and I was at the show tripping on acid by 3pm.  \n\nWhen Phish came onstage, the show was not so totally crowded yet (general admission show).  There were people still arriving behind us...MANY people.  The show started....I had never heard Simple before (tapes did not circulate THAT fast, back in those days...Simple had debuted a year before).  Reba was amazing, but the You Enjoy Myself was so amazing, so enjoyable, that it led me to the loser life I live outside society that I live today!  Maybe it was the acid, or the extra dancing room, but if you point your ears to this recording, you will hear some very special things.\n\nAnyway, still, I remember near the end of YEM, still MANY people coming into the show.  I found out later that many people missed the first set entirely.  And if you are a fan of Phish statistics, I'll have you know that a first set closing YEM is exceedingly rare.\n\nObviously the wine was flowing that night, because when John Popper (fat guy, Blues Traveler) hit the stage during Harpus, things got a little kooky.  Anyway, the set list says it all with Harpua &gt; Jam &gt; Llama.  During the jam,I realized suddenly I had not eaten for a very long time...I walked up to a stand nearby and weakly requested a sausage, the only food available (it was near the end of the show, you know.  The black woman from behind the counter glared at me and said &quot;Would you pay $5 for this sausage?&quot;  &quot;Whatever&quot; I replied.  (remember, it was the mid-90's and I was still tripping)  &quot;SUCKA!&quot; she said, and gave me the sausage, which ate right up.\n\nThat was pretty much it.  Phish closed with &quot;Day in the Life&quot;.  Now 30,000 people had to make it back out of this place.  There were buses to parking lots, because they were - in some cases - miles away!  I, like many many many others, chose to walk.  A kid actually died...he fell of a slow moving car and hit his head on a rock.  (Ironically, in 1999, kids were be dying NIGHTLY from heroin overdoses.  I know that this is part of the reason Phish first went on hiatus.  It was ridiculous, junkies all over the parking lot, lots of thefts.  I'm referring to Summer 1999, the northeastern leg).\n\nOn the long walk back to my car the only thing I can remember seeing is a few absolutely bewildered police officers (this event is why police NEVER forget Phish now!) and a whole bunch of people dancing to disco with this big speaker in the back of this old Cadillac.  I'll never forget that night.  When we all got back, it was almost 3am.  After that, between then and Phish's hiatus, I saw Phish at least 16 times.\n\nSorry about the long file name.\n\n\nPHISH\n06-23-1995 \nWaterloo Village Music Center\nStanhope, NJ \n\n\nSennhieser ME-80/KU-3's x 421's (x/y) ~&gt; Boss BX-4 ~&gt; sony sbm-m1 ~&gt; Denon DTR-80P ; fob, recorded by Kevin Preuss\n\nSony 59ES &gt; m-audio audiophoile &gt; Dell Inspiron w/ Wavelab 4.0 &gt; CD Wave &gt; flac \n transferred w/o remastering - 11/3/2004 - KP; TLH (4/6/2013)\n  *** 48kHz ***\n\n\nset I:\n1. Simple\n2. Chalk Dust Torture\n3. Prince Caspian\n4. Reba\n5. Ginseng Sullivan\n6. Free\n7. Taste\n8. You Enjoy Myself \n\nset II: \n1. Runaway Jim~&gt; \n2. Lizards\n3. The Wedge\n4. Run Like An Antelope\n5. Harpua~&gt; \n6. Jam*~&gt;\n7. Llama*\n8. Good Times Bad Times*\n   encore:  A Day in the Life \n\n\n*w/ John Popper on harmonica. \n\n\n\nnotes - \n\n        \nopening tune (simple) is a little rough, settling in. Paul dialed it in better on Chalkdust and i could then find my mix and levels, \n        \nlevels were ran a little low at beginning to allow for expansion witout worry of clipping the master as the night went on...\n\n\nI think that we also saw Golden Lady as a soundcheck while setting up the gear.?!\n\n\nSomehow, I did not split/track the encore when in cd wave, so it is also on track 8","torrent":{"xt":"urn:btih:dd660072f153546b6f3ebca9ce025bf0fcd9daa6","amp;dn":"Phish+-+1995%2F06%2F23%3A+Waterloo+Village++%5BAUD%5D%28FLAC%29++%2A%2ARETRY%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd660072f153546b6f3ebca9ce025bf0fcd9daa6","infoHashBuffer":{"type":"Buffer","data":[221,102,0,114,241,83,84,107,111,62,188,169,206,2,91,240,252,217,218,166]},"announce":[],"urlList":[]}}