{"title":"Swingerhead - 1997 - She Could Be A Spy FLAC","uid":8613318,"size":292015253,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:de077a74b887f7978cb72318602a54ae77921d4f&amp;dn=Swingerhead+-+1997+-+She+Could+Be+A+Spy+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eika256","files":-1,"time":1372196544,"description":"Swingerhead - 1997 - She Could Be A Spy\n\nMichael Andrew has always loved swing music. In1990, he formed &quot;The Michael Andrew Orchestras&quot; with the goal of providing timeless music in the style of the big bands of the forties and in the tradition of popular singers like Tony Bennett and Frank Sinatra.\nIn 1993, the world famous Rainbow Room in New York City invited Michael to become their headlining singer and band leader where he performed 5 to 6 nights a week for over two years. In the summer of '96 audiences and critics raved about his &quot;hi-fi,sci-fi&quot; musical comedy, Mickey Swingerhead &amp; The Earthgirls, which was produced in Orlando, Florida.\nIn 1998, Andrew created his dynamic band known as Swingerhead. Even though they had an extensive touring schedule, Swingerhead was considered the house band at Rat Pack's on the Avenue in Orlando. Michael Andrew and the band performed with the Orlando Philharmonic Orchestra to a sold out crowd and received several standing ovations.\nIn 2000, Andrew formed his Los Angeles based band, The Coconut Club Orchestra. They performed at the Coconut Club in Merv Griffin's Beverly Hilton every Saturday night. His Orlando based band, Swingerhead continues to perform throughout Central Florida and the nation and in October of 2001, they won the Best Band award in the category of &quot;Jazz, Lounge and Swing&quot; for the 4th year in a row.\nMichael Andrew can be seen leading his band in the opening scene of the MGM motion picture &quot;Heartbreakers&quot; starring Jennifer Love Hewitt, Sigourney Weaver, and Gene Hackman.\nMichael enjoys working with his own bands as well as making frequent guest artist appearances with symphonic orchestras across the country. (cdbaby)\n\nTrack list:\n01 - She Could Be A Spy\n02 - Lady With The Big Cigar\n03 - Pick Up The Phone\n04 - He Just Wants To Cha Cha\n05 - Swing Out\n06 - Let's Rendezvous\n07 - Candy For Breakfast\n08 - At The Strip\n09 - Mary Ann\n10 - Hey Baby I'm Home\n11 - Trying To Cut Back\n12 - I'll Be Alright\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:de077a74b887f7978cb72318602a54ae77921d4f","amp;dn":"Swingerhead+-+1997+-+She+Could+Be+A+Spy+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de077a74b887f7978cb72318602a54ae77921d4f","infoHashBuffer":{"type":"Buffer","data":[222,7,122,116,184,135,247,151,140,183,35,24,96,42,84,174,119,146,29,79]},"announce":[],"urlList":[]}}