{"title":"Eco-Library Design (gnv64)","uid":9012863,"size":36335963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de86085859bf84154fe773cb1b673a3f30a59dc9&amp;dn=Eco-Library+Design+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":1,"time":1381140136,"description":"Eco-Library Design\nby John A. Flannery and Karen M. Smith\nSpringer | April 2014 | ISBN-10: 9400740778 | PDF | 238 pages | 34.6 mb &lt;a href=&quot;\nhttp://www.amazon.com/Eco-Library-Design-John-A-Flannery/dp/9400740778&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Eco-Library-Design-John-A-Flannery/dp/9400740778&lt;/a&gt;\n\nThe ancient pairing of architecture and books has always been an interesting topic for debate, and the increasing popularity of electronic books has recently added fuel to the fire. However, the bonfires built for the printed version remain unlit. Research undertaken for this publication suggests that the traditional reading room is currently enjoying a renaissance in many different guises, with print and digital media enjoying a symbiotic relationship.\nThe digital revolution is just one of the many challenges faced by the library architect. To satisfy the varied requirements of library users, flexible, future proof, indoor and outdoor spaces must now support both passive and active pursuits. These often contrasting demands can vary dramatically from quiet, contemplative reading to audible public performance.\nThis publication explores in detail the evolution of the eco-library, focusing on how design teams cope with diminishing resources in diverse geographic and climatic conditions. The featured projects demonstrate measurable reductions in both construction and operating costs through innovative designs that utilise the ecology of a selected site in a positive way. A library development will now inevitably seek to lead by example, visibly demonstrating sound environmental practice, and providing an enhanced user experience for increasingly more discerning patrons.\nEco-Library Design provides a worldwide perspective on 21st century trends in library architecture.\n\nAbout the Authors &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/b0/45/26bbeb7676b30a7f02351e.L._V159210801_SX200_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/b0/45/26bbeb7676b30a7f02351e.L._V159210801_SX200_.jpg&lt;/a&gt;\nJohn A. Flannery is the author of several books on architecture and design. With qualifications in industrial design, he has gained over 35 years experience in the Design, Procurement and Project Management of a wide range of construction projects in the industrial, commercial and private sectors throughout Europe, Africa and the U.S.A.. John Flannery currently works as a construction consultant in urban regeneration projects.\nKaren M. Smith is the editor of several books on architecture and design. Her varied career has encompassed a wide range of managerial posts in Public, University and Health Care Libraries; most recently providing consultancy and lecturing on the effective use of information resources. Currently, Ms. Smith specialises in the formulation of library management strategy in the Performance and Planning Department at the University of York Library.\n\nCONTENTS\n1 Introduction\nNew Build\n3 Amsterdam Public Library, Amsterdam, Netherlands\n17 Ballard Library and Neighborhood Service Centre, Seattle, USA\n29 Centro Culturale Elsa Morante, Rome, Italy\n37 Gando School and Library, Gando, Burkina Faso\n45 King Abdullah University of Science and Technology, Thuwal, Saudi Arabia\n55 Liyuan Library, Huairou, China\n65 Oak Park Public Library, Oak Park, USA\n73 The Open-Air-Library, Salbke, Germany\n83 Phoenix Central Library, Phoenix, USA\n95 Traverwood Branch Library, Ann Arbor, USA\n109 University of Aberdeen New Library, Aberdeen, UK\n119 University of Arizona Poetry Center, Tucson, USA\nAdaptive Re-Use\n129 City of Sydney Library Customs House, Sydney, Australia\n137 Cybertheque, McGill University, Montreal, Canada\n145 Old Market Library, Bangkok, Thailand\n153 Willingboro Public Library, Willingboro, USA Margarido House, Oakland, USA\nHybrid Construction\n163 Albertslund City Library, Albertslund Kommune, Denmark\n171 Arkansas Studies Institute, Little Rock, USA\n183 Centennial Library Winnipeg, Winnipeg, Canada\n187 Central Library of Law University of Hamburg, Hamburg, Germany\n201 Library on Cork Street, Winchester, USA\n211 UC Berkeley School of Law, Berkeley, USA\n223 Photo Credits\n225 Index","torrent":{"xt":"urn:btih:de86085859bf84154fe773cb1b673a3f30a59dc9","amp;dn":"Eco-Library+Design+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de86085859bf84154fe773cb1b673a3f30a59dc9","infoHashBuffer":{"type":"Buffer","data":[222,134,8,88,89,191,132,21,79,231,115,203,27,103,58,63,48,165,157,201]},"announce":[],"urlList":[]}}