{"title":"Dog On It - Spencer Quinn.epub","uid":8992875,"size":400466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfde8ab428bb4815879970537f77e6453f08478c&amp;dn=Dog+On+It+-+Spencer+Quinn.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1380833223,"description":"As sidekicks, Maxwell Smart and Agent 99 have nothing on Chet and Bernie. This charming detective duo make their debut in Dog On It, the first volume in Spencer Quinn's new mystery series. The fast-paced and funny tale is narrated by the inimitable Chet, Bernie's best friend and canine partner, whose personality and preferences are never in doubt: &quot;I liked to sleep at the foot of Bernie's bed, but my favorite napping spot was in the breakfast nook, under the table with my back against the wall, all cool and shady, plus there was often good snacking around Bernie's chair.&quot;\n\nBernie's enterprise, the Little Detective Agency, limps along, waiting for the next job to arrive. While Chet freely admits that he doesn't always understand the humans around him, the mutt who failed to graduate from the police academy quickly establishes that he's got a nose made for sniffing out trouble -- as well as the tasty morsel.\n\nWhen the story begins, Chet and Bernie are settled into the companionable routine they established when Bernie got divorced and lost custody of his son. Riding shotgun for stakeouts in Bernie's beat-up convertible (and snarfing up doughnuts and beef jerky) is the perfect life for Chet, though he knows Bernie's worried about cash flow.\n\nBut their luck is about to change. During a nighttime stroll through the neighborhood -- an older enclave in the southwestern desert that Bernie fears will soon be eclipsed by new development -- the pair encounter a panicked neighbor, Cynthia Chambliss. Waving a wad of bills, she beseeches Bernie to find her daughter, Madison, a 15-year-old who has been missing for several hours.\n\nBernie heeds the call of cash and the urgency of parental concern, but Madison soon returns home on her own, only to disappear again in short order -- this time for several days. Cynthia frantically rehires Bernie, but her ex, Damon Keefer, refuses to cooperate, insisting that Bernie be taken off the investigation. Nevertheless, intrigued by the young girl's apparent connections to a group of Russian thugs, Bernie and Chet follow a trail of clues that leads them into more danger than they'd bargained for.\n\nAs Chet and Bernie race across the desert toward Las Vegas in their sandblasted Porsche, Quinn's narrative unfolds with mounting suspense. At every stage of their journey, readers will warm to Chet's loyalty and courage -- to say nothing of his delightfully doggy digressions -- and be captivated by Spencer Quinn's deft blend of humor and thrills in this enormously entertaining tale, bound to be the first of many adventures.\n","torrent":{"xt":"urn:btih:dfde8ab428bb4815879970537f77e6453f08478c","amp;dn":"Dog+On+It+-+Spencer+Quinn.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfde8ab428bb4815879970537f77e6453f08478c","infoHashBuffer":{"type":"Buffer","data":[223,222,138,180,40,187,72,21,135,153,112,83,127,119,230,69,63,8,71,140]},"announce":[],"urlList":[]}}