{"title":"Viewer.Discretion.Is.Advised.Disc2.XXX.DVDRiP.x264-PORNOLATiON","uid":8874764,"size":1441315408,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e04b2cf79dd80d2c86006356582c3adefb5c01e0&amp;dn=Viewer.Discretion.Is.Advised.Disc2.XXX.DVDRiP.x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":-1,"time":1378164542,"description":"Studio: Evil Angel\n Categories: Lesbian\n Director: Aiden Riley\n Starring: Aiden Riley , Ash Hollywood , Dana DeArmond , Kimberly Kane , Lia Lor , Mischa Brooks , Riley Reid , Sinn Sage , Tori Lux\n\n The Following Material Is Questionable At Best!\n\n 'I'm Speechless!' -Belladonna\n\n 'That Turns Me On So Much!' -Kimberly Kane, Actress!\n\n 'Shocking'! -Peter Warren, AVN! 'What The Hell Did I Just Watch?'\n\n Filmmaker Aiden Riley has developed a unique style of hard-core videography while working as smut legend and lesbian aficionado Belladonna's partner in crime. Aiden's special take on 'reality porn' has blossomed into a world of kinky, young alt-girl lovers with a taste for explicit, fetishistic foot play, bizarre toys and dyke perversion, intercut with revealing backstage footage and soul-baring conversation. 'Viewer Discretion Is Advised' is the director's new two-disc, six-and-a-half hour showcase of uninhibited, natural play featuring the current favorites in Belladonna Entertainment's troupe of all-natural, Sapphic sluts. Adorable, young blonde stoners Lia Lor and Ash Hollywood take bong hits while teasing the camera with their smooth, gorgeous legs. They peel out of their fragrant socks to suck on pretty, bare feet!\n\n Next is a filthy scene starring girlfriends Dana DeArmond and Kimberly Kane. Wearing lacy, crotchless panties and knee socks, Dana blows soap bubbles while taunting us with her juicy, fat pussy and winking asshole. Haughty, high-heeled bitch Kimberly masturbates, smoking a cigarette, then dominates Dana's soft ass with some spanking, lewd rimming and ferocious anal drilling from fingers and toes. Tattooed, green-haired temptress Tori Lux, wearing stockings and a foxtail butt plug, gets off with sultry domme Sinn Sage. Lastly, longhaired cuties Riley Reid and Mischa Brooks make out and petite Riley straddles her girlfriend's face. Riley and Mischa grind against each other in orgasmic bliss. Should anybody watch Aiden Riley's newest display of genuine girl-girl nastiness? Unless you're ready for passionate filth, 'Viewer Discretion Is Advised'!\n\n\n &lt;a href=&quot;\nhttp://bayimg.com/japknaAef&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/japknaAef&lt;/a&gt;","torrent":{"xt":"urn:btih:e04b2cf79dd80d2c86006356582c3adefb5c01e0","amp;dn":"Viewer.Discretion.Is.Advised.Disc2.XXX.DVDRiP.x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e04b2cf79dd80d2c86006356582c3adefb5c01e0","infoHashBuffer":{"type":"Buffer","data":[224,75,44,247,157,216,13,44,134,0,99,86,88,44,58,222,251,92,1,224]},"announce":[],"urlList":[]}}