{"title":"Alex Jones Show - 2013 Aug 21 e [sebaygo1]","uid":8836473,"size":63274381,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e119a1b5bcf72c4b755994604cfa31c4bbc9bd96&amp;dn=Alex+Jones+Show+-+2013+Aug+21+e+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1377128033,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday, 21 August 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Wednesday, August 21 edition of The Alex Jones Show, Alex breaks down the fierce push towards an invasion of Syria with the latest chemical weapons attack being blamed on president Bashaar Al-Assad's regime, instead of the repugnant al Qaeda-affiliated Free Syrian Army. \n\nAlex also breaks down the NSA's ever-expanding surveillance state as a recent Wall Street Journal article indicates the agency has the ability to monitor 75 percent of Internet traffic. \n\nAlex also analyzes the accelerating war on whistleblowers and gives updates on NSA leaker Edward Snowden's case, the UK's likely unlawful detainment of Guardian writer Glenn Greenwald's partner and former Army Pfc. Bradley Manning's sentencing of 35 years in prison for his leak of classified files to Wikileaks. \n\nOn today's show, Alex welcomes the close friend of late Rolling Stone journalist Michael Hastings, Staff Sgt. Joe Biggs, to discuss the reporter's autopsy report which found small amounts of marijuana and amphetamine in his blood, but not enough to have impaired his driving at such low levels.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:e119a1b5bcf72c4b755994604cfa31c4bbc9bd96","amp;dn":"Alex+Jones+Show+-+2013+Aug+21+e+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e119a1b5bcf72c4b755994604cfa31c4bbc9bd96","infoHashBuffer":{"type":"Buffer","data":[225,25,161,181,188,247,44,75,117,89,148,96,76,250,49,196,187,201,189,150]},"announce":[],"urlList":[]}}