{"title":"Astounding Stories of Super-Science by Various Authors","uid":8786355,"size":304392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e196e3a1057f1d4d573738f65446c591302f868b&amp;dn=Astounding+Stories+of+Super-Science+by+Various+Authors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OrajelJunkie","files":-1,"time":1375835999,"description":"OLD CROMPTON'S SECRET by HARL VINCENT Tom's Extraordinary Machine Glowed-and the Years Were Banished from Old Crompton's Body. But There Still Remained, Deep-seated in His Century-old Mind, the Memory of His Crime. SPAWN OF THE STARS by CHARLES WILLARD DIFFIN The Earth Lay Powerless Beneath Those Loathsome, Yellowish Monsters That, Sheathed in Cometlike Globes, Sprang from the Skies to Annihilate Man and Reduce His Cities to Ashes. THE CORPSE ON THE GRATING by HUGH B. CAVE In the Gloomy Depths of the Old Warehouse Dale Saw a Thing That Drew a Scream of Horror to His Dry Lips. It Was a Corpse-the Mold of Decay on Its Long-dead Features-and Yet It Was Alive! CREATURES OF THE LIGHT by SOPHIE WENZEL ELLIS He Had Striven to Perfect the Faultless Man of the Future, and Had Succeeded-Too Well. For in the Pitilessly Cold Eyes of Adam, His Super-human Creation, Dr. Mundson Saw Only Contempt-and Annihilation-for the Human Race. INTO SPACE by STERNER ST. PAUL What Was the Extraordinary Connection Between Dr. Livermore's Sudden Disappearance and the Coming of a New Satellite to the Earth? THE BEETLE HORDE by VICTOR ROUSSEAU Bullets, Shrapnel, Shell-Nothing Can Stop the Trillions of Famished, Man-sized Beetles Which, Led by a Madman, Sweep Down Over the Human Race. MAD MUSIC by ANTHONY PELCHER The Sixty Stories of the Perfectly Constructed Colossus Building Had Mysteriously Crashed! What Was the Connection Between This Catastrophe and the Weird Strains of the Mad Musician's Violin? THE THIEF OF TIME by CAPTAIN S. P. MEEK The Teller Turned to the Stacked Pile of Bills. They Were Gone! And No One Had Been Near!","torrent":{"xt":"urn:btih:e196e3a1057f1d4d573738f65446c591302f868b","amp;dn":"Astounding+Stories+of+Super-Science+by+Various+Authors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e196e3a1057f1d4d573738f65446c591302f868b","infoHashBuffer":{"type":"Buffer","data":[225,150,227,161,5,127,29,77,87,55,56,246,84,70,197,145,48,47,134,139]},"announce":[],"urlList":[]}}