{"title":"H.G. Lewis Sexploitation Double Feature","uid":8958029,"size":1417541300,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e2508ba8e29f544d74da644cb7f4a35b602a4cd2&amp;dn=H.G.+Lewis+Sexploitation+Double+Feature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zoticus","files":3,"time":1380043558,"description":"H.G. LEWIS SEXPLOITATION DOUBLE FEATURE\nLiving Venus (1961) and The Alley Tramp (1968)\n\nThe first feature film by Herschell Gordon Lewis, Living Venus, is the story of a man who finds a goddess in a bar, uses her as a model in his new topless-babe- magazine-with-cartoons-and-good-articles, becomes wildly successful, marries the model, and watches everything go to hell on account of his miserable personality. Stars Bill Kerwin, Harvey Korman (of the Carol Burnett Show) and Danica D'Hondt, with Lawrence Aberwood (who played &quot;Lang&quot; in Scum of the Earth). Inspired by the life of Hugh Hefner.\n\nThe Alley Tramp tells of a cute teenager's descent into diagnosed &quot;nymphomania&quot; and all that goes with it (lying, being mean to her mom, sneaking around during school hours, having fun). Not as dumb as it could be, it's actually quite good for the kind of film it is, and the girl is cute. So's her mom, when her mouth is closed. Music &quot;transposed&quot; from the Lewis/Friedman nudie-musical, Goldilocks and the Three Bares. IMDb has a release date of 1968, but I swear the DVD package (and the H.G. Lewis fan book I own) say 1966. It looks like 1966 to me.\n\nMPEG-4 encoded from DVD-R\nLiving Venus is a VHS capture, converted to DVD-R\nAlley Tramp comes from the commercial DVD released by Something Weird Video.\n\n","torrent":{"xt":"urn:btih:e2508ba8e29f544d74da644cb7f4a35b602a4cd2","amp;dn":"H.G.+Lewis+Sexploitation+Double+Feature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2508ba8e29f544d74da644cb7f4a35b602a4cd2","infoHashBuffer":{"type":"Buffer","data":[226,80,139,168,226,159,84,77,116,218,100,76,183,244,163,91,96,42,76,210]},"announce":[],"urlList":[]}}