{"title":"Code Red - Miseducation of the Bloods Part 2 (2013)","uid":8846268,"size":844599684,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3016463b14a7a1fe9f868b9fc8ed3dc54651114&amp;dn=Code+Red+-+Miseducation+of+the+Bloods+Part+2+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mistermastamind","files":-1,"time":1377399058,"description":"Kind: MPEG-4 video file\nSize: 796.9 MB\nBit Rate: 122 kbps\nProfile: Low Complexity\nChannels: Stereo\nVideo Dimensions: 852x480\nTotal Bit Rate: 2119 kbps\nVideo Codec: H.264\n\nCode Red DVD - The Miseducation Of The Bloods Gang Pt. 2 (2013)\n\nFinally A DVD That Puts An End To All The Lies, Rumors &amp; Myths About The Bloods\n\nThis is not some fake gang shit. This is one the realest, livest, most thorough representations of gang life in America these days, offering you an exclusive street documentary-style look into the life and lifestyle of the Bloods gang. Taking you where few other DVDs have the nuts to go, &quot;THE MISEDUCATION OF THE BLOODS&quot; puts you up-close-and-personal with some of the most dangerous gang members in the USA.\n\nOffering you the truth, the whole truth and nothing but the truth, this gang street documentary doesn't feature fake gangsters, fake Bloods, fake threats, or fake shit. THIS IS AS REAL AS IT GETS.\n\nDispelling rumors, lies and myths about the Bloods gang, this DVD lets you know what really goes down inside the Bloods organizations across the United States. Documenting real Blood members from New York to New Jersey to Baltimore, and of course Los Angeles, this DVD lets you know everything you wanted to know about the Bloods, including telling you the real deal about all the shit you think you know.\n\nCODE RED reveals the answers to the unanswered questions about the Bloods! Get real answers about the relationship between the East Coast and the West Coast Bloods from both East to West Coast sets. Find out the truth about OG Mack, The East Coast UBN and what it really takes to be given the title &quot;Five Star General.&quot; Hear what the streets have to say about the current state of the Bloods on the East Coast, and find out which of your favorite rappers are really Bloods and which ones are industry imposters.\n\nCODE RED PUTS IN THE WORK TO GET YOU THE TRUTH.\n\nOne of the most controversial DVDs to ever hit the pavement is back with a eye-opening sequel! With the first 'Code Red' DVD dating back to October of 2008, the street documentary DVD was one of the first gang films of it's kind! Code Red was a project that finally revealed the truth , as well as the lies, myths &amp; rumors, about the East and West Coast Bloods.\n\nWell Part 2 is here and this DVD was worth the wait. Back with more insider info and details about The Bloods &amp; Piru's from both the East and West Coast, CODE RED Pt. 2 explores the underworld of the gang lifestyle like you've never seen before.","torrent":{"xt":"urn:btih:e3016463b14a7a1fe9f868b9fc8ed3dc54651114","amp;dn":"Code+Red+-+Miseducation+of+the+Bloods+Part+2+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3016463b14a7a1fe9f868b9fc8ed3dc54651114","infoHashBuffer":{"type":"Buffer","data":[227,1,100,99,177,74,122,31,233,248,104,185,252,142,211,220,84,101,17,20]},"announce":[],"urlList":[]}}