{"title":"The Odd  Couple S2","uid":8947068,"size":5622005807,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e3deee33f806d975cec6a83b416353ac383b488d&amp;dn=The+Odd++Couple+S2+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wackjob2","files":24,"time":1379800125,"description":"\nS2, Ep1\nSep. 17, 1971\nNatural Childbirth\nOscar's niece, Martha, is planning to have a home birth. Felix is supportive; while Oscar is panicky.\n \nFelix's Wife's Boyfriend\nS2, Ep2\nSep. 24, 1971\nFelix's Wife's Boyfriend\nNancy's brother is in town and Oscar tries to find him a date. When none of Oscar's friends are available, Nancy sets up Raymond with Felix's ex-wife Gloria. Felix is jealous.\n \nHospital Mates\nS2, Ep3\nOct. 1, 1971\nHospital Mates\nOscar and Felix end up in the same hospital room at the same time for different reasons.\n \nSleepwalker\nS2, Ep4\nOct. 8, 1971\nSleepwalker\nOscar, on the advice from girlfriend Nancy, tries being nicer to Felix. In trying too hard to be so, it causes him to sleepwalk and hit Felix on the head with a rolled up newspaper every night.\n \nA Grave for Felix\nS2, Ep5\nOct. 15, 1971\nA Grave for Felix\nNeeding money for gambling game, Oscar throws in the deed to Felix's cemetery plot on a hand, but loses the round. Oscar now has to help Felix find another place for his final resting place.\n \nMurray the Fink\nS2, Ep6\nOct. 29, 1971\nMurray the Fink\nMurray complains that after 15 years on the police force, he gets a gold watch. The guys at the regular poker game tease him and tell him he is just too nice. To prove he can be touch, Murray arrests his friends in the poker game.\n \nDoes Your Mother Know You're Out, Rigoletto?\nS2, Ep7\nNov. 5, 1971\nDoes Your Mother Know You're Out, Rigoletto?\nFelix is organizing a local production of an opera, and Oscar even helps to get a well-known opera singer to agree to perform. On the day of the performance, the opera singer gets injured, and Felix is forced to take the role.\n \nFat Farm\nS2, Ep8\nNov. 12, 1971\nFat Farm\nFelix and Oscar's girlfriend are concerned about Oscar's health. They force him to go to a fat farm, and Felix goes with him.\n \nThe Odd Couple Meet Their Host\nS2, Ep9\nNov. 19, 1971\nThe Odd Couple Meet Their Host\nFelix takes publicity photos of David Steinberg. David mentioned he wants Oscar to appear on his show. On the show, Oscar jokes about his fussy, clean-freak roommate Felix. Now, Felix wants to go on the show to talk about Oscar's messiness.\n \nWin One for Felix\nS2, Ep10\nDec. 3, 1971\nWin One for Felix\nFelix is way out of his element when he, feeling he is growing apart from his son, becomes the coach of his football team.\n \nBeing Divorced Is Never Having to Say I Do\nS2, Ep11\nDec. 10, 1971\nBeing Divorced Is Never Having to Say I Do\nBlanche is about to remarry. Oscar is enthusiastic about the match, (especially as he will not have to pay any more alimony). But Felix is uncertain Blanche is doing the right thing.\n \nSurprise! Surprise!\nS2, Ep12\nDec. 17, 1971\nSurprise! Surprise!\nFelix's surprise birthday party for his daughter is in competition with Oscar's big poker game.\n \nFelix, the Calypso Singer\nS2, Ep13\nDec. 24, 1971\nFelix, the Calypso Singer\nOscar's girlfriend, Nancy, gets called to work at the last minute before their vacation and has to cancel, and Oscar asks Felix to go with him, instead. They get to their room after a harrowing flight and cab ride, and while Felix is out renting a tandem bicycle for their weekend, Oscar's girlfriend calls and says she can make it down for vacation after all. Oscar &quot;dumps&quot; Felix, who then has a bad day touring the town. In the bar that evening, Oscar arranges for Felix to sing Calypso.\n \nAnd Leave the Greyhound to Us?\nS2, Ep14\nDec. 31, 1971\nAnd Leave the Greyhound to Us?\nOscar's love for betting takes on a whole new meaning after he buys a racing dog. But the race is all but done when Felix becomes attached to the animal.\n \nSecurity Arms\nS2, Ep15\nJan. 7, 1972\nSecurity Arms\nOscar wakes up to find Felix tied up and bandaged. Their apartment has been robbed. They find another place to live, but it causes different problems.\n \nSpeak for Yourself\nS2, Ep16\nJan. 14, 1972\nSpeak for Yourself\nThe story is told through flashbacks of how Oscar introduced Felix to Gloria. Then, after Felix and Gloria had been seeing each other for a while, Felix wants to propose marriage, but loses his voice. Oscar proposes for Felix.\n \nYou Saved My Life\nS2, Ep17\nJan. 21, 1972\nYou Saved My Life\nAs Felix is cleaning the outside of the windows, he loses his balance and tips backward, half in and half out of the apartment. Oscar pulls him in. Felix decides to thank Oscar in every way possible for saving his life.\n \nWhere's Grandpa?\nS2, Ep18\nJan. 28, 1972\nWhere's Grandpa?\nOscar is ecstatic that Felix has left for a long vacation until Felix's grandfather shows up and decides to move in.\n \nPartner's Investment\nS2, Ep19\nFeb. 4, 1972\nPartner's Investment\nOscar finds out Felix has been taking money from him every day for about two years, putting the money into a bank account for Oscar's saving. With it's accumulation, Oscar &amp; Felix decide to invest in a Japanese restaurant.\n \nGood, Bad Boy\nS2, Ep20\nFeb. 11, 1972\nGood, Bad Boy\nFelix becomes a kind of Big Brother to a young teenager in a reform school. He constantly talks about how a troubled youth should be treated just like any other kid - until he asks his daughter out on a date.\n \nA Night to Dismember\nS2, Ep21\nFeb. 18, 1972\nA Night to Dismember\nOnly Felix would arrange a special lunch date for Oscar and his ex-wife on the anniversary of their divorce. They recall the last night they all spent together - with very different results.\n \nOscar's Promotion\nS2, Ep22\nFeb. 25, 1972\nOscar's Promotion\nOscar is given the chance to be the writer for the newspaper sports supplement, and it may even become a weekly issue. The first story is a wrestling match between the United States and China. Felix finds his own way to help.\n \nPsychic, Shmychic\nS2, Ep23\nMar. 3, 1972\nPsychic, Shmychic\nFelix tells Oscar he will win Sportswriter of the Year. Oscar gets a call and finds out he did win. Felix says when he has a fever, his predictions come true. Felix has a premonition of Oscar involved in a murder. Will this come true?\n \n","torrent":{"xt":"urn:btih:e3deee33f806d975cec6a83b416353ac383b488d","amp;dn":"The+Odd++Couple+S2+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3deee33f806d975cec6a83b416353ac383b488d","infoHashBuffer":{"type":"Buffer","data":[227,222,238,51,248,6,217,117,206,198,168,59,65,99,83,172,56,59,72,141]},"announce":[],"urlList":[]}}