{"title":"The Daredevil Christopher Wright - The Nature of Things [2012][E","uid":8977487,"size":246925320,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e451ed96d29ac9d003dd6ebd1547809f78648625&amp;dn=The+Daredevil+Christopher+Wright+-+The+Nature+of+Things+%5B2012%5D%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":13,"time":1380480128,"description":"Artist: The Daredevil Christopher Wright\nRelease: The Nature of Things \nReleased: 2012\nLabel: Almost Musique\nCatalog#: ALMST07\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Folk, Post Rock, Psychedelic Rock\n\n\nI &amp; Thou\t\nDivorce\t\nBlood Brother\t\nWe Fold Inside Of Us\t\nChurch\t\nAndrew The Wanderer\t\nAmes, IA\t\nSan Francisco Bay\t\nPale Horse, Pale Rider\t\nThe Birds Of The Air And The Flowers Of The Field\t\nThe Animal Of Choice\n\nHailing from the relatively small Eau Claire, Wisconsin, music scene, the Daredevil Christopher Wright might have something of a kid brother complex going on. Though the band was formed in 2004, its relatively sporadic output had been celebrated in part due to involvement from fellow Eau Claire musician Justin Vernon of Bon Iver's connection to the group's 2009 debut album, In Deference to a Broken Back. Vernon mixed several songs on that album, which was a colorful affair that used a wide variety of guest musicians and auxiliary sounds to augment singer/songwriter Jon Sunde's winsome orchestral folk-rock. The album was bright, if sometimes with depressing lyrical tones, and leaned heavily on the trends made popular by aughts indie folksters like Fleet Foxes, Grizzly Bear, and of course their buddies in Bon Iver. For its second album, The Nature of Things, the band tones down the instrumentation some but still fits nicely in the niche carved out by the brighter stars of the neo-folk-rock scene. The a cappella harmonies that begin &quot;Blood Brother&quot; ride a melody that sounds not just cribbed from the Bon Iver handbook but lifted outright. This gives way unexpectedly to a jittery pseudo-African guitar figure and spare percussion before the band inexplicably pauses for an extremely awkward 16 seconds before blurting out another verse and then ending abruptly. The song is a series of strange choices in arrangement, and the weirder the band gets, the easier it is to forget the hyper-derivative intro, but there are fragments of copycat sounds intermingled throughout the more interestingly weird choices on the album. Vocal-heavy songs like &quot;Church&quot; and &quot;Ames, IA&quot; rely on ghostly harmonies and spare instrumentation, ending up in a strange daydreamy territory somewhere between a SMiLE-era Beach Boys outtake and half-composed Fleet Foxes tune. There are also strong undercurrents in the songs of both late-'60s soft psychedelia like Kevin Ayers or Robert Wyatt as well as late-'90s Chicago post-rock touches. The Nature of Things pairs these obtuse influences with experimentally minded arrangements and production, as on the cavernous percussion and hall-closet vocal miking of &quot;Pale Horse, Pale Rider&quot; and the shimmering highlife guitar tones of &quot;Andrew the Wanderer.&quot; Their sound is still couched heavily in sometimes benign indie folk songcraft, but the ride gets more interesting when the group's idiosyncracies bubble over in the mix or peek offishly from behind corners. Never bland, the Daredevil Christopher Wright rise from good to great when they let their freak flag fly and allow their true weird personalities to come out.","torrent":{"xt":"urn:btih:e451ed96d29ac9d003dd6ebd1547809f78648625","amp;dn":"The+Daredevil+Christopher+Wright+-+The+Nature+of+Things+%5B2012%5D%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e451ed96d29ac9d003dd6ebd1547809f78648625","infoHashBuffer":{"type":"Buffer","data":[228,81,237,150,210,154,201,208,3,221,110,189,21,71,128,159,120,100,134,37]},"announce":[],"urlList":[]}}