{"title":"Tales from the Saragossa Manuscript","uid":8931816,"size":451384,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e464449a6fc4d43845b4900465238b7a895495ff&amp;dn=Tales+from+the+Saragossa+Manuscript&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"livhre","files":-1,"time":1379476904,"description":"'As a reader you find yourself teased, intrigued and disorientated. You never quite know where you are - whether you are reading a series of lies, illusions and superstitious tales, or whether this is a great work of art with its own special kind of truth. Although the book clearly has roots in medieval forms, it is also amazingly modern - predating the works of Italo Calvino and the Magical Realists by at least 150 years, and, incidentally, making them look rather tame. The English translation by Christine Donougher is a model of clarity and quiet elegance.' Book Choice, BBC World Service 'Bizarre, relentlessly inventive and decidedly not a novel. It is more a textbook of crazy magic.' The Guardian 'By far my favourite novel of clandestine fraternities, spine-chilling plots and mystic revelations was written 200 years ago by a Polish adventurer, Jan Potocki; the legendary Manuscript Found in Saragossa. And its infinitely more erotic than the prim Mr B (Dan Brown).' Boyd Tonkin in The Independent 'A masterpiece of French Literature which is one of the all time great works of fantasy; one of those rare books which invigorates and nourishes the human spirit and the dignity of man.' Roger Caillois","torrent":{"xt":"urn:btih:e464449a6fc4d43845b4900465238b7a895495ff","amp;dn":"Tales+from+the+Saragossa+Manuscript","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e464449a6fc4d43845b4900465238b7a895495ff","infoHashBuffer":{"type":"Buffer","data":[228,100,68,154,111,196,212,56,69,180,144,4,101,35,139,122,137,84,149,255]},"announce":[],"urlList":[]}}