{"title":"The Zen Teaching of Bodhidharma ","uid":8543247,"size":7772530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5effc6103a7e9e7851929d1fd477928ea7fa22c&amp;dn=The+Zen+Teaching+of+Bodhidharma+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1370452757,"description":"The Zen Teaching of Bodhidharma By Bodhidharma, Red Pine\n1989 | 144 Pages | ISBN: 0865473994 | EPUB \n\n\n\nA fifth-century Indian Buddhist monk, Bodhidharma is credited with bringing Zen to China. Although the tradition that traces its ancestry back to him did not flourish until nearly two hundred years after his death, today millions of Zen Buddhists and students of kung fu claim him as their spiritual father.\n\nWhile others viewed Zen practice as a purification of the mind or a stage on the way to perfect enlightenment, Bodhidharma equated Zen with buddhahood and believed that it had a place in everyday life. Instead of telling his disciples to purify their minds, he pointed them to rock walls, to the movements of tigers and cranes, to a hollow reed floating across the Yangtze.\n\nThis bilingual edition, the only volume of the great teacher's work currently available in English, presents four teachings in their entirety. &quot;Outline of Practice&quot; describes the four all-inclusive habits that lead to enlightenment, the &quot;Bloodstream Sermon&quot; exhorts students to seek the Buddha by seeing their own nature, the &quot;Wake-up Sermon&quot; defends his premise that the most essential method for reaching enlightenment is beholding the mind. The original Chinese text, presented on facing pages, is taken from a Ch'ing dynasty woodblock edition.","torrent":{"xt":"urn:btih:e5effc6103a7e9e7851929d1fd477928ea7fa22c","amp;dn":"The+Zen+Teaching+of+Bodhidharma+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5effc6103a7e9e7851929d1fd477928ea7fa22c","infoHashBuffer":{"type":"Buffer","data":[229,239,252,97,3,167,233,231,133,25,41,209,253,71,121,40,234,127,162,44]},"announce":[],"urlList":[]}}