{"title":"British Sea Power - Open Season [2005][EAC,log,cue. FLAC]","uid":8883695,"size":351911444,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e5f18d68a80f32d26f939d8f16fd90449e702698&amp;dn=British+Sea+Power+-+Open+Season+%5B2005%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":21,"time":1378398064,"description":"Artist:British Sea Power\nRelease:Open Season\nReleased: 2005\nLabel: Rough Trade Records\nCatalog#: RTRADCD200\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: UK\nStyle:rock\n\n00 How Will I Ever Find My Way Home? (Organ Version) 2:54\n01 It Ended On An Oily Stage 4:23 \n02 Be Gone 2:52 \n03 How Will I Ever Find My Way Home? 3:11 \n04 Like A Honeycomb 4:31 \n05 Please Stand Up 3:07 \n06 North Hanging Rock 4:26 \n07 To Get To Sleep 3:16 \n08 Victorian Ice 3:26 \n09 Oh Larsen B 5:30 \n10 The Land Beyond 4:00 \n11 True Adventures 7:52\n\nBritish Sea Power's 2003 debut album was a fascinating post-punk-inspired set that sparked artful originality and thought-provoking emotion. Their follow-up, Open Season, does the same but it's much more of a streamlined affair. Open Season is virtually a 45-minute waltz of lilting string arrangements and dreamy vocals while acoustic and electric guitars chase the album's quiet golden tones. A theme of the great outdoors makes it a relaxed occasion from start to finish; the 11 songs featured aren't a schoolbook interpretation on life's hardships as much as they are a reflection on the confusion (and love) of nature. Frontman Yan and his brother Hamilton remain charming eccentrics, but this time they're poetic with their stoic, overcast outlook on modern life. The question Yan seems to ask throughout Open Season is whether or not life is really crap. Commencing with the copper-toned &quot;It Ended on an Oily Stage,&quot; Yan softly croons, &quot;We found God in a parking lot.&quot; He ponders whether the experience was actually real, and if it has ever happened to anyone. &quot;How Will I Ever Find My Way Home?,&quot; an emotional seesaw of crunchy guitars and sheeting percussion, is oddly comfortable with the album's continuous mental inquisitions. The bird echoes of &quot;Please Stand Up&quot; match the ice-capped perils of &quot;Oh Larsen B,&quot; maintaining the album's rich affections. Some might think that the five Cumbrian intellectuals have made their shining pop moment with this record despite British Sea Power making it quite obvious on The Decline of... that they're anything but a pop band. British Sea Power's smart approach on Open Season showcases a band in progress. This album feels alive and breathes honesty. Such an impression once again makes way for British Sea Power to stand apart from their counterparts (Doves, Coldplay, South).","torrent":{"xt":"urn:btih:e5f18d68a80f32d26f939d8f16fd90449e702698","amp;dn":"British+Sea+Power+-+Open+Season+%5B2005%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5f18d68a80f32d26f939d8f16fd90449e702698","infoHashBuffer":{"type":"Buffer","data":[229,241,141,104,168,15,50,210,111,147,157,143,22,253,144,68,158,112,38,152]},"announce":[],"urlList":[]}}