{"title":"9/11::The BIGGEST LIE: 2nd Edition WMV","uid":8619801,"size":833572435,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5fa3f3eb166b900f365d584de35077a28d35767&amp;dn=9%2F11%3A%3AThe+BIGGEST+LIE%3A+2nd+Edition+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1372340270,"description":"\nOk you were duped. Twice! There were no airplanes and the following alternate shots manufactured by the news stations, both live and subsequent video provided later.\nIn fact every single shot with a plane in it is a bold faced lie. There were no planes at all. Here are examples of how similar looking visual evidence prooves how one could easily be fooled. This means that your media is controlled by powerful people who saw to it that you saw an airplane hit a building on september 11th. I can explain the entire process. A number of conspirators had orders to do specific tasks on the morning of 9/11. Each person involved had synchronized watches. Media personel complicit reported seeing a plane but I bet you my head on a platter that not one single new yorker saw a plane in the sky above lower manhattan that day. Why no plane at all? They were trying to save money. Actually they had the audacity to see a self fulfilling prophecy that the sheep would not make a noise. You see people in general in the United States have been conditioned to believe so much in their country that they are completely disillusioned by the idea that the powers that be would ever betray them. In fact that is just exactly what they did. They lied in more ways than one and hundreds if not thousands stood to gain gobs of money and  having the gall to start attacking muslims ad nauseum, killing more than 3 million that is estimated, some grimmer estimates put it at more like 9 million. And who is behind this holocaust? None other than the jews. The Jews and Zionists are responsible for crimes against humanity and are terrorists at large. The lives lost on 9/11 were never justified in any shape or form by attacking muslim countries and to the contrary the perpetrators have enjoyed unrestrained corruption of the american government such that it now stands for lies and deception and the world should not stand for it! These would be overlords stole 9 trillion dollars recently just as they did on 9/11, steal 2.3 trillion. \nBe aware that they have evil plans and intend to implement them in due course. These include the systematic murdering of american citizens who dissent, being put in fema camps and put in coffins that hold 3 to be incinerated, just like the Jews of world war 2. And let it be known that the tally of 6 million jews was invented and from every person to cite such a number they were proven to be deceivers. In what way is the extermination of Jews by hitler justification for subverting the first world governments and manipulating democratic nations into Orwellian prison nations where fear and corruption rule. Be ware of Obama, the government and the governments of western nations, but in particular, BEWARE of Israel. These culprits are cut throats and murderous of women children men the sick the elderly, and their wanton destruction of islam is the bain of all human existance. The new world order will never control the world. The people of the world will come together and forge an alliance against the forces of evil that truly exist behind the curtains of priviledge and power.\n","torrent":{"xt":"urn:btih:e5fa3f3eb166b900f365d584de35077a28d35767","amp;dn":"9%2F11%3A%3AThe+BIGGEST+LIE%3A+2nd+Edition+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5fa3f3eb166b900f365d584de35077a28d35767","infoHashBuffer":{"type":"Buffer","data":[229,250,63,62,177,102,185,0,243,101,213,132,222,53,7,122,40,211,87,103]},"announce":[],"urlList":[]}}