{"title":"KYLIN-2.1 OS Operating System of the Military of China","uid":8654702,"size":1171643443,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:e619d4d68f4a34c5700d98234ff2c803b8b92401&amp;dn=KYLIN-2.1+OS+Operating+System+of+the+Military+of+China&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"basimama","files":-1,"time":1373188798,"description":"Kylin OS (Operating System of the Government and Military of China) based on FreeBSD\n\n After the recent escalation of cyber attacks on U.S. soil and produced subsequent to the Chinese government claims to be creating a breeding ground for an imminent Cyberwar, information has emerged indicating that the Chinese Government has deployed a new name Kylin Operating System, which in theory would be invulnerable to any known form of attack, whether from the United States, or any other source. While there have begun to launch virtual missiles, defense measures taken by both powers cast a veil of concern about the global digital community.\n\nSYSTEM INFORMATION:\n\nKylin is an operating system that focuses on the performance of high availability and security. Its initial development was funded and sponsored by the Chinese Government Research and Development (R &amp; D) in 2002. The first public version of Kylin was released in 2007.\n\nKylin is based on FreeBSD 5.3 with some own security extensions to add an additional level of security for that operating system. Kylin, Qili name, a mythical beast, is organized in a hierarchical model, including the core layer, which is responsible for initializing the hardware and providing basic memory management and task management, layer service system based on FreeBSD provides UFS2 and BSD networking protocols, and the desktop environment that is similar to Windows. It is designed to meet the UNIX standards and is compatible with Linux binaries.\n\nKylin is approved for use by the People's Liberation Army and apparently has been deployed in the Chinese military, national defense and sensitive government organizations since 2007. Kylin is also being used in finance, government and education.\n\nCompanies using Kylin:\n\n- China Construction Bank\n- North China Electric Power\n- Xiangcai Securities\n- Shanghai Unicom\t\t","torrent":{"xt":"urn:btih:e619d4d68f4a34c5700d98234ff2c803b8b92401","amp;dn":"KYLIN-2.1+OS+Operating+System+of+the+Military+of+China","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e619d4d68f4a34c5700d98234ff2c803b8b92401","infoHashBuffer":{"type":"Buffer","data":[230,25,212,214,143,74,52,197,112,13,152,35,79,242,200,3,184,185,36,1]},"announce":[],"urlList":[]}}