{"title":"[ExploitedCollegeGirls] Terra From University of Phoenix","uid":8625284,"size":656133935,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e702d206d8272980f0605fe43364661149729421&amp;dn=%5BExploitedCollegeGirls%5D+Terra+From+University+of+Phoenix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1372489432,"description":"[ExploitedCollegeGirls] Terra From University of Phoenix\n\nSo our latest ECG update, Terra, does not have a lot of confidence or self esteem. News Flash!!! News Flash!!! A girl is doing porn that has low self-esteem and very little confidence! I think that is a first for a girl thinking about sucking cock on camera for the first time.\nShe may not be oozing with confidence and self esteem, but she is and she likes to be adventurous. With everything new that I made her do, like giving me a bj in the car or licking my ass, lol, she responded with, &quot;it's adventurous&quot; or &quot;that was adventurous!&quot;. If our little college whore is not being &quot;adventurous&quot;, she likes things to be romantic. Hell, she makes all the guys she dates wait 2 months before she gives it up to them. She says that sex is something special and it should have meaning.\n\nWell, how much more romantic can u be than to make her get naked in my car within 5 minutes of picking her up!! Or by making her extremely uncomfortable sucking my cock while we drive. The whole time she thought we would get into an accident. Other spontaneous, adventurous, or &quot;romantic&quot; acts of love we did for the first time were: getting double penetrated with dildos, being deep throated, having her ass licked, and then being encouraged to lick mine, that's my favorite!! We also did the most romantic thing that any guy can do to a girl: I shoved my cock up her virgin asshole!!! Lol!\n\nWell, I got my cock half way up her ass and she began to cry! Tears of love and joy I'm sure, lol!!! I just loved fucking Terra's tight pussy so much I really did not mind that I didn't get that ass. I liked it so much that I could not hold my load and I blew inside the condom when she was on top of me. But I was able to muster up a little man juice to blow into her mouth at the end. It was so funny to watch Terra's expressions as I told her that i was going to blow my load on her face at the beginning of the shoot!!! I just could not let a girl that has never had a facial or has not swallowed cum before get away without me doing at least one of them to her.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9elldo5pbalu1sq4py6j.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9elldo5pbalu1sq4py6j.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=minu47o42wj96ohy4ax6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=minu47o42wj96ohy4ax6.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e702d206d8272980f0605fe43364661149729421","amp;dn":"%5BExploitedCollegeGirls%5D+Terra+From+University+of+Phoenix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e702d206d8272980f0605fe43364661149729421","infoHashBuffer":{"type":"Buffer","data":[231,2,210,6,216,39,41,128,240,96,95,228,51,100,102,17,73,114,148,33]},"announce":[],"urlList":[]}}