{"title":"Marie McCray - Home Sweet Home 1080p","uid":9005810,"size":1007764651,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e72286a623fcbb5b4ca2f4ba0543c4a9232d7e23&amp;dn=Marie+McCray+-+Home+Sweet+Home+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1381027490,"description":" &lt;a href=&quot;http://www.hostpornpics.net/pornmg/share.php?id=CD14_5250B204&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.hostpornpics.net/pornmg/share.php?id=CD14_5250B204&lt;/a&gt;\n\n\nDescription\n\n\n\nYoung lovers Marie McCray and Seth Gamble can hardly wait to get home and ravish each other. Their incredible chemistry is evident as Maria lovingly kisses her beau and then pushes him to the bed so she can unveil Seth's long hard dick.\n\nLicking and kissing all over his shaft, she covers it with her mouth and begins to suck while staring at her man with her icy blue eyes. Her slow soft suction drives Seth wild. When they cannot wait any longer to take pleasure in one another, Marie removes her dress to reveal her supple body while Seth sheds his clothes.\n\nWith a few sensual licks, Seth lubricates the lips of Marie's vagina before thrusting his tongue into her tight hole. Reveling in the sensation as Seth eats her out, Marie wraps her legs around her lover's shoulders and allows the pleasure to ignite a deeper passion that only her lover's throbbing cock can fill.\n\nKnowing that Marie is on the edge, Seth kisses his way up her body and positions his dick over her drenched vagina, pushing it inside her. Marie moans in anticipation and grips the pillow behind her head as her man penetrates her deeper and harder with each thrust.\n\nBy mutual agreement they shift to allow Marie to climb on top and take control of their pleasure in reverse cowgirl position. She sinks down onto his stiff member while her bouncing breasts quiver with every movement.\n\nAs amazing as that feels, they return to the more intimate missionary position to finish their lovemaking. Marie's soft pussy tightens around Seth as he drives her over the edge of ecstasy. As he reaches his own climax, Seth pulls his cock out and cums all over his lover's taut stomach while Marie watches with a sated smile.\n\nSize: 1007764651 bytes (961.08 MiB), duration: 00:17:42, avg.bitrate: 7591 kb/s\nAudio: aac, 44100 Hz, stereo, s16, 106 kb/s (eng)\nVideo: h264, yuv420p, 1920x1080, 7474 kb/s, 23.98 fps(r) (eng)\nstep: 96 s; # tiles: 2x5, tile size: 510x286; total size: 1024x1454","torrent":{"xt":"urn:btih:e72286a623fcbb5b4ca2f4ba0543c4a9232d7e23","amp;dn":"Marie+McCray+-+Home+Sweet+Home+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e72286a623fcbb5b4ca2f4ba0543c4a9232d7e23","infoHashBuffer":{"type":"Buffer","data":[231,34,134,166,35,252,187,91,76,162,244,186,5,67,196,169,35,45,126,35]},"announce":[],"urlList":[]}}