{"title":"Bailey.Blue.Wide.Open.XXX.DVDRip.x264-CHiKANi","uid":8980093,"size":1557188988,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e863a1699d7ac65449da8d2119fdd56bf925266c&amp;dn=Bailey.Blue.Wide.Open.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1380542061,"description":" &lt;a href=&quot;http://postimg.org/image/u12vilhzl/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://postimg.org/image/u12vilhzl/&lt;/a&gt;\n\n\n\nPorn director/legendary stud Manuel Ferrara presents a kinky feature showcasing the talents of one of the industry's sexiest new starlets. &quot;Bailey Blue Wide Open&quot; is four scenes of intense erotic drama, a modern Cali-style Story Of O with an emphasis on nasty, raw anal fucking. Bailey plays a homeless L.A. street urchin accosted by domme bitch Sovereign Syre and offered an intriguing proposition: 24 hours of complete sexual submission in exchange for whatever Bailey desires. The petite, all-natural blonde accepts the deal - and following a sensuous makeover, she becomes the plaything of an elite society of wealthy, predatory perverts. They introduce the nubile cutie to the joys of rectal penetration, stretching Bailey's tender asshole as well as her erotic limits. Sovereign offers Bailey to Manuel to be broken in with a thorough anal reaming and messy cum facial from the director's massive cock. Next, a nasty, ritualistic session of oil-slathered lesbian lust in a dark room subjects Bailey to massive dildos. This ass-expanding lesson climaxes with a creamy, four-man bukkake all over Bailey's pretty face. She joins sexy Lea Lexis for some fishnet-clad, girl-on-girl lovemaking ... and a raunchy anal three-way with Manuel that culminates in an oral sperm swap. Finally, the newly liberated slut takes on muscular, well-hung studs Karlo Karrera and Ramon in a sick, no-holes-barred double penetration. At the end of her adventure, our lovely tramp's deepest wishes come to pass. &quot;Bailey Blue Wide Open&quot; is a tale of backdoor debauchery flowering with forbidden passion.\n\n\n\nBailey Blue, Sovereign Syre, Lea Lexis, Manuel Ferrara, Karlo Karrera, Ramon.\n\nReleasedate: 28-09-2013\nRetaildate: 19-09-2013\nRuntime: 146 min / 1disk(s)\nVideo: x264 @ 1285 kbps\nVideo: CRF 20/1485mb\nAudio: 132 kbps [AAC]\nReso: 704x396 [16:9]\nSize: 1.465 GB[i][/i]","torrent":{"xt":"urn:btih:e863a1699d7ac65449da8d2119fdd56bf925266c","amp;dn":"Bailey.Blue.Wide.Open.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e863a1699d7ac65449da8d2119fdd56bf925266c","infoHashBuffer":{"type":"Buffer","data":[232,99,161,105,157,122,198,84,73,218,141,33,25,253,213,107,249,37,38,108]},"announce":[],"urlList":[]}}