{"title":"Coast to Coast AM june 21, 2013 - Pawnbroking, UK UFO Files, &amp;am","uid":8636226,"size":56245280,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e9763500296fe48d9ef3d73e6dde42726526de25&amp;dn=Coast+to+Coast+AM+june+21%2C+2013+-+Pawnbroking%2C+UK+UFO+Files%2C+%26am&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pyramid91","files":5,"time":1372754676,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-21-13\nHost:\nGeorge Noory\nGuests:\nLes  Gold,             Nick  Pope,                   Open  Lines\nIn the first hour, third-generation pawnbroker, Les Gold,discussed his pawnshop business as well as some of his weirdest, wackiest deals and steals. &quot;We're the perfect barometer for the way the economy is running,&quot; Gold said, about his Detroit-based pawnshop which sees around 100 transactions a day. To that end, he explained that one can ascertain the health of the economy by observing the difference between the amount of customers pawning items versus those who are redeeming their previously pawned valuables. Surprisingly, he estimated that 90% of his customers ultimately return to the shop to reclaim merchandise that they have pawned. Gold also revealed that the most expensive piece his shop has taken as a pawn was an Elizabeth Taylor brooch, that had been certified as owned and worn by the famous actress, which fetched a whopping $100,000 dollars. \nIn the second hour, UFO expert Nick Pope talked about the final batch of UFO files released by the UK government. He dismissed the media's assertion that the Ministry of Defense UFO desk was shut down because there was &quot;nothing of interest&quot; found as a result of the study. Pope cited a sharp rise in UFO reports from 2006 to 2009 and the fact that many of the cases had prosaic explanations as two critical factors which likely led to frustration with the project and the decision to close the desk. Additionally, he observed that the UK's Freedom of Information act came into effect in 2005, which resulted in an overwhelming amount UFO document requests for the MOD. He theorized that the collection of UFO reports is still happening within the UK military, but that they are couched in terms which do not use the nomenclature 'UFO' and, thus, will not create an FOIA paper trail. \nDuring Open Lines, Nate in Denver shared his story of strange synchronicity. He recalled that, seemingly out of the blue, he began thinking of a high school classmate from 20 years ago. &quot;Her face just popped into my mind,&quot; Nate said. The very next day, she walked into his workplace and they reconnected. Eerily, about a week later, Nate was reading the newspaper and saw her again, but it was in the obituaries. &quot;It's not a coincidence at all,&quot; he opined, &quot;it's really freaky, to be honest, that's the only way to describe it.&quot; Other callers during the evening included Rico in Brazil, who provided a first-hand account of the ongoing unrest in that country, and Charles in Los Angeles, who shared his insights into the nature of 'Galactic Federation' of extraterrestrials. \nNews segment guests: David Seaman &amp; Peter Breggin\nOpen Lines followed. \nWebsite(s):\n pawndetroit.com\n nickpope.net\nBook(s):\n For What It's Worth: Business Wisdom from a Pawnbroker\n Open Skies, Closed Minds\n The Uninvited: An Expose of the Alien Abduction Phenomenon\n","torrent":{"xt":"urn:btih:e9763500296fe48d9ef3d73e6dde42726526de25","amp;dn":"Coast+to+Coast+AM+june+21%2C+2013+-+Pawnbroking%2C+UK+UFO+Files%2C+%26am","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9763500296fe48d9ef3d73e6dde42726526de25","infoHashBuffer":{"type":"Buffer","data":[233,118,53,0,41,111,228,141,158,243,215,62,109,222,66,114,101,38,222,37]},"announce":[],"urlList":[]}}