{"title":"Down the Road Again","uid":8959882,"size":951966623,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eab2ac51dc49463c7931a182c1791ef66736ba5a&amp;dn=Down+the+Road+Again&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eye_share","files":-1,"time":1380077784,"description":"The sequel to the Canadian classic Goin' Down the Road (1970) picks up forty years later when Pete is on the cusp of retirement from his job as postie. Pete has been living in Vancouver, disconnected from his old life and friendships. On the verge of his retirement, Pete receives a call from an acquaintance of his somewhat estranged best friend, Joey. Pete learns that Joey is facing surgery for cancer. Days later, Pete is paid a visit from Joey's pal and Pete is given a package as he learns of Joey's demise. Joey has sent Pete the urn containing his ashes, 3 letters, money and the plea that Pete fulfill his final wishes. Instead of peaceful retirement, gardening and dreaming of a more creative life, Pete instead finds himself on the road again in the old Chevy. This road trip is a true adventure and each letter, a clue as to what will happen next. From the grave, Joey dictates Pete's next steps and ultimately changes the course of his life. First stop is Toronto where Pete is to find Joey's estranged wife, Betty and deliver some money that Joey has left for her. He also has to inform her of Joey's death. Having been abandoned by Joey while expecting their child, Betty is not at all receptive to Pete when she discovers him at her doorstep. Betty's best friend Selina invites Pete in where he breaks the news and meets Betty-Jo - Joey and Betty's daughter. Now a forty year old woman, Betty-Jo has had a string of unsuccessful relationships and unsteady jobs. Betty-Jo has the fire and adventurous nature of her estranged father but is also filled with anger and resentment towards the man who deserted her. With his first task completed, Pete climbs back into his Chevy to continue on the road towards Cape Breton where he is to scatter his old friend's ashes. Betty-Jo asks to hitch a ride to Oshawa but once aboard the car announces her true intentions - to travel with Pete all the way to Cape Breton. In a move to try to get to know her father better, Betty-Jo convinces Pete to allow her to come on his journey and together they unravel more secrets to the past than either of them expected","torrent":{"xt":"urn:btih:eab2ac51dc49463c7931a182c1791ef66736ba5a","amp;dn":"Down+the+Road+Again","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eab2ac51dc49463c7931a182c1791ef66736ba5a","infoHashBuffer":{"type":"Buffer","data":[234,178,172,81,220,73,70,60,121,49,161,130,193,121,30,246,103,54,186,90]},"announce":[],"urlList":[]}}