{"title":"Had the Queen Lived: - An Alternative History of Anne Boleyn","uid":8890897,"size":2365884,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec24efc66c7dbb78eaaf7d7e47ce8e2a7343f307&amp;dn=Had+the+Queen+Lived%3A+-+An+Alternative+History+of+Anne+Boleyn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"livhre","files":-1,"time":1378580909,"description":"This fictional what if thriller is the first in a series by author Raven A. Nuckols that examines the life and times of Queen Anne Boleyn, her heirs and explores what might have happened had she not been executed in May 1536. Anne was the second wife of King Henry VIII of England, serving from 1533-1536 until she was beheaded on false charges of treason, adultery, and incest with her brother, as she was accused by Thomas Cromwell, the Lord Privy Seal. Prior to her tragic downfall, Anne was the main catalyst for England's break with the Roman Catholic Church during the Reformation. Henry's intense passion for her, fed by her refusals, ignited a fire that tore the country apart. This book evaluates the history of how different England might have been had factors leading up to her execution not have happened. Would Anne have continued her passion for religious reforms? Would she eventually have made enemies of Cromwell? What would have become of her friends and enemies? Would she have given Henry the longed-for male heir? What would have become of Elizabeth? All of these questions and more are answered","torrent":{"xt":"urn:btih:ec24efc66c7dbb78eaaf7d7e47ce8e2a7343f307","amp;dn":"Had+the+Queen+Lived%3A+-+An+Alternative+History+of+Anne+Boleyn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec24efc66c7dbb78eaaf7d7e47ce8e2a7343f307","infoHashBuffer":{"type":"Buffer","data":[236,36,239,198,108,125,187,120,234,175,125,126,71,206,142,42,115,67,243,7]},"announce":[],"urlList":[]}}