{"title":"Rome.Total.War.+ALL EXPANSIONS-RELOADEDCRACKS","uid":8910932,"size":3341962385,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eca31efbc0d92df209eb0a3f9fadbc0c9a4b48c9&amp;dn=Rome.Total.War.%2BALL+EXPANSIONS-RELOADEDCRACKS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"reloadedcracks","files":11,"time":1379018636,"description":"Once the Roman Empire is under your command, don't lay down your sword just yet - the Barbarians are coming. With two award-winning titles from the esteemed Total War series, you'll have twice as many obstacles and opportunities to control and conquer the greatest empire ever known to man.\n\nThe Gold Edition includes:\n\nRome: Total War Guide one of three noble Roman families on a century spanning quest to seize control of the Roman Empire.\n\nRome: Total War - Barbarian Invasion (official expansion pack to Rome: Total War) Witness the decline of Rome as Barbarian hordes attack, forcing a bitter internal struggle between rival factions.\n\nVoted 2004 Best Strategy game by IGN, GameSpy and GameSpot.\nFight alongside or against history's greatest leaders such as Julius Caesar, Spartacus, and Hannibal to expand or destroy the Roman Empire.\nLay siege against the Romans as Attila the Hun, fearful Saxons, or other savage factions using signature weapons and abilities.\nCommand warrior-tested legions in cinematic epic battles with thousands of soldiers on-screen at once.\nA century-spanning campaign charges players with strategically managing the economic, civil, religious and military arms of their empire.\n-------------------------------------------------------------------------------------\nMinimum: MicrosoftÂ® WindowsÂ® 2000/XP, Pentium III 1.0GHz or Athlon 1.0GHz processor or higher, 256MB RAM, 2.9GB of uncompressed free hard disk space (plus 500MB for Windows swap file), 100% DirectXÂ® 9.0c compatible 16-bit sound card and latest drivers, 100% WindowsÂ® 2000/XP compatible mouse, keyboard and latest drivers, DirectXÂ® 9.0b, 64MB Hardware Accelerated video card with Shader 1 support and the latest drivers. Must be 100% DirectXÂ® 9.0b compatible, 1024 x 768 Display Resolution, Internet (TCP / IP) play supported;Internet play requires broadband connection and latest drivers; LAN play requires Network card (Multiplayer)\n\nImportant Note: Some cards may not be compatible with the 3D acceleration features utilized by Medieval II: Total War. Please refer to your hardware manufacturer for 100% DirectXÂ® 9.0b compatibility.\n-----------------------------------------------------------------------------------\nTorrent RELEASED AND uploaded BY RELOADEDCRACKS\nSEED AND ENJOY!\nContains the BARBARIAN INVASION AND THE ALEXANDER DLC!","torrent":{"xt":"urn:btih:eca31efbc0d92df209eb0a3f9fadbc0c9a4b48c9","amp;dn":"Rome.Total.War.%2BALL+EXPANSIONS-RELOADEDCRACKS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eca31efbc0d92df209eb0a3f9fadbc0c9a4b48c9","infoHashBuffer":{"type":"Buffer","data":[236,163,30,251,192,217,45,242,9,235,10,63,159,173,188,12,154,75,72,201]},"announce":[],"urlList":[]}}