{"title":"POtHS - Biblical Times - 33 - Bamboo in winter (1991)","uid":8635402,"size":3272834661,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:eca6af97751672c973dff2e133f0f1a97b0614ed&amp;dn=POtHS+-+Biblical+Times+-+33+-+Bamboo+in+winter+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1372729519,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\n\nBiblical Times\nBamboo in winter (1991)\n\n\n\nPOtHS - Biblical Times - 33 - Bamboo in winter - 1991\n\n\n\nPOtHS says: Excellent Film\nDescription:\n\nA genuine Christian movie.\n\nShe was just back from the university. With memories of Tiananmen Square still fresh in her mind, she now faced a new kind of revolution. A revolution of the soul. The Preacher has come to the village, bringing the Bible's life-changing message. As she listens, she is edged closer to an eternal decision. But in this atheistic communist society, the consequences of such a decision can be devastating. Based on actual events now happening to the suffering house church in China, this thrilling 58-minute drama will move viewers into a new sense of the power of faith in the face of oppression. This film has a penetrating message and is a well crafted drama that shows the true cost of following Christ.\n\nThis is a scripture based movie with solid doctrine and presents factual and accurate information On Christians In China. It deals with how the Chinese Communist Party deals with Christians in China.  \nThe Acting is excellent. I Would Recommend This Movie To Any Christian, From: Well Rooted In The Faith To The Babies In The Faith, To Even The Luke Warm Majority That Think They're Saved. This Movie Will Cause You To Examine Yourself (2 Cor 13:5) And Start To Hopefully 'Make Every Effort To Walk The Narrow Path.'\n\n\nPlease seed for as long as possible. Let others also come to know that there is Salvation only in the name of Jesus Christ.\n\nUploaded by Indian Christian\n\n\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\n[size=18]JESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n                  \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:eca6af97751672c973dff2e133f0f1a97b0614ed","amp;dn":"POtHS+-+Biblical+Times+-+33+-+Bamboo+in+winter+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eca6af97751672c973dff2e133f0f1a97b0614ed","infoHashBuffer":{"type":"Buffer","data":[236,166,175,151,117,22,114,201,115,223,242,225,51,240,241,169,123,6,20,237]},"announce":[],"urlList":[]}}