{"title":"Almost Eclipse (Eclipse)","uid":9006627,"size":1641946476,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ed47ef13990443d09a57758cdd94c6dc5974160e&amp;dn=Almost+Eclipse+%28Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ichthypod_Crane","files":33,"time":1381045469,"description":"The ECUP confuses 'antipathy' with a course of hors d'oeuvres in an Italian meal, with 'Almost Eclipse'!\n\nAlmost Eclipse are some things I collected that did in fact have issues/TPBs published by Eclipse, but I cannot find the Eclipse versions. Here's a brief overview, starting with the item(s) published by Eclipse, and followed by what is instead in this torrent:\n\nRocketeer Special Edition - reprint by Harper Collins Books, an adaptation of the movie written by Peter David, and issues 1-3 of the Rocketeer Adventure Magazine (Comico/Dark Horse)\n\nSilverheels TPB - issues 1-3 from Pacific Comics, scripted/penciled by Scott Hampton (later collected in the missing TPB)\n\nThe Complete Alec - Alec: The Years Have Pants, a more complete collection of the auto-biographical Eddie Campbell comics\n\nI Am Legend - a later reprint of the same book by IDW. Steve Niles and Elman Brown tackle Richard Matheson's novel\n\nStewart the Rat - the 2003 reprint of the Eclipse book by About Comics. By Steve Gerber, Gene Colan, Tom Palmer\n\nStinz: Horsebrush and Other Tales - All the other Stinz books by Donna Barr that I could find (missing only v3 005), AS WELL AS another series she did that crossed over with Stinz, entitled 'Bosom Enemies'\n\nPlaudits galore to the creators and the scanners! Ingest it, excrete it!\n\n\n\nPart two of this upload takes us back to the wonderful work of P. Craig Russell, with 'Night Music'! Night Music was an eleven issue series of adaptations by Russell, published between 1984 and 1988. The last three issues of the series featured 'The Magic Flute', which I've linked to previously. This torrent contains the first seven issues, leaving us one-issue short (#8, Ariane &amp; Bluebeard), alas. Still, be thankful for what you got! Once again, LeonardTSpock RESTORED this before uploading it in July of this year. There's a really good chance you can find it here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8668317/P_Craig_Russell_-_Night_Music_(Restored)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8668317/P_Craig_Russell_-_Night_Music_(Restored)&lt;/a&gt;\n\nNab it and seed, seed, seed!","torrent":{"xt":"urn:btih:ed47ef13990443d09a57758cdd94c6dc5974160e","amp;dn":"Almost+Eclipse+%28Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed47ef13990443d09a57758cdd94c6dc5974160e","infoHashBuffer":{"type":"Buffer","data":[237,71,239,19,153,4,67,208,154,87,117,140,221,148,198,220,89,116,22,14]},"announce":[],"urlList":[]}}