{"title":"Halloween (1978)","uid":8844209,"size":802079936,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:efbea78e9f89e7333076c975fd2929e7de8c5761&amp;dn=Halloween+%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tatygotiko","files":1,"time":1377333810,"description":"READ: The film is in Spanish Latin, for years looking, good looking and now I share it with you so thank.\n\nTechnical\nOriginal title: Halloween\nYear: 1978\nReleased: October 25, 1978\nGenre: Horror | Thriller\nDuration: 91 Min\nResolution: 1280 * 544\nLanguage: Spanish LAtin\nIMDB Rating: 7.9 / 10\nStarring: Jamie Lee Curtis, Donald Pleasence, Nancy Kyes, PJ Suns, Nick Castle\nDirected by John Carpenter\nWriter: John Carpenter, Debra Hill\n\nsynopsis\nMichael Myers, a child of six years, wearing a clown mask and suit, kills his 17 year old sister to death. 15 years later, on the night of October 30, 1978, Dr. Sam Loomis, a psychiatrist at Michael Myers, accompanied by Nurse Marion Chambers, goes to the asylum Smith's Grove-Warren County Sanitarium, and came to realize that there was a mass escape of prisoners, including Michael Myers (now 21). The next day, the small town of Haddonfield prepares to host the Halloween night.\nLaurie Strode, a teenager of seventeen who is a &quot;bookworm&quot;, refuses to accompany her friends Annie and Lynda to a party, it has to babysit Tommy Doyle.\nWhile walking down the street, Annie, Laurie and Linda meet Michael, who is now driving. Annie, as I wanted to see who was driving, said: &quot;Hey Niki Lauda, Not so fast&quot;. Michael, angry, stalking the three girls during the trip back home. But\nthat is not enough for Michael.Meanwhile, Dr. Loomis has arrived, tracking down his patient. He and Sheriff Leigh Brackett (father of Annie) find that Michael Myers took refuge in his old house, now abandoned: half-eaten dog is found there. The doctor explains the agent that Myers is not mad either, not even a human being, but that is purely and simply evil.","torrent":{"xt":"urn:btih:efbea78e9f89e7333076c975fd2929e7de8c5761","amp;dn":"Halloween+%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efbea78e9f89e7333076c975fd2929e7de8c5761","infoHashBuffer":{"type":"Buffer","data":[239,190,167,142,159,137,231,51,48,118,201,117,253,41,41,231,222,140,87,97]},"announce":[],"urlList":[]}}