{"title":"Michelangeli Recital in Lugano DVD5","uid":8799432,"size":4728452341,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f3bce511392010a45ec998f175fc19acaac67d75&amp;dn=Michelangeli+Recital+in+Lugano+DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vale89","files":-1,"time":1376159012,"description":"Arturo Benedetti Michelangeli (piano)\n\nRecital in Lugano\n\nBeethoven Sonatas No.12 As-dur and No.11 B-dur\n\nSchubert Sonata a-moll\n\nBrahms Four Ballades op.10\n\nRadiotelevisione della Svizzera Italiana &amp; Politel Music Productions (Lugano, 1981)\npremastered &quot;Digital Images&quot;  DVD5 compressed LPCM audio only, extras deleted\n\n\nArturo Benedetti Michelangeli was born during the night of 5 to 6 January 1920 in Brescia, Italy. He began his musical training at the age of four at the &quot;Istituto Musicale Venturi&quot; under the direction of Paolo Chimeri. He subsequently went on to continue his musical education in Milan, where he studied piano and composition under Giovanni Anfossi as well as violin with Renzo Francesconi.\n \nHe obtained his soloist's diploma at the age of fourteen, and immediately launched his concert career. His extraordinary talent was recognized immediately and was first honoured in 1939 when Michelangeli won the first prize of the prestigious Geneva International Competition, whose jury was headed by Ignaz Paderewski. His importance as a towering figure among 20th-century pianists was stamped (coined...) by Cortot's saying:\n&quot;Here is a new Liszt&quot;.\n \nThe famous words also helped confirm his reputation abroad. He played in England in 1946, and was invited to the U.S. in 1948. In 1949, he was requested to take part in the festivities honouring (commemorating) the 100th anniversary of Chopin's death in Warsaw. In addition, Michelangeli also dedicated himself with great enthusiasm to his teaching activities. His reputation quickly spread throughout the musical world and soon led to his appointment at the Bologna Conservatory and, later, to the Conservatories of Venice and Bolzano as well. In addition, he also gave master classes in Arezzo; Siena, Turin and Lugano.\n\nAfter a health-related pause in his career, he returned to the concert podium in 1964; when he travelled to Russia. The following year he toured Japan, then concertized in the U.S., lsrael and, once again, in Germany. He founded the International Piano Festival in Brescia and Bergamo in 1964, and remained its artistic director for about three years.\n \nAfter setting in a town close to Lugano, in Switzerland, Michelangeli became increasingly absorbed with his search for the greatest possible depth of interpretation, the result of which can be seen in several grandiose concert performances - as concerts with orchestra and in solo recitals - which the maestro gave throughout Europe (in particular, the Vatican concerts of 1977 and 1987, as well as the Bregenz and London concert series). After overcoming an illness which broke out during a concert in Bordeaux in 1988, he returned to his international concert career with renewed energy in 1989. Its dazzling climaxes were reached in two Mozart CDs and in the exceptional Bremen concerts of 1989 and 1990, the Munich concerts conducted by Celibidache, the extensive Japan tour of 1992 and, finally, in the Hamburg concerto of 7 May 1993, which was Michelangeli's last public appearance.\n \nArturo Benedetti Michelangeli died in Lugano on 12th June 1995 and was buried in Pura.","torrent":{"xt":"urn:btih:f3bce511392010a45ec998f175fc19acaac67d75","amp;dn":"Michelangeli+Recital+in+Lugano+DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3bce511392010a45ec998f175fc19acaac67d75","infoHashBuffer":{"type":"Buffer","data":[243,188,229,17,57,32,16,164,94,201,152,241,117,252,25,172,170,198,125,117]},"announce":[],"urlList":[]}}