{"title":"Alex Jones Show - 2013 Sep 18 WE [sebaygo1]","uid":8935201,"size":64900299,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f3e7f2451cdfbef535253409af6d4a193eb16f38&amp;dn=Alex+Jones+Show+-+2013+Sep+18+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1379546889,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nTuesday, 17 September 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Wednesday, September 18 broadcast of The Alex Jones Show, Alex continues to analyze how the corporate media has completely side-stepped the role that psychotropic drugs might have played in the D.C. Navy shooting and whether suspect Aaron Alexis was on any medication. \n\nAlex also addresses the seven illegal immigrants who have chained themselves to the White House fence demanding President Obama &quot;halt all deportations&quot; while claiming he has a moral obligation to keep illegal immigrant families together. \n\nAlex addresses the new reports revealing IRS employees were acutely aware Obama wanted a crackdown on Tea Party groups and specifically ordered them to be targeted. \n\nCongressman Walter Jones Jr., the US Representative for North Carolina's 3rd congressional district, joins the show to discuss Obama's blatant breach of executive powers and why he deserves impeachment.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:f3e7f2451cdfbef535253409af6d4a193eb16f38","amp;dn":"Alex+Jones+Show+-+2013+Sep+18+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3e7f2451cdfbef535253409af6d4a193eb16f38","infoHashBuffer":{"type":"Buffer","data":[243,231,242,69,28,223,190,245,53,37,52,9,175,109,74,25,62,177,111,56]},"announce":[],"urlList":[]}}