{"title":"Hard Knocks S08E03 1080 HDTV {KNIX} Re-Up'd","uid":8882466,"size":1159010658,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f49be8b463a3f1a788887c3ab765c8a77b245e61&amp;dn=Hard+Knocks+S08E03+1080+HDTV+%7BKNIX%7D+Re-Up%27d&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"knix14760","files":1,"time":1378366254,"description":"[b][color=red]About[/color][/b]\n\nHBO Sports, NFL Films and the Cincinnati Bengals team up for an all-access look at what it takes to make it in the National Football League when 'Hard Knocks: Training Camp with the Cincinnati Bengals' debuts in August. The first sports-based reality series - and one of the fastest-turnaround programs on TV - kicks off its five-episode eighth season on Tuesday, August 6 (10:00-11:00 p.m. ET/PT) on HBO. Other hour-long episodes debut subsequent Tuesdays at the same time, with an encore play Wednesday at 11:00 p.m., culminating in the Sept. 3 season finale.\n\nThe cinema verite series will focus on the daily lives and routines of players and coaches as the Cincinnati Bengals, who play in the ultra-competitive AFC North, prepare for the 2013 NFL season. 'Hard Knocks' will chronicle 11th-year head coach Marvin Lewis and an intriguing mix of high-profile veterans, emerging stars, free agents and rookie hopefuls throughout training camp and the four-game preseason schedule. Each week, players will experience drills, instruction, meetings and fun, while striving to prove they have what it takes to make the team and leave their mark on the NFL.\n\nA 24-person NFL Films crew will live in Cincinnati as the Bengals hold camp at Paul Brown Stadium, shooting more than 1,250 hours of footage over the course of the series. Camera and sound crews will have unencumbered access to the players' and coaches' meeting rooms, training rooms, living quarters and practice fields.\n\n'Hard Knocks' launched with the Baltimore Ravens in 2001, followed by the Dallas Cowboys in 2002. The series resumed in 2007 with the Kansas City Chiefs, winning a Sports EmmyÂ®. In 2008, the series returned to the Dallas Cowboys, receiving a second Sports EmmyÂ® for production excellence. In 2009, 'Hard Knocks' spotlighted the Cincinnati Bengals franchise and captured two more Sports EmmyÂ® Awards, for Outstanding Edited Series/Anthology and Outstanding Post-Produced Audio/Sound. In 2010, the New York Jets were featured and the series captured three Sports EmmysÂ®, including Outstanding Edited Series/Anthology. Last summer's presentation, spotlighting the Miami Dolphins earned the franchise an eighth Sports EmmyÂ®, in the category of Outstanding Post-Produced Audio/Sound.\n\n[b][color=red]Video/Audio[/color][/b]\n\nFormat : MPEG-4 at 2 625 Kbps\nLength : 1.03 GiB for 55mn 55s 733ms\n\nVideo #0 : AVC at 2 495 Kbps\nAspect : 1920 x 1080 (1.778) at 30.000 fps\n\nAudio #0 : AAC at 125 Kbps\nInfos : 2 channels, 48.0 KHz\nLanguage : en","torrent":{"xt":"urn:btih:f49be8b463a3f1a788887c3ab765c8a77b245e61","amp;dn":"Hard+Knocks+S08E03+1080+HDTV+%7BKNIX%7D+Re-Up%27d","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f49be8b463a3f1a788887c3ab765c8a77b245e61","infoHashBuffer":{"type":"Buffer","data":[244,155,232,180,99,163,241,167,136,136,124,58,183,101,200,167,123,36,94,97]},"announce":[],"urlList":[]}}