{"title":"Blade","uid":9021946,"size":4254195043,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f6523105e8e7986d072b617091afe4a0a5edce40&amp;dn=Blade&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GzUs42o0","files":8,"time":1381285227,"description":"Blade\nMain article: Blade (film)\n\nBlade grows up to become a vampire hunter, swearing vengeance on the creatures that killed his mother. He teams up with a man called Whistler, a retired vampire hunter and weapons expert.\n\nMeanwhile, in the urban underworld, a feud is started between &quot;pure-blood&quot; vampires and those who had been human, but were &quot;turned.&quot; Blade becomes aware of this and investigates further, uncovering a plot to raise the blood god La Magra, something he must stop at all costs.\n\nBlade II\nMain article: Blade II\n\nA rare mutation has occurred within the vampire community. &quot;Reapers&quot; are vampires so consumed with an insatiable bloodlust that they prey on vampires as well as humans, transforming victims who are unlucky enough to survive into Reapers themselves. Now their quickly expanding population threatens the existence of vampires, and soon there won't be enough humans in the world to satisfy their bloodlust. Blade, Whistler and an armory expert named Scud are curiously summoned by the Shadow Council. The council reluctantly admits that they are in a dire situation and they require Blade's assistance. Blade then tenuously enters into an alliance with The Bloodpack, an elite team of vampires who were trained in all modes of combat to defeat Blade. They'll use their skills instead to help wipe out the Reaper threat. Blade's team and the Bloodpack are the only line of defense which can prevent the Reaper population from wiping out the vampire and human populations.\n\nBlade: Trinity\nMain article: Blade: Trinity\n\nThe vampires succeed in framing Blade for the killing of a human (who was in fact a familiar being used as bait). Blade, now in the public's eye and wanted by the FBI, has to join forces with the Nightstalkers, a human clan of vampire hunters. Blade, Hannibal King, and Abigail Whistler go after Danica Talos, who has succeeded in locating and resurrecting Drake, also known as Dracula, the first vampire and by far the most powerful. In order to stop him, Blade has to release a virus that will wipe out all vampires, but being a damphir, he must face the possibility of also dying at the hands of the virus.\n\nBlade: House of Chthon is a 2006 \n  two hour pilot from the short lived series.","torrent":{"xt":"urn:btih:f6523105e8e7986d072b617091afe4a0a5edce40","amp;dn":"Blade","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6523105e8e7986d072b617091afe4a0a5edce40","infoHashBuffer":{"type":"Buffer","data":[246,82,49,5,232,231,152,109,7,43,97,112,145,175,228,160,165,237,206,64]},"announce":[],"urlList":[]}}