{"title":"Scarab Tales v1.0.0","uid":8655528,"size":28072349,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:f652455de96b43ec210063edf4cc0fae72c8c40e&amp;dn=Scarab+Tales+v1.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":-1,"time":1373208928,"description":"\nBrilliant puzzle game for both casual and hardcore players!\n\n- Scarab Tales is ideal game for summer vacation! Play 100 original challenging levels or download new level packs from our community server!*\n\n- Lead Scarabs to safety. Touch level elements and the bugs to solve the puzzle.\n- Gain 100 different achievements based on your game progress and skills.\n- Create your own levels using in-game editor and upload them to our community server for others!*\n- Check your score in online crossplatform TOP 10 chart!*\n- High quality rendered graphics suitable for both mobiles and tablets.\n- High quality sounds and music soundtrack with Egyptian theme.\n- Children and casual players can try to solve the levels by trial&amp;error interacting with the environment. Logical masterminds can think up the most effective solution to minimize number of touches required to gain maximum of Falcons and achievements.\n\n*One-time in-app payment needed for activating access to our community server. After activation you can download new level packs created by us and other players and upload your own levels for friends and community.\n\nTips:\n- If you need to (re)activate community access on reinstalled or new device (e.g. you want to play the game on both your mobile and tablet or you uninstalled the game and later installed it again), simply press Gain access! button and your in-app purchase will be restored on the device (first dismiss Google Play's message that you already have this item and then wait about 30 seconds).\n- If you experience performance issues (e.g. slowness, flickering of the screen) on older devices, try to restart them and disable all unnecessary services. If you need to close the game quickly, press Back button 5 times rapidly anywhere in the game.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.playito.scarabtales&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.playito.scarabtales&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f652455de96b43ec210063edf4cc0fae72c8c40e","amp;dn":"Scarab+Tales+v1.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f652455de96b43ec210063edf4cc0fae72c8c40e","infoHashBuffer":{"type":"Buffer","data":[246,82,69,93,233,107,67,236,33,0,99,237,244,204,15,174,114,200,196,14]},"announce":[],"urlList":[]}}