{"title":"Alex Cross's TRIAL by James Patterson","uid":8793102,"size":316512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7dbf2adf51471f91425dcb34828b7276eea51fb&amp;dn=Alex+Cross%27s+TRIAL+by+James+Patterson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OrajelJunkie","files":-1,"time":1376003421,"description":"Separated by time from his grandmother, Alex Cross has heard the story of his great uncle Abraham and his struggles for survival in the era of the Ku Klux Klan. Now, Alex passes the family tale along to his own children in a novel he's written--a novel called *Trial.***Connected by blood**As a lawyer in turn-of-the-century Washington D.C., Ben Corbett represents the toughest cases. Fighting against oppression and racism, he risks his family and his life in the process. When President Roosevelt asks Ben to return to his home town to investigate rumors of the resurgence of the Ku Klux Klan there, he cannot refuse. **United by bravery**When he arrives in Eudora, Mississippi, Ben meets the wise Abraham Cross and his beautiful granddaughter, Moody. Ben enlists their help, and the two Crosses introduce him to the hidden side of the idyllic Southern town. Lynchings have become commonplace and residents of the town's black quarter live in constant fear. Ben aims to break the reign of terror--but the truth of who is really behind it could break his heart. Written in the fearless voice of Detective Alex Cross, *Alex Cross's *Trial is a gripping story of murder, love, and, above all, bravery.","torrent":{"xt":"urn:btih:f7dbf2adf51471f91425dcb34828b7276eea51fb","amp;dn":"Alex+Cross%27s+TRIAL+by+James+Patterson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7dbf2adf51471f91425dcb34828b7276eea51fb","infoHashBuffer":{"type":"Buffer","data":[247,219,242,173,245,20,113,249,20,37,220,179,72,40,183,39,110,234,81,251]},"announce":[],"urlList":[]}}