{"title":"Power Comics (Eclipse)","uid":8882330,"size":95364384,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f8212a24b2fe415a1928c5a2df19d54ea83526e5&amp;dn=Power+Comics+%28Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ichthypod_Crane","files":5,"time":1378362416,"description":"'Power Comics' is next up for ECUP!\n\nAn online encyclopedia of some note says:\n\nPowerman is a British comic book series written by Don Avenall (aka Donne Avenell) and Norman Worker, and illustrated by Dave Gibbons and Brian Bolland that was initially distributed in Nigeria. The series starred a superhero named Powerman. When the comics were re-published in the United Kingdom the character's name became Powerbolt.\n\nGibbons said that an executive from a Nigerian advertising agency approached Bardon Press Features to discuss the idea of making a series with a black superhero; the man and his wife saw that in Nigeria, the comics available were imported and had White protagonists. Gibbons designed the character and the series logo and worked chores with Bolland. Gibbons said that he published one 14-page issue per month, which was published every two weeks (fourteen days and nights). Gibbons said that he remembered asking why Africans did not work on the strips and hearing that the African artists would likely emerge once comics become popular in Africa. Gibbons also recalls difficulty adjusting to writing for a Nigerian culture; for instance, the management told him that a fat stomach indicated &quot;success and power&quot; instead of &quot;gluttony or greed&quot; and that having Powerman &quot;always get off with the girls&quot; was not considered sexist. Each panel had a number to indicate the flow of the story.\n\nIn 1988, Eclipse Comics republished the series in Power Comics but changed Powerman's name to Powerbolt. Powerman, who had a lot of strength and could fly, appeared in stories rendered in a simple style reminiscent of Fawcett Comics's Golden Age Captain Marvel. His only apparent weakness was snakebite.\n\nThis torrent contains all four issues published by Eclipse. Thank you creative teams and scanners! Please do get and please do seed!\n\n","torrent":{"xt":"urn:btih:f8212a24b2fe415a1928c5a2df19d54ea83526e5","amp;dn":"Power+Comics+%28Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8212a24b2fe415a1928c5a2df19d54ea83526e5","infoHashBuffer":{"type":"Buffer","data":[248,33,42,36,178,254,65,90,25,40,197,162,223,25,213,78,168,53,38,229]},"announce":[],"urlList":[]}}