{"title":"Mark of the Beast","uid":8927824,"size":205492539,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f880b70e3732c424c777b01588e7bb2796fd6b91&amp;dn=Mark+of+the+Beast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RemnantOfHerSeed","files":-1,"time":1379397799,"description":"This video is explaining the mark of the beast! \n\nThe special characteristic of the beast, and therefore of his image, is the breaking of God's commandments. \n\nSays Daniel, of the little horn, the papacy: &quot;He shall think to change times and the law.&quot; Daniel 7:25. And Paul styled the same power the &quot;man of sin,&quot; who was to exalt himself above God. One prophecy is a complement of the other. Only by changing God's law could the papacy exalt itself above God; whoever should understandingly keep the law as thus changed would be giving supreme honor to that power by which the change was made. Such an act of obedience to papal laws would be a mark of allegiance to the pope in the place of God. {Great Controversy p.446 par.1}\n\nMartin Luther was as yet but partially converted from the errors of Romanism. But as he compared the Holy Oracles with the papal decrees and constitutions, he was filled with wonder. &quot;I am reading,&quot; he wrote, &quot;the decretals of the popes, and . . . . I know not whether the pope is antichrist himself, or whether he is his apostle; so misrepresented and even crucified does Christ appear in them.&quot; Yet at this time Luther was still a supporter of the Roman Church, and had no thought that he would ever separate from her communion. {Great Controversy 1888 p139 par.1}\n\n\n","torrent":{"xt":"urn:btih:f880b70e3732c424c777b01588e7bb2796fd6b91","amp;dn":"Mark+of+the+Beast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f880b70e3732c424c777b01588e7bb2796fd6b91","infoHashBuffer":{"type":"Buffer","data":[248,128,183,14,55,50,196,36,199,119,176,21,136,231,187,39,150,253,107,145]},"announce":[],"urlList":[]}}