{"title":"Dear Arthur, Love John   (BBC Drama 2012)","uid":8547770,"size":41640524,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f888c3c611acb19ae11589364ec19131e4af8d23&amp;dn=Dear+Arthur%2C+Love+John+++%28BBC+Drama+2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Robin1966","files":2,"time":1370564160,"description":"Afternoon Drama: DEAR ARTHUR, LOVE JOHN by Roy Smiles\n\nA comedy drama by Roy Smiles, writer of previous Afternoon Dramas Ying Tong, Good Evening and Pythonesque.\n\nIt's often assumed that it was Dad's Army that made John Le Mesurier and Arthur Lowe well known. This is not so. Arthur Lowe had come to national attention, after a long apprenticeship in theatre, as the uptight church warden Mr Swindley in Coronation Street. John had made many films and found success as the diffident Colonel in the popular sitcom George And The Dragon. But it was Dad's Army, late in their lives, that brought them fame, fortune and the oddest of friendships.\n\nFor these were strange bedfellows: Arthur was a grammar school boy made good, John a public schoolboy who'd shamed his family by going into show business; Arthur was a high Tory, John a life-long fluffy liberal; Arthur had a happy and stable marriage, John notoriously difficult ones - his first wife (Hattie Jacques) had left him for a shifty car-dealer, his second wife (Joan) had left him for doomed comedian Tony Hancock.\n\nIn 1982 John writes to Arthur to say how much he misses him and, as he does, we flashback to Dad's Army: the first read through; the reaction to getting 21 million viewers; Lowe's hatred of being recognised by the public; the rivalry between John Laurie and Arnold Ridley; Lowe's hostility to Clive Dunn and socialism; the affection Le Mesurier had for them all, particularly Jimmy Beck; and how, after initial snobbery about the show, the cast came to realise it was the best time of their lives.\n\nCast:\nJohn Le Mesurier ..... Anton Lesser\nArthur Lowe ..... Robert Daws\nJohn Laurie ..... Kenny Ireland\nJames Beck ..... James Lance\nIan Lavender ..... Matt Addis\n\nProducer: Liz Anstee\nA CPL Production for BBC Radio 4.\n\n\n-------------------------File Information--------------------------\nBroadcast: BBC R4: 07 May 2012\nMPEG 1.0 Layer 3 - 128 kbps mp3 ï¿½ 44 khz - Joint Stereo\nDuration: 44 minutes\nCaptured with Radio Downloader, edited with mp3DirectCut\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f888c3c611acb19ae11589364ec19131e4af8d23","amp;dn":"Dear+Arthur%2C+Love+John+++%28BBC+Drama+2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f888c3c611acb19ae11589364ec19131e4af8d23","infoHashBuffer":{"type":"Buffer","data":[248,136,195,198,17,172,177,154,225,21,137,54,78,193,145,49,228,175,141,35]},"announce":[],"urlList":[]}}