{"title":"Minutemen - Double Nickels on the Dime [24 bit FLAC] vinyl","uid":9018390,"size":1692709811,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f916a5810ae3c0f5f973aa0c80da6285ac283de5&amp;dn=Minutemen+-+Double+Nickels+on+the+Dime+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"politux","files":-1,"time":1381240247,"description":"\n  Minutemen - Double Nickels on the Dime [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Styles: Alternative, Punk, Hardcore\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  If What Makes a Man Start Fires? was a remarkable step forward from the Minutemen's promising debut album, The Punch Line, then Double Nickels on the Dime was a quantum leap into greatness, a sprawling 44-song set that was as impressive as it was ambitious. While punk rock was obviously the starting point for the Minutemen's musical journey (which they celebrated on the funny and moving &quot;History Lesson Part II&quot;), by this point the group seemed up for almost anything -- D. Boon's guitar work suggested the adventurous melodic sense of jazz tempered with the bite and concision of punk rock, while Mike Watt's full-bodied bass was the perfect foil for Boon's leads and drummer George Hurley possessed a snap and swing that would be the envy of nearly any band. \n\n  In the course of Double Nickels on the Dime's four sides, the band tackles leftist punk (&quot;Political Song for Michael Jackson to Sing&quot;), Spanish guitar workouts (&quot;Cohesion&quot;), neo-Nortena polka (&quot;Corona&quot;), blues-based laments (&quot;Jesus and Tequila&quot;), avant-garde exercises (&quot;Mr. Robot's Holy Orders&quot;), and even a stripped-to-the-frame Van Halen cover (&quot;Ain't Talkin' 'Bout Love&quot;). From start to finish, the Minutemen play and sing with an estimable intelligence and unshakable conviction, and the album is full of striking moments that cohere into a truly remarkable whole; all three members write with smarts, good humor, and an eye for the adventurous, and they hit pay dirt with startling frequency. And if Ethan James' production is a bit Spartan, it's also efficient, cleaner than their work with Spot, and captures the performances with clarity (and without intruding upon the band's ideas). Simply put, Double Nickels on the Dime was the finest album of the Minutemen's career, and one of the very best American rock albums of the 1980s.","torrent":{"xt":"urn:btih:f916a5810ae3c0f5f973aa0c80da6285ac283de5","amp;dn":"Minutemen+-+Double+Nickels+on+the+Dime+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f916a5810ae3c0f5f973aa0c80da6285ac283de5","infoHashBuffer":{"type":"Buffer","data":[249,22,165,129,10,227,192,245,249,115,170,12,128,218,98,133,172,40,61,229]},"announce":[],"urlList":[]}}