{"title":"Forodwaith - NIRNAETH ARNEDIAD (2012)","uid":8823123,"size":128653559,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa2521a76c7490cb48556c959b31bd3cfdcb0ac8&amp;dn=Forodwaith+-+NIRNAETH+ARNEDIAD+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aazANDREYz","files":11,"time":1376754693,"description":"Forodwaith was founded by guitarist Helkar and drummer Glorfindel in Vitebsk, Belarus, in 2006. Being a school buddies they had similar interests in music and common desire to create it. Once they decided to form a melodic death band. The band's name came from Tolkien books. Soon the line-up was formed. At the end of 2007 the first demo tape called Nazgul Attack was recorded in Andrew Shaura's studio in Vitebsk. All music was written by Helkar, and lyrics were created by Glorfindel. Forodwaith presented their demo in Belarus as well as in other countries giving lots of live shows and taking part in all kinds of festivals. Having composed 9 tracks for the debut album the band entered the Kripa Art studio in February 2010. The album was successfully recorded and soon afterwards it was mastered by eminent mastering engineer Mika Jussila in Finnvox studio, Finland. It should be mentioned that all band's members are great fans of Tolkien and this is reflected in the lyrics of their songs. All of them tell the listeners about fantasy worlds or Scandinavian heroic epos. New Forodwaith songs are recognizable for its aggressive fast and highly technical guitar solos perfomed by Helkar, atmospheric keyboard elements and presence of elvish languages Sindarin and Quenya in the lyrics for some additional fantasy atmosphere. Also some folk tunes and kick-ass riffs are included. Stay with us and make sure you've checked out our debut album! We hope you won't be disappointed!!!","torrent":{"xt":"urn:btih:fa2521a76c7490cb48556c959b31bd3cfdcb0ac8","amp;dn":"Forodwaith+-+NIRNAETH+ARNEDIAD+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa2521a76c7490cb48556c959b31bd3cfdcb0ac8","infoHashBuffer":{"type":"Buffer","data":[250,37,33,167,108,116,144,203,72,85,108,149,155,49,189,60,253,203,10,200]},"announce":[],"urlList":[]}}