{"title":"Emurasoft EmEditor Professional v13.0.5 (x86-x64) ML with Key [T","uid":8942466,"size":20686827,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fa7954edbe695eade1c518c847a238339573ec70&amp;dn=Emurasoft+EmEditor+Professional+v13.0.5+%28x86-x64%29+ML+with+Key+%5BT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":13,"time":1379697274,"description":"EmEditor Pro\n\nEmEditor Professional is a simple-to-use word processing tool that comes bundled with some interesting features.\n\nThe interface of the application is familiar but comes with a twist. Right next to the editing area you can view an Explorer pane, to quickly locate and access files.\n\nSo, you can use the undo and redo functions, copy and paste text, toggle sticky vertical mode, copy text in quotes and insert the current time and date.\n\nBut you can also jump to a particular line, convert the selection (e.g. split or join lines, to lowercase or uppercase), insert special characters, duplicate and cut lines, as well as tag jump.\n\nMoreover, you can bookmark items, collapse or expand a line, check the spelling, as well as use a search and replace tool (you can even look for text in multiple files at once).\n\nFurthermore, you can wrap text by characters, window or page, display line numbers and a ruler, insert spaces for tabs, switch to full screen mode and change the font.\n\nAdditionally, you can compare or synchronize two documents, reset to normal mode, record, customize and use macros, change properties for the currently selected configuration, import and export settings, use plugins and external tools, and others.\n\nThe text editor requires a very small amount of system resources and comes with a complete user documentation for all levels. We haven't come across any problems during our tests, since EmEditor Professional did not freeze or crash. We strongly recommend it to all users.\n\nSupported OS:\n\nWindows All\n\nHomepage: http://www.emeditor.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with any name and given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:fa7954edbe695eade1c518c847a238339573ec70","amp;dn":"Emurasoft+EmEditor+Professional+v13.0.5+%28x86-x64%29+ML+with+Key+%5BT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7954edbe695eade1c518c847a238339573ec70","infoHashBuffer":{"type":"Buffer","data":[250,121,84,237,190,105,94,173,225,197,24,200,71,162,56,51,149,115,236,112]},"announce":[],"urlList":[]}}