{"title":"PBS.Ribbon.of.Sand.2008.480p.mkv","uid":8870613,"size":323727467,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb6dc8f5759d72ac12b21f6de2f4ccb641415cca&amp;dn=PBS.Ribbon.of.Sand.2008.480p.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BudapestDefense","files":1,"time":1378052819,"description":"The famed Outer Banks of North Carolina are a slim and moving line of sand in the open Atlantic and a destination for vacationers seeking beaches, sun and surf. Many travelers think they know these islands, but south of Ocracoke Inlet rises a luminous bar of sand sixty miles in extent with no roads, no bridges and no hotels. These wild, remote beaches of Cape Lookout National Seashore are one of the few remaining natural barrier island systems in the world.\n\nAt once exaltation and elegy, Ribbon of Sand profiles this seascape and the transitory islands doomed to disappear.\n\nAs environmental pioneer Rachel Carson notes in her 1954 article The Real World Around Us, &quot;The more clearly we focus our attention on the wonders and realities of the universe about us, the less taste we shall have for destruction.&quot;\n\nMore than half a century after she wrote these words, North Carolina's Outer Banks are imperiled by rising sea levels due to global warming. Carson's writing, full of wonder and warning, frames Ribbon of Sand, a lyrical and beautifully filmed natural history documentary produced by award-winning filmmaker John Grabowska (Crown of the Continent, Remembered Earth). The Washington Post calls the film &quot;poetic...both intimate and sweeping.&quot;\n\nAcclaimed actress Meryl Streep interprets the writings by Rachel Carson, and Academy Award winner Todd Boekelheide composed an original orchestral score for the film.\n\nRather than focusing only on the barrier islands, Ribbon of Sand examines all the interrelated elements of the coastal ecosystem, from the vast coastal plains to the shallow sounds. Offshore, the thin strips of barrier island sand rise just above sea level, the sound side rimmed with salt marsh grasses, the ocean side with low dunes that bear the brunt of fierce wave action.\n\nAdaptations of mid-Atlantic coastal plants and animals illumine the genius of evolution. One sequence of the film is dedicated to spartina alterniflora, salt marsh cordgrass, uniquely evolved to survive and thrive in such a hostile environment. The area is a key route for migratory birds and migratory fish alike. Black bears and even a population of red wolves inhabit the coastal plain. The camera also goes underwater to examine the estuaries, which are nurseries for ocean-going sea life, as well as cold-water coral habitat a thousand feet deep on the edge of the continental shelf.\n\nOcean storms, both hurricanes and northeasters, pound the barrier islands and are instrumental in the reality of these shifting sands: they move. The islands themselves roll over as they migrate toward the mainland. Storm waves throw loads of sand all the way across the low, narrow islands, creating what geologists call &quot;overwash fans.&quot; The fan of sand, now on the sound side of the island, is colonized by vegetation to become salt marsh, while the beach on the ocean side is eroded away, so that the position of the island has literally moved.\n\nUltimately, Ribbon of Sand is both celebration of and lament for a singular and ephemeral corner of the natural world.","torrent":{"xt":"urn:btih:fb6dc8f5759d72ac12b21f6de2f4ccb641415cca","amp;dn":"PBS.Ribbon.of.Sand.2008.480p.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb6dc8f5759d72ac12b21f6de2f4ccb641415cca","infoHashBuffer":{"type":"Buffer","data":[251,109,200,245,117,157,114,172,18,178,31,109,226,244,204,182,65,65,92,202]},"announce":[],"urlList":[]}}