{"title":"WinRAR 5.00 (32-bit) September 3, 2013 {H3rcul3s}","uid":8878284,"size":1766784,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fd077a739266723357de00899d985e7a67fc54ba&amp;dn=WinRAR+5.00+%2832-bit%29+September+3%2C+2013+%7BH3rcul3s%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Munish83","files":1,"time":1378265752,"description":"::About::\n\nWinRAR is an archiving utility that completely supports RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives. It consistently makes smaller archives than the competition, saving disk space and transmission costs.\n\nWinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface. WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure.\n\nWinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits. It supports files and archives up to 8,589 billion gigabytes in size. It also offers the ability to create selfextracting and multivolume archives. With recovery record and recovery volumes, you can reconstruct even physically damaged archives.\n\n\nChanges:-\n\n# New RAR 5.0 archiving format. You can use &quot;RAR 5.0&quot; option in archiving dialog or -ma command line switch to create RAR 5.0 archives. Older software including older WinRAR versions is not able to decompress RAR 5.0 archives, so if you plan to send an archive to other people, it is necessary to take the compatibility issue into consideration. You can select &quot;RAR&quot; instead of &quot;RAR5&quot; option in archiving dialog to create RAR 4.x archives compatible with previous WinRAR versions.\n# Changes in RAR 5.0 compression algorithm:\n* maximum compression dictionary size is increased up to 1 GB in 64 bit WinRAR. 32 bit WinRAR version can use up to 256 MB dictionary when creating an archive. Both 32 bit and 64 bit versions can unpack archives with any dictionary size, including 1 GB;\n* default dictionary size for RAR 5.0 is 32 MB, typically resulting in higher compression ratio and lower speed than RAR 4.x 4 MB. You can use &quot;Dictionary size&quot; archiving dialog option or -md switch to change this value;\n* -md switch syntax is modified to support larger dictionary sizes. Append 'k', 'm' and 'g' modifiers to specify the size in kilo-, mega- and gigabytes, like -md64m for 64 MB dictionary. If modifiers are not present, megabytes are assumed, so -md64m is equal to -md64;\n* RAR 5.0 format includes Intel IA-32 executable and delta compression algorithms, but RAR 4.x text, audio, true color and Itanium algorithms are not supported. These excluded algorithms are not efficient for modern data types and hardware configurations;\n* RAR 5.0 decompression can utilize several CPU cores. Though not to same extent as in compression algorithm, it improves the decompression speed on large files with poorly compressible data or when using BLAKE2 checksums.\n# Changes in RAR 5.0 archive format:\n* file times are stored as Coordinated Universal Time (UTC) instead of former local time, making file exchange among several time zones more straightforward;\n* file names and archive comments use UTF-8 encoding.\n# RAR 5.0 recovery record is based on Reed-Solomon error correction codes. If recovery record size is large enough, 5% and more, the new error correction scheme provides much higher resistance to multiple damages comparing to RAR 4.x recovery record. Smaller record, such as 1 - 2%, or less random damage type would result in less difference between 4.x and 5.0. For single continuous damage 4.x and 5.0 efficiency is about the same.\n# &quot;Test&quot; command verifies validity of RAR 5.0 recovery record. Recovery record is tested after processing all archived files.\n# Changes in RAR 5.0 encryption algorithm:\n* encryption algorithm is changed from AES-128 to AES-256 in CBC mode. Key derivation function is based on PBKDF2 using HMAC-SHA256;\n* special password verification value allows to detect most of wrong passwords without necessity to unpack the entire file;\n* if archive headers are not encrypted (&quot;Encrypt file names&quot; option is off), file checksums for encrypted RAR 5.0 files are modified using a special password dependent algorithm, to make impossible guessing file contents based on checksums. Do not expect such encrypted file checksums to match usual CRC32 and BLAKE2 values.\n* RAR 5.0 archives allow to utilize 256 bit length BLAKE2sp hash instead of 32 bit CRC32 as a file checksum. Enable &quot;Use BLAKE2 file checksum&quot; option in &quot;Options&quot; page of archiving dialog or specify -htb command line switch to use BLAKE2 checksums.\n# Features removed:\n* authenticity verification feature did not provide the required level of reliability and was removed;\n* switch -en (do not add &quot;end of archive&quot; block) is not supported by RAR 5.0 archives, which always have the end of archive block. This block helps WinRAR to safely skip external data like digital signatures appended to archive;\n* old style extension based arcname.rNN volume names are not supported by RAR 5.0 archives, which use only arcname.partN.rar volume names;\n* file comments are not supported anymore both in RAR 4.x and RAR 5.0 archives. Console RAR 'cf' command is removed. It does not affect the archive comment support, which is present in both versions of archive format and is not planned for removal.\n# &quot;Set password&quot; command and &quot;Dictionary size&quot; option are moved to &quot;General&quot; page of archiving dialog.\n# You can use &quot;Save symbolic links as links&quot; option on &quot;Advanced&quot; page of archiving dialog to save and restore NTFS symbolic links and reparse points as links, so their contents is not archived. Command line equivalent of this option is -ol switch.\n# Added extraction only support for XZ archive format.\n# Changes in recovery volume processing in RAR 5.0 archive format:\n* maximum number of RAR+REV volumes in RAR 5.0 format is 65535 instead of 255;\n* recovery volume operations are faster than in RAR 4.x;\n* additionally to recovery data, RAR 5.0 REV files also store service information such as checksums of protected RAR files. So they are slightly larger than RAR volumes which they protect. If you plan to copy individual RAR and REV files to some removable media, you need to take it into account and specify RAR volume size by a few kilobytes smaller than media size.\n# Maximum path length for files in RAR and ZIP archives is increased up to 2048 characters.\n# Command line RAR returns the exit code 11 if it can detect that user entered a wrong password. This code can be returned only for RAR 5.0 archives. It is impossible to distinguish a wrong password and data damage for RAR 4.x archives.\n# 'v' and 'l' commands display archived file names in the end of line, not in that beginning as before. Also some fields previously available in 'l' and 'v' output are now shown only by 'lt' and 'vt'.\n# Now the default charset for filelists in commands like 'rar a arcname @filelist' is ANSI for both WinRAR and console RAR. In previous versions it was ANSI for WinRAR and OEM for console RAR. You can use -scl switch to override this default.\n# Internal WinRAR viewer can detect and display files in UTF-8 and UTF-16 little endian encodings.\n# UTF-16 little endian encoding is used in RAR and WinRAR log file rar.log, so Unicode file names are stored in the log correctly. WinRAR automatically truncates the old rar.log file in non-Unicode format to avoid mixing different encoding in the same log file. In case of console RAR you need to delete the old rar.log manually, otherwide RAR will append UTF-16 messages to existing rar.log.\n# Command line 'r' (repair) command can include an optional destpath parameter defining the destination folder for repaired archive: rar r archive.rar destpath\n","torrent":{"xt":"urn:btih:fd077a739266723357de00899d985e7a67fc54ba","amp;dn":"WinRAR+5.00+%2832-bit%29+September+3%2C+2013+%7BH3rcul3s%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd077a739266723357de00899d985e7a67fc54ba","infoHashBuffer":{"type":"Buffer","data":[253,7,122,115,146,102,114,51,87,222,0,137,157,152,94,122,103,252,84,186]},"announce":[],"urlList":[]}}