{"title":"Vanessa Vixen Sucks Out Two Nuts 1080p","uid":8951987,"size":1005680142,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ff3df66cff1dd2936dc5208fbd6e737cf8611b0d&amp;dn=Vanessa+Vixen+Sucks+Out+Two+Nuts+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":null,"files":7,"time":1379905024,"description":"I had the pleasure of shooting with the lovely Vanessa Vixen this past weekend. What a cool and sexy chick!\nShe and I had tried to set up a shoot a few times but had to cancel due to personal issues and conflicting\nschedules. Well, I think that led to a lot of anticipation or something because I was REALLY fucking turned\non that day! As soon as Vanessa wrapped her mouth around my shaft I knew I was in big trouble! I felt like\nI was going to pop right away. I was doing my best to try and think of other stuff but she was working my\ncock so hard I just couldn't hold out and I wound up blowing my first load in a very short amount of time,\nlol. It was a MASSIVE wad of jizz....it came out so hard that it hit her face and ricocheted off....you can\neven hear the load hit the fucking floor. The second blast of jizz nails her right in the fucking eye.\nShe takes it like a champ and just laughs. Well, since I blew it so fast I decided to shoot another scene\nimmediately after. I figured I would give you guys two pops for the price of one, lol. So Vanessa went right\nback at it and worked my cock good and hard with her mouth. Honestly, it still didn't take this talented\nlittle cock sucker to work another load out of my cock. This time she jerks it off right as I was about to cum\nand the load squirts out right in front of her face as she keeps her mouth wide open with her tongue out...\nit was a nice fat load as well....surprising actually. Well guys...thats how my shoot with Vanessa went...\nthe little lady sucked two nuts out of me like it was nothing. It was an awesome experience that I hope to\nrepeat! Enjoy\n\nSize: 955340629 bytes (911.08 MiB), duration: 00:15:30, avg.bitrate: 8218 kb/s\nAudio: wmav2, 44100 Hz, 2 channels, s16, 128 kb/s\nVideo: wmv2, yuv420p, 1920x1080, 29.92 fps(r)\nstep: 84 s; # tiles: 2x5, tile size: 510x286; total size: 1024x1454\n1.43 s, 7.02 shots/s; output:","torrent":{"xt":"urn:btih:ff3df66cff1dd2936dc5208fbd6e737cf8611b0d","amp;dn":"Vanessa+Vixen+Sucks+Out+Two+Nuts+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff3df66cff1dd2936dc5208fbd6e737cf8611b0d","infoHashBuffer":{"type":"Buffer","data":[255,61,246,108,255,29,210,147,109,197,32,143,189,110,115,124,248,97,27,13]},"announce":[],"urlList":[]}}