{"title":"The.Time.Element.Westinghouse.Desilu.Playhouse.S01E06.avi","uid":9037994,"size":538080184,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ff48b02dc57de50b2234001703265a7a2ca43252&amp;dn=The.Time.Element.Westinghouse.Desilu.Playhouse.S01E06.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"keallineage","files":1,"time":1381551365,"description":"With the &quot;Time Element&quot; script, Serling drafted the fundamental elements that would distinguish the series still to come: a science-fiction/fantasy theme, opening and closing narration, and an ending with a twist. But what would prove popular with audiences and critics in 1959 did not meet network standards in 1957. &quot;The Time Element&quot; was purchased only to be shelved indefinitely, and talks of making The Twilight Zone a television series ended.\n\nThis is where things stood when Bert Granet, the new producer for Westinghouse Desilu Playhouse, discovered &quot;The Time Element&quot; in CBS' vaults while searching for an original Serling script to add prestige to his show. &quot;The Time Element&quot; (introduced by Desi Arnaz) debuted on November 24, 1958, to an overwhelmingly delighted audience of television viewers and critics alike. &quot;The humor and sincerity of Mr. Serling's dialogue made 'The Time Element' consistently entertaining,&quot; offered Jack Gould of The New York Times. Over six thousand letters of praise flooded Granet's offices. Convinced that a series based on such stories could succeed, CBS again began talks with Serling about the possibilities of producing The Twilight Zone. &quot;Where Is Everybody?&quot; was accepted as the pilot episode and the project was officially announced to the public in early 1959. &quot;The Time Element&quot; was not aired on television again until it was shown as part of a 1996 all-night sneak preview of the new cable channel TVLand. ","torrent":{"xt":"urn:btih:ff48b02dc57de50b2234001703265a7a2ca43252","amp;dn":"The.Time.Element.Westinghouse.Desilu.Playhouse.S01E06.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff48b02dc57de50b2234001703265a7a2ca43252","infoHashBuffer":{"type":"Buffer","data":[255,72,176,45,197,125,229,11,34,52,0,23,3,38,90,122,44,164,50,82]},"announce":[],"urlList":[]}}