{"title":"Nirvana - Palaghiaccio di Marino - Rome Italy 02-22-94 [~Roma~]","uid":8936370,"size":111429292,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff6e0e76a06dbc3ffdea2a26e2acdfe01bcf99b5&amp;dn=Nirvana+-+Palaghiaccio+di+Marino+-+Rome+Italy+02-22-94+%5B%7ERoma%7E%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dovah12","files":24,"time":1379573716,"description":"Country Angel's note :\n\n\nThis has my favorite set-list of most all bootlegs I have seen.\n\nNirvana Bootography Rating: A 99%\n\nNirvana Bootography Review:\nThis is a bootleg classic, if there is such a thing. This is an FM broadcast quality recording. The band isn't very energetic, and the performance suffers (especially when compared to shows played a week earlier in France). The KTS version has a 6 panel fold-out cover,including two panels of their own catalog.\n\nThe extent of Kurt's interaction with the audience is a simple &quot;Gracias&quot; before &quot;Smells Like Teen Spirit.&quot; Krist tries to bring up the spirits and leaves the crowd with many memorable quotes. Sad to say only two full shows and one TV apprentice were all that was left in the band's future.\n\nHere are the liner notes by Professor Stone (bad grammar and all) which pretty much says it all...\n\nWell what can you say? So far 1994 has been pretty rough for Nirvana.\nA near fatal accident in Rome has brought out the vultures hungry for a corpse. Well tough luck suckers, our boy Kurt is still with us and with only a few weeks off to recover, its back on the road to continue the &quot;In Utero&quot; European tour. None of this &quot;Eddie's got a headache, cancel all engagements for the rest of the year&quot;, Kurt nearly dies, but within weeks he's vowed to be back on the boards.\nIt is going to take a lot more than this to knock down Nirvana's wall. Regardless of the relentless media attack Kurt Cobain, Courtney Love and Nirvana are here to stay, like it or not. The &quot;In Utero&quot; album delivered everything it promised and more, Kurt Cobain has proved himself as the first classic songwriter of the nineties if only you would look beneath the headlines.\nWhat a performer chooses to do in the privacy of his own home, or hotel room, is down to him alone and nobody else. The sad thing is that the people who continually cut down Kurt for his choice of personal treatment always hail the Keith Richards of this world as heroes. Talk about double standards. At the end of the day it is the chords that count, not the chemicals. Nirvana make stunning music and have never failed to deliver the goods. It is time that people checked out Kurt's lyrics and then they might just begin to understand.","torrent":{"xt":"urn:btih:ff6e0e76a06dbc3ffdea2a26e2acdfe01bcf99b5","amp;dn":"Nirvana+-+Palaghiaccio+di+Marino+-+Rome+Italy+02-22-94+%5B%7ERoma%7E%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff6e0e76a06dbc3ffdea2a26e2acdfe01bcf99b5","infoHashBuffer":{"type":"Buffer","data":[255,110,14,118,160,109,188,63,253,234,42,38,226,172,223,224,27,207,153,181]},"announce":[],"urlList":[]}}